{
  "node_name": "root_id=9",
  "description": "root",
  "texts": [
    "the wedding of my brother",
    "I HAVE BOUGHT A NEW RING.",
    "I can remember the graduation day I got the degree certificate, the smile on my parent`s face made the 3 years of hell worth it.",
    "I made a new friend on the TV station tour.",
    "I learned how to drive stick shift.",
    "I've made most of the corrections I need to my paper before resubmitting it to my adviser.",
    "i have headache but my wife is smiling about it.",
    "Today I was able to give out coats to my co-workers for an upcoming event.",
    "I was happy seeing my daughter's dance performance in school.",
    "While i was travelling in my bike today morning, cool breezeeeeee hit me for about ten minutes, which made me feel very happy.",
    "My Boss called me this morning and said I earned the day off!",
    "I went to a busy gas station where they offer free air during rush hour and the person using the air pump just finished as I pulled in.",
    "I had free play at a casino and I won a small jackpot with it.",
    "I went to the gym in the morning.",
    "I received a monetary bonus.",
    "It was when we went to Florida for vacation.",
    "My wife had been sick for a few days, then I found out it was because we were having a baby.",
    "I finished my college semester with a 4.0.",
    "I changed my hair style and I tried some new style and that fits me well and that moment makes me feel happy.",
    "My friends had planned a surprise baby shower for me. I wasn't expecting one at all and really didn't want to plan one myself, but to my surprise they were planning behind my back. It made me really happy that they decided to do this for me.",
    "My boyfriend telling me I would be flying business class to Europe.",
    "My wife and I went out on a date last month that was perfect. We were able to get away and spend some time to ourselves.",
    "Having lunch on our deck with the dog yesterday. The weather was ideal. The morning had been a bit stressful and lunch with the dog was the break that I needed.",
    "I went to a friend's house last night and we played video games for hours.",
    "I took my three year old daughter to the dentist for the first time ever, and she was very well behaved.",
    "I left my purse at home and my boyfriend came and brought it to me at work.",
    "I'm happy that my college contacted me about a reunion.",
    "MY son made the varsity baseball team",
    "My brother asked me to go to Seattle along with my cousin so it would cheer me up while I was having a hard time coping with dropping out of university my fourth year.",
    "I went with my fiancA(c)s parents to show them our wedding venue and to start planning the layout and details. We spent all morning together starting to think about ideas and then went out for brunch together. I was so happy thinking about the wedding and also just being able to spend time with them. They truly are my parents too.",
    "I came up with a good idea for a gift for my sister who is graduating from college.",
    "My niece told me she loves me.",
    "I finished reading a book that i had been struggling with",
    "My boyfriend made the best burgers on the grill last night, they were delicious!",
    "The Golden State Warriors beat the San Antonio Spurs in game 1 of the Western Conference Finals.",
    "I attended a musical concert in my city with family.",
    "I had a delicious dinner with my girlfriend last night.",
    "A phone app is finally running well after months of problems.",
    "I smoked a cigarette because I was bored and got a little buzz.",
    "I was able to bbq outside because the weather was nice and that made me happy.",
    "I felt happy when I finished a very long tedious task at work. I had been working on it for the past two days that basically involved recoding a data set.",
    "Feel asleep to the sound of a rain storm.",
    "We filed our taxes and are getting a small refund!",
    "I made enough money to turn my gas back on after three months.",
    "My friends and me went for Go-karting.",
    "Colorado Rockies have been playing really good baseball this year.",
    "I finished cleaning my old apartment to officially move out.",
    "i went to the shooting range to try out a new gun.",
    "I discovered a few additional ways I might make extra money on the internet to boost my income. These possibilities offer me hope and hope always makes me very happy.",
    "I found a baby bunny hiding on the side our barn.",
    "I had a nice evening with my family and friends. We had a potluck and had good conversation.",
    "The new Games of Thrones season 7 trailer came out and it was amazing.",
    "Prior to this, I worked in art for years. My pieces might sell, but I rarely won anything, particularly in a mixed show. That started to change in the summer of 2016. Though these were not big awards, i suddenly started to get honorable mentions, merit awards, and even a few 3rd places. I was floored. This streak of winning went until January -- nearly 6 months. It is the first time in my LIFE that this has ever happened.",
    "I was happy when my partner rubbed my sore back for me.",
    "I upped the maximum miles I can walk, to seven, up from five.",
    "Finished watching Unbreakable Kimmy Schmidt: Season 3.",
    "I found a great new Beef and Broccoli recipe.",
    "My new Xbox One video game Mass Effect: Andromeda arrived from Amazon via UPS delivery.",
    "I went to Tokyo and explored the city.",
    "I sold an item I didn't want anymore on eBay for a good deal of money to use toward a gift for someone.",
    "I ordered some product in amazon.in and it got delivered today, that moment makes me feel happy.",
    "An old patient of mine sent me a little note for Nurses Week on Facebook and that is what made me happy.",
    "I love play baseball in the Stadium with my Friends",
    "yesterday i went to shopping with my family to buy lot of toys for my son making more happy for me and my family...",
    "I got to go grocery shopping and bought lots of great stuff.",
    "I got to spend several days in a row with my girlfriend where we did not have to do anything but enjoy each others company and do whatever we wanted to do such as catching up on our rest and loving each other.",
    "I had got a promotion in work as a manger yesterday because of the success we have received in last two projects.",
    "Another event that made me happy was the end of a shift at the clinic where the provider gave me feedback and let me know that I was doing very well.",
    "When I'm with my kids.",
    "This morning my husband let me sleep in, and made french toast for breakfast.",
    "My puppy was in a mood to play fight, so we proceeded to play fight for a few minutes.",
    "I earned a lot of money playing a game with a group for a study.",
    "I finally had a cheeseburger after a long time.",
    "My Dad's 89th b-day made me happy to see him and spend time with him.",
    "My son gave me a hug and told me he loves me.",
    "I met my friend for lunch.",
    "Yesterday, I cleared all my pending tasks such as buying house stuffs etc., then i could spare time for myself. I would like to do this frequently.",
    "Had a good lunch at Santa Barbara.",
    "I passed my math test which was the deciding factor if I passed the class or not.",
    "I watched Between Two Ferns.",
    "I started volunteering at the Atlanta Humane Society again.",
    "I've been having a lot of fun with a new Fire Emblem game I've bought recently.",
    "My birthday was yesterday and several friends gave me a party.",
    "My girlfriend told me that she had gotten the job she had applied for.",
    "Our new cat tree arrived, and while assembling it, Carol watched a while, then suddenly jumped on it and went to town like old times.",
    "I finally got to eat dinner last night after playing music for several hours and missing dinner.",
    "Yesterday I took my son and his sister to a new park where they had a lot of fun and met some new kids.",
    "I found a bag of candy that was unopened when I was hungry.",
    "Today I went to temple.",
    "I took my nephew out to the zoo and I had a great time watching him really enjoy himself.",
    "I was able to lose a few pounds I'd been carrying.",
    "What made me happy was getting ice cream last night.",
    "When my daughter kissed my pregnant stomach.",
    "Sleeping extra late.",
    "I got Chinese food for dinner, it was good.",
    "I was looking at a group of pictures on facebook and one picture and the comments beneath it made me laugh.",
    "I filled my collection of army kettles and mess tins with several more kits that I didn't have until now.",
    "I made and baked chocolate chip cookies.",
    "I received flowers at my office for a celebration of Admin Professionals Day. All the ladies in the office did, but my card had an individual note from the partners thanking me for being \"the glue that holds things together\". It made me feel really good and was a total surprise.",
    "I had lunch with some friends at work and we had a engaging conversation about our plans for the weekend",
    "last 3 days ago i can propose love to my girl friend. she was accepted my LOve Purpose.",
    "Annie my cat started feeling better after she was sick.",
    "when everyone in my family is getting along. that makes me happy",
    "On 17th March 2017 by celebrating this happy occasion I gave a lunch party to the staff of the hospital. After finishing the lunch all the staff gave their blessings to our new born child. The chief doctor put his hand on the head of our child and blessed deeply. I would not forget this happy occasion in my life.",
    "I WENT TO SHOPPING WITH MY FAMILY BUYING LOT OF TOYS FOR MY SON IS MY HAPPIEST MOMENT IN THE FAST 24 HOURS....",
    "Seeing my wife happy and content after watching her brother and sister in law go through a difficult surgery.",
    "I went to the doctor and he told me that the swelling on my leg would be alright and that more than likely I didn't break anything.",
    "The real surprise is when the wish unexpectedly comes true. I never believed that something like this could ever happen to me; such a thing that would make me stop and look back at the events in awe.",
    "Started my post graduation",
    "I completed a very challenging 2000 piece puzzle the other day with the help of a few friends.",
    "My friend bought me food.",
    "My son got a part in the school performance, which he had been hoping for!",
    "I spent time with my cat.",
    "My favorite program ended a storyline that I hated.",
    "I had a great evening at synagogue",
    "Booking my ticket for my vacation to Europe! I am so excited to be visiting! New adventures await!",
    "I got the lawn mowed.",
    "I had nice lunch with my friends in Taj Hotel.",
    "I saw an old friend I hadn't seen since high school.",
    "getting more money",
    "My dog and my cat were playing together. I just got a puppy and my cat is 13 years old.",
    "I bought season passes for my family to the area amusement /water park.",
    "In office i got selected to drive a six sigma quality project. During the kick off meeting the project owner introduced me in front of the whole team about my plus points and all people started appreciating about my knowledge.",
    "My cousins came over to my house for the very first time ever since I got married.",
    "What made me happy was getting a nice gift from my boss.",
    "My wife told me she loves me.",
    "I talked to my mother.",
    "I had a good talk with my wife.",
    "an event that makes my sister happy last month was her wedding",
    "MY BIRTHDAY CELEBRATED WITH MY FRIENDS AND RELATIVES AT BEACH . ITS VERY HAPPY",
    "I went shopping and found some really cute items.",
    "Last night I spent a couple hours talking with a friend I had not spoken to in a while.",
    "I was able to pay off some bills that had piled up.",
    "The woman I'm dog sitting for paid me twice as much as I was expecting!",
    "Had dinner with my Family, now that my dad is getting over being sick.",
    "I fix some issues with webite related work, kind of glad I was able to figure it out",
    "I worked out at the gym and got a lot done during it.",
    "I was happy when I was able to go to a college basketball game for the team I root for.",
    "Playing games with my friends.",
    "when I left my previous job.",
    "I was able to throw a party for a friend that was fun",
    "I had waffles for breakfast and decided to load up on peanut butter and syrup.",
    "My parents picked up my son for a day at the park.",
    "WE WENT TO GOVA",
    "I Was Very Happy To see my Cousins at My Place for a summer Vacation.",
    "Pet my cat",
    "I got my nephew a birthday present he never expected and he was absolutely gleeful.",
    "A friend agree to hit up happy hour after work the following day so we can catch up.",
    "My girlfriend got drunk and was extremely mean to me. She said some things that she shouldn't have due to the alcohol. When I came home from work the next day, she had a hand written card and dinner waiting to apologize. It made me feel as though she truly cared about me, and I was grateful to have her.",
    "I got a long-overdue haircut and it looks very nice.",
    "Hearing that my sister-in-law passed all her exams.",
    "I went grocery shopping after putting it off for almost a week, so now I have new food in the fridge",
    "My business partners and I made solid progress on a deal we have been working hard to move forward. Today, we took a very major step in closing the deal.",
    "Yesterday afternoon got the results of the state test and my son got a 100 percent, such a proud happy moment.",
    "I met a friend at a bar and had some drinks.",
    "I went to the movies to watch Furious 8.",
    "I got a text from a friend whom I haven't heard from in a while.",
    "I ran into my ba Brittany who seemed much happier to see Big Dad than usual.",
    "I made homemade onion rings for the first time today.",
    "I celebrated a religious holiday that I had not celebrated in a long while due to living away from my family and was happy to feel connected to my religious community and heritage.",
    "Talked to my landlord and got things figured out",
    "I have been getting bonuses from my job which is i'm getting regularly, it is one of the happy moments",
    "I was happy when my great-grandmother sent me a short text saying \"I'm so proud of your accomplishment. Thanks for being you.\"",
    "I bought a fancy camera in anticipation of an upcoming trip to Japan.",
    "I was incredibly worried about coming up with the cost for a very formal dress for an upcoming family member's wedding, and my mother-in-law offered to purchase it for me.",
    "A week ago they gave me the registration of my first company.",
    "I went to San Francisco to see friends.",
    "I got recovered from the disease i had",
    "Feeling like I made a difference at work.",
    "The biggest challenge was to pick the winners because there were so many photos that we loved! That is why we decided to share the top 10 happiest moments with you here including the captions that we received with them.",
    "Hanging out a couple of coworkers on Thursday.",
    "I hit an awesome ace while playing tennis this morning.",
    "I came home to awesome roommates with great company.",
    "Watching The Bachelorette made me happy.",
    "I went to shopping and got discount up to 25% for sunglasses.",
    "I went out with my friends to the bars and got to talk to some people i havent seen an a while.",
    "My husband made a good profit in business today. I am very happy because of that.",
    "My cat slept on my lap.",
    "2 months back doctor stopped all cholesterol and BP medicine for my husband, as it came under control. So i felt happy and relieved",
    "Someone commented a social media post that meant a lot to me.",
    "I won $2 on a lottery ticket.",
    "My daughter cooked dinner",
    "My daughter who is only 5 years old had been playing around in the park. All of a sudden she stopped playing and ran to me to give me a hug and then again she ran away and started playing.",
    "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
    "i got a raise from my job. i was surprised because i was not expecting it.",
    "I reached a desirable ranking on the game I play.",
    "I made plans to meet up with a friend tonight that I don't see very often.",
    "Saw Ghost in the Shell.",
    "Having my daughter surprise me with some flowers she picked from the yard.",
    "Yesterday, we went out to airport in order to receive my niece, who is returning back to mother country after her 3 months foreign trip.",
    "This morning, I woke up to a nice breakfast from my significant other. I always appreciate them taking the time to care for me when I am sick.",
    "Finishing a project at work and getting praise for it.",
    "My dad came over this morning and it made me happy to see him.",
    "I saw a family member I haven't seen for a while.",
    "I finally got the chance to apply for a credit card in my new bank",
    "I had a client express deep gratitude for the work I've done for her - she said I had changed her life.",
    "Wrote my last final for college and now I'm finished college for the summer.",
    "The days when I was able to use my metal detector again because the weather was nice. I had gone to the beach in search of some treasure and although I only found some coins, it made me feel happy to partake in my hobby again after a long winter.",
    "A few weeks ago, I had went to a concert that I had been waiting for over four months for. I had traveled for two and a half hours to get there and the concert was amazing.",
    "Me and my friend got a big fight and we didnt sleep till next day early morning. Evening when we met she hugged and slept on my shoulders while driving to home. I was happy and thought everything is pleasant again.",
    "My rabbits were described as 'in excellent health and beautiful condition' at their vet check-up.",
    "I got to sleep in until almost 9 this morning. We have a 4 year old who wakes us up by saying the sun is up. He slept in. YAY!",
    "I finished reading the library book I wanted to read and it was a good story.",
    "I had a big, delicious burger for dinner.",
    "What made me happy was when I finally paid off my apple watch with the money from Mturk. I was very happy.",
    "I got a raise at my job.",
    "My best friend graduated from college.",
    "I discovered a carton of Jello Pudding in my refrigerator just as I was finishing lunch yesterday and savored the treat.",
    "I did my makeup well and I looked pretty.",
    "My grandma came to visit from Jersey.",
    "I was carrying several items in a gas station and arrived to the counter at the same time as someone who was rushing in. I noticed she was in a hurry, so I insisted she go ahead, and this noticeably cheered her up, which made me feel proud of myself.",
    "I had a phone call with some old friends",
    "Water sprays to dress",
    "I got a lot closer to transferring schools.",
    "I found out that my husband gets monday off and doesnt have to work overtime this weekend so thats great news!",
    "a special night with my wife after long trip",
    "My brother took me to his shop for a cup of coffee.",
    "I went to wawa and I bought a yummy quesadilla which was delicious and filling.",
    "THE GIFT PRESENTED BY MY HUSBAND MADE ME VERY HAPPY.NO MATTER HOW DOES THE GIFT WORTH,ITS ALL BECAUSE THE GIFT IS FULL OF HIS LOVE.",
    "A three day trip to Phoenix for some spring training baseball with a friend.",
    "My husband was paid early today so we are able to pay rent.",
    "I started my wedding planning!",
    "Went to a comedy show.",
    "A neighbor's 13 year old boy did some yard work at my home, did a fantastic job and the garden area is looking great!",
    "Two days before I went to my grandmother house.",
    "I became happy when I finished my thesis paper for Law School.",
    "joing in degree",
    "I got a promotion at my job. I got a significant pay raise as well as managerial benefits.",
    "I talked to my best friend via text after not having any time to talk to any friends recently.",
    "I finally received my masters through this site",
    "Trip with my new born baby. Awesome clicks captured.",
    "My investments increased in value by over 10%.",
    "My vet figured out my cat's disease and he has started recovering after getting the right medication.",
    "I was so happy on the day that the last of the snow melted.",
    "I was able to go out to eat with my family.",
    "It was the best day in my life.. I Married my spouse.. it was my dream come true.. Very happy to have such a wonderful girl in my life... she always give positivity.. it was happiest moment in life..",
    "I found $20 on the sidewalk.",
    "I was happy when my boyfriend agreed to go on a road trip through the southwest and said to start planning the details.",
    "I purchased new furniture for my bedroom.",
    "Yesterday I helped my class of special education students release the butterflies we have been watching grow from caterpillars!",
    "Seeing the temperature rise into the eighties.",
    "I got a phone call from one of my grandsons telling me that he was chosen to interview for a prestigious internship at Harvard University. I am still smiling",
    "I attended a crawfish boil with my family.",
    "After checking Craig's List and the local want ads for a couple weeks, there are kittens available to adopt!",
    "I picked up a puppy about two months ago. It is a breed that is hard to find in New York state. Pembroke Welsh Corgis",
    "I made twenty dollars.",
    "The day when my girlfriend moved in with me.",
    "I reached my weekly fitness goal in running.",
    "MY BROTHER BIRTHDAY WE ARE GOING TO HOTEL THAT IS HAPPY MOMENT IN MY LIFE.",
    "While eating breakfast, i felt a light jab from my border collie, she had gathered the paper dish the bird tossed from the top of his cage and brought it to me for her task treat!",
    "A friend brought their newborn baby to visit .",
    "Listening a certain song when goes on the long drive in the car and feeling very blissful on that time how much Fun I'm having.",
    "I went shopping and found out that I had enough money in my food budget to buy good quality food.",
    "Yesterday was thursday, so a snack cart comes around the office and gives us snacks.",
    "A woman friend of mine living in Vancouver suddenly stopped posting on Facebook. We were friends even offline. She had helped me in writing the romance novel I am doing. I wrote to her several times with no reply. I was worried and asked even her other friends on Facebook but no one knew what had happened to Lisa. I was resigned to the fact that maybe she was dead. I did not know her home address or phone. Suddenly I received an email the other day. She asked me not to get angry. She added she would write again later to explain everything.",
    "I got my tax refund back and was able to catch up on bills and purchase some items I've been needing.",
    "One month ago my wife and I went fishing on the bighorn river.",
    "yesterday went to railway station to pick up my mother. A blind man was crossing the road and was struggling to cross. I just hold his hand and helped him to cross the road. The man was very thankful. The help that I did gave me heartful of satisfaction and happiness",
    "I am on vacation next week, so I can spend the whole week hanging out with my family.",
    "I bought a car 2 months ago,that was the first vehicle i bought,I felt very happy and proud.",
    "When I saw the ultrasound of our baby move around. It made me realize how precious life can be and its the little moments that make it all worth it.",
    "I am sticking to my daily workout goals. That's an achievement which makes me happy and satisfied.",
    "Normally we have sex whenever we get time. After we came from the engagement ceremony I could not resist to look at my wife who was looking very sexy. I took her in my hands. She also did not resist. and finally we had a very satisfying sex.",
    "i am very happy because i marry with my lover , she is very beautiful and i love so much, i am really love her and now i marry her , i am very lucky so i am very happy",
    "I beat a very difficult dungeon in Final Fantasy 15 that took me hours to get through, therefore unlocking a very powerful weapon that will help me beat the game entirely.",
    "I smoked a good cigar.",
    "I scored well in my Astronomy test.",
    "Preparing for an exam. Completed one of the books.",
    "I have been married a month now as of two days ago, it was definitely one of the happiest days I've had in the past few months.",
    "I spontaneously took a trip to visit a guy that I've been seeing two weeks ago.",
    "making espresso after i wake up",
    "My cousin took first place in a state-wide truck driving competition a few weeks ago.",
    "Taking a hot shower made me feel happy.",
    "A friend invited me out for a drink last night and it made me happy that someone wanted to spend time with me.",
    "getting iced coffee from starbucks",
    "I had a beautiful morning filled with a great workout and prayer session.",
    "Go out to eat burgers with my family",
    "I've been sober over five months now, and barely miss drinking.",
    "I celebrated my wedding anniversary.",
    "I sold an item from my business online and made a profit of ~US$7.00",
    "I was having lunch with my family. Since my childhood we have a pattern in our home, first everybody at our home has lunch while my mother serves and while we are on our last Roti she too joins with her plate.I was little extra hungry. She had just joined with her plate along with my sister. I asked her for Roti. She said \"Wait I am making one for you\" and she left her seat.I held her hand and said, \"Mumma! I am in some cooking mood. You have food, I will make a roti for me\". She said, \"Why will you work in kitchen while I am here?\"I said, \"I want to make a roti\" and I left my seat. Sister popped up saying, \"Have this roti from mummy's plate, complete your lunch and then make a roti for mumma.\"I said, \"Well! You are falling for a dangerous act.Hahahahah.\" I completed my lunch and started with roti, This was it! Previously I have cooked many times, but only for me. This was the first time I cooked for mother.I made a roti and served it to mother. She made 3 parts of it, one for my sister, one for my father and one for herself. They all had their parts and I was observing them with suspense about comments.Sister chuckled, Your wife is lucky, you can feed her deliciously. Father giggled, Your Gf must have said you to learn cooking this morning.Mother was little emotional, she said, My son has grown up. Roti is",
    "I felt a moment of inspiration about how I could be happy in life...by thinking about all that I could look forward to in the future.",
    "I have started dating someone and we recently took our first road trip together. He would reach over and grab my hand from time to time and it was really nice.",
    "An event that made me happy in the last 24 hours is cooking a home made pizza. The event caused me to appreciate the little things in life, like enjoying a simple meal at home.",
    "I went to a park in my city to watch a concert last week.",
    "HEARING SONGS AND SINGING",
    "I was watching South Park and all the episodes that were played today were hillarious and I was laughing throughout the whole thing.",
    "Winning the chess completion.",
    "I finally received a package in the mail that I had been waiting for.",
    "Watching Seth Smith hit the go ahead homer for the Orioles.",
    "I was able to teach a customer some new tricks to make his job using our product easier.",
    "I was really happy when my family surprised me by making dinner and it was delicious.",
    "Started working on my book again.",
    "I was happy when I cuddled my cat.",
    "I changed some furniture around to give my living room a new feel and it has made things more comfortable.",
    "Having time to watch old classic movies",
    "I went movie with my lover very first time after my engagement made very happy.",
    "The insurance company came and looked at the roof, so I don't have to deal with that anymore.",
    "One of my best friends got admission into one of the best masters course of the world.",
    "It made me happy to see my dad sitting outside on the patio at the hospital last week after his being in the ICU since the end of February.",
    "I spent time with my friends playing dungeons and dragons for the first time in about 20 years.",
    "I unexpectedly saw an old friend at the casino and he sold heroin, I was easily able to hit myself, and I got so high.",
    "OFFICE OPEN FIRST MARCH 16",
    "I realized I've read 1/5 of a quite boring book and it didn't take me too long. In other words, the task I have to do won't take much time.",
    "I was able to take a half day at work.",
    "Won a very large tournament in one of my new hobbies.",
    "I received an email from the library that all of the books I had just requested are ready to be picked up.",
    "My parents surprised me with an electric lawnmower, which makes maintaining my yard much easier.",
    "My sister brought me a cupcake",
    "I received some fun new outfits in the mail.",
    "I ate one of my favorite dishes, Maryland lump crabcakes.",
    "Going to the new Power Rangers movie with my father made me happy.",
    "I found out last week that one of my favorite DJs is playing a show in my city this month.",
    "MY BIRTH DAY MAY 1",
    "I was so happy to trade my truck for a Honda shadow 750 love this bike it has brought me so much happiness and freedom.",
    "I was very happy to see my husband after he was away working for the last two and a half months.",
    "I got to drink a beer from the brewery that was previously unavailable in my state.",
    "My cousin and her boyfriend came to visit me.",
    "I went to my local grocery store and saw a local celebrity who took time to take a picture with me.",
    "I had some white chocolate chip, macadamia cookies.",
    "I got a package of free dog food samples in the mail.",
    "A few days ago I was happy to watch my child and his little league team win the tournament.",
    "I ate a wonderful breakfast",
    "I bought pizza and my family was happy.",
    "My wife made a cake after a long long time, which was very very yummy.",
    "I found few good discounted deals on branded clothesline, and on actually buying new clothes made me really happy.",
    "Finished cleaning a part of my house.",
    "I did not eat dessert even though I really wanted it.",
    "My dog gave me the sweetest kiss earlier today. It really made my day, I was already feeling under the weather.",
    "I was happy when Liana pointed at shapes for the first time.",
    "my wife fell asleep early last night so i got to watch 3 episodes of my show",
    "Today I was happy when class was let out half an hour early.",
    "Having lunch with my two best friends on Saturday made me happy.",
    "I hatched the duck eggs I've been incubating! They finally hatched and the babies are soft.",
    "I walked 5 miles this morning",
    "A woman talked to my boss to give me praise.",
    "I had a nice, hearty breakfast.",
    "I don't get to spend as much time with my sister now that I have my son, so I am happy that my sister invited me out for dinner tonight.",
    "Took the day off from work yesterday.",
    "Someone brought me home a pizza for dinner.",
    "The order that I placed 3 times finally arrived correctly after the store sent the wrong product twice.",
    "My husband took us out for dinner.",
    "last night i do sex with my lover",
    "I watched a good show.",
    "I had a pasta, potatoes, cilantro, tomato, cucumber, and avocado dish. It was rather delectable and is one of my favorite dishes. It made me happy because it is such a great tasting combination of food.",
    "I found out a few days ago that my daughter earned a 4.0 GPA this semester!",
    "I got to play with my new puppy husky named Kaede.",
    "I hugged my fiance.",
    "I finally got my blood pressure under control",
    "I have not cheated one time on my diet since starting it, which is a huge accomplishment and makes me happy.",
    "I took my grandson Joe who is 2 1/2 swimming and he was so cute and fun.",
    "Just yesterday after I showed my artwork to a professor, he said that it is \"wonderful, great idea\".",
    "I decided to begin a new business.",
    "I got my paycheck. I feel very happy getting it. I like getting the paper check despite the fact it is direct deposit.",
    "My son had a good day today. When I came home from work I was pleased to see that he had cleaned his room and taken a shower like I had asked. He even sat down with me and told me about his field trip today. I felt very close to him.",
    "I built a pond in my garden and Put 10 golden carp fishes in it. It was after many days of heavy digging and effort that I was able to finish it. I am happy to see the fishes thrive in the pond alogn with the natural pond vegetation.",
    "One moment in the last three months that made me happy was the first time my daughter ever called me \"Daddy.",
    "I bought new running shoes that were on sale",
    "I spent two hours on the phone with my sister yesterday- she is the only family remember who lives in another state.",
    "I ate gourmet donuts.",
    "I talked with my girl freind long time on phone and we had a lot of fun talking and laughing.",
    "I bought a new house and go out of my crappy apartment.",
    "I finished all of the laundry that had been piled up.",
    "My brother had another baby with his wife, so now I have 2 nieces!",
    "Construction began on my backyard from last month and it looks amazing.",
    "I took a walk today while the weather was nice and sunny.",
    "I had a really enjoyable walk and pub visit with friends on one of the first sunny spring afternoons of the year.",
    "I had a romantic date with my partner and we had a great night.",
    "My daughter made me a mother's day magnet at school",
    "I took my daughter to Corning Glass Museum for the day.",
    "I traveled to a country I have never visited.",
    "Everything else be coming more interesting when its exam time enjoying the moment. When i heared the announcement of exam time table, at that time, i felt little tensed for preparation. But after completed all the exams, i really felt free with blissful.",
    "My supervisor helped me out with a phone call.",
    "I met one of my old friend in a wedding ceremony and talk many matters.",
    "Today the road is free from traffic and i enjoyed riding my bike.",
    "Talking to my friend, knowing that the money is going in the bank, giving others hope.",
    "I received an unexpected bonus of $5.00 on a turk job.",
    "I saw a really cute girl at the gym and she winked at me. I felt a lot of confidence and felt good.",
    "I completed and filed my taxes.",
    "It was great experience being herea|. Two years|. I learnt many things|. Now when I look back I feel|.the changesa| Itas the similar feeling I had when I graduated two years backa| how time changes and how life keeps on moving without a pause|. People comea| people goa|. We laugh we crya|. Some really low moments|. Some really higha|. Life is so beautiful in its own waya|.",
    "I bought some new shoes and clothes because I got a new job.",
    "Returning home from vacation to my pet cat.",
    "Tonight I walked in the house after work and my daughter came running up to me, excited because she peed in the \"big girl potty\" when she got home.",
    "My rebate for purchasing 4 tires came in the mail last night, so I can pay for my alignment.",
    "I was happy when I found time to exercise.",
    "I had a great pizza for dinner.",
    "The moment my daughter went and sat on the potty all by herself made me happier than ever.",
    "I got news from my friend that his parents said it's okay for me to stay over for a week",
    "I went to pick up my god kids (who I don't get to see a lot) from school. I was waiting at the entrance that my god daughter exists out of and when she saw me she ran to hug me.",
    "I have an old pet that people wanted me to get rid of after I had a bad accident. They decided to leave me alone about my pet. So, I get to keep her.",
    "It made me happy to give lots of chocolates to my boyfriend on his birthday.",
    "My daughter hugged me and told me how much she oved me in front of her friends.",
    "Last semester I took seven classes and passed all of them with straight A's.",
    "My favorite ice cream place opened for the season and I bought and ate a quart of my favorite flavor.",
    "My daughter looking and me and smiling left me happy.",
    "3. I was able to spend some quality time with my friends.",
    "I love this crumb cake a very specific one that my grocery store never stocks, but last week they had it . I was so happy to be able to purchase it and eat it all.",
    "Last night I played a co-operative video game with 2 of my best friends for over 3 hours",
    "My niece won a scholarship to college.",
    "When I found a place to live I could call home."
  ],
  "description2taxonomy": {
    "features purchases or gifts; specifically, the text highlights happy moments related to buying or receiving material items. For example, 'I was overjoyed when my friend gifted me a beautiful piece of jewelry.'": {
      "node_name": "root_id=9_node=-2951656769382429305",
      "description": "features purchases or gifts; specifically, the text highlights happy moments related to buying or receiving material items. For example, 'I was overjoyed when my friend gifted me a beautiful piece of jewelry.'",
      "texts": [
        "My new Xbox One video game Mass Effect: Andromeda arrived from Amazon via UPS delivery.",
        "I received flowers at my office for a celebration of Admin Professionals Day. All the ladies in the office did, but my card had an individual note from the partners thanking me for being \"the glue that holds things together\". It made me feel really good and was a total surprise.",
        "I WENT TO SHOPPING WITH MY FAMILY BUYING LOT OF TOYS FOR MY SON IS MY HAPPIEST MOMENT IN THE FAST 24 HOURS....",
        "My friend bought me food.",
        "I bought season passes for my family to the area amusement /water park.",
        "What made me happy was getting a nice gift from my boss.",
        "I got my nephew a birthday present he never expected and he was absolutely gleeful.",
        "I bought a fancy camera in anticipation of an upcoming trip to Japan.",
        "I was incredibly worried about coming up with the cost for a very formal dress for an upcoming family member's wedding, and my mother-in-law offered to purchase it for me.",
        "THE GIFT PRESENTED BY MY HUSBAND MADE ME VERY HAPPY.NO MATTER HOW DOES THE GIFT WORTH,ITS ALL BECAUSE THE GIFT IS FULL OF HIS LOVE.",
        "I purchased new furniture for my bedroom.",
        "I bought a car 2 months ago,that was the first vehicle i bought,I felt very happy and proud.",
        "My parents surprised me with an electric lawnmower, which makes maintaining my yard much easier.",
        "I received some fun new outfits in the mail.",
        "I found few good discounted deals on branded clothesline, and on actually buying new clothes made me really happy.",
        "It made me happy to give lots of chocolates to my boyfriend on his birthday.",
        "I love this crumb cake a very specific one that my grocery store never stocks, but last week they had it . I was so happy to be able to purchase it and eat it all."
      ],
      "description2taxonomy": {}
    },
    "focuses on personal achievements; specifically, the text describes a happy moment related to individual accomplishments, such as academic or professional success. For example, 'receiving a job promotion at work made me extremely happy.'": {
      "node_name": "root_id=9_node=8810661862334599154",
      "description": "focuses on personal achievements; specifically, the text describes a happy moment related to individual accomplishments, such as academic or professional success. For example, 'receiving a job promotion at work made me extremely happy.'",
      "texts": [
        "I can remember the graduation day I got the degree certificate, the smile on my parent`s face made the 3 years of hell worth it.",
        "I finished my college semester with a 4.0.",
        "Prior to this, I worked in art for years. My pieces might sell, but I rarely won anything, particularly in a mixed show. That started to change in the summer of 2016. Though these were not big awards, i suddenly started to get honorable mentions, merit awards, and even a few 3rd places. I was floored. This streak of winning went until January -- nearly 6 months. It is the first time in my LIFE that this has ever happened.",
        "I had got a promotion in work as a manger yesterday because of the success we have received in last two projects.",
        "Another event that made me happy was the end of a shift at the clinic where the provider gave me feedback and let me know that I was doing very well.",
        "I passed my math test which was the deciding factor if I passed the class or not.",
        "I received flowers at my office for a celebration of Admin Professionals Day. All the ladies in the office did, but my card had an individual note from the partners thanking me for being \"the glue that holds things together\". It made me feel really good and was a total surprise.",
        "In office i got selected to drive a six sigma quality project. During the kick off meeting the project owner introduced me in front of the whole team about my plus points and all people started appreciating about my knowledge.",
        "The woman I'm dog sitting for paid me twice as much as I was expecting!",
        "Yesterday afternoon got the results of the state test and my son got a 100 percent, such a proud happy moment.",
        "I have been getting bonuses from my job which is i'm getting regularly, it is one of the happy moments",
        "I was happy when my great-grandmother sent me a short text saying \"I'm so proud of your accomplishment. Thanks for being you.\"",
        "A week ago they gave me the registration of my first company.",
        "Feeling like I made a difference at work.",
        "i got a raise from my job. i was surprised because i was not expecting it.",
        "I reached a desirable ranking on the game I play.",
        "Finishing a project at work and getting praise for it.",
        "I had a client express deep gratitude for the work I've done for her - she said I had changed her life.",
        "What made me happy was when I finally paid off my apple watch with the money from Mturk. I was very happy.",
        "I got a raise at my job.",
        "I became happy when I finished my thesis paper for Law School.",
        "I got a promotion at my job. I got a significant pay raise as well as managerial benefits.",
        "I finally received my masters through this site",
        "I got a phone call from one of my grandsons telling me that he was chosen to interview for a prestigious internship at Harvard University. I am still smiling",
        "I reached my weekly fitness goal in running.",
        "I am sticking to my daily workout goals. That's an achievement which makes me happy and satisfied.",
        "I scored well in my Astronomy test.",
        "Winning the chess completion.",
        "Won a very large tournament in one of my new hobbies.",
        "I found out a few days ago that my daughter earned a 4.0 GPA this semester!",
        "I have not cheated one time on my diet since starting it, which is a huge accomplishment and makes me happy.",
        "Just yesterday after I showed my artwork to a professor, he said that it is \"wonderful, great idea\".",
        "Last semester I took seven classes and passed all of them with straight A's.",
        "My niece won a scholarship to college."
      ],
      "description2taxonomy": {
        "involves educational accomplishments; specifically, the text describes a happy moment resulting from academic success, high test scores, or completing a degree. For example, 'I passed my math test which was the deciding factor if I passed the class or not.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=-8183409442136115455",
          "description": "involves educational accomplishments; specifically, the text describes a happy moment resulting from academic success, high test scores, or completing a degree. For example, 'I passed my math test which was the deciding factor if I passed the class or not.'",
          "texts": [
            "I can remember the graduation day I got the degree certificate, the smile on my parent`s face made the 3 years of hell worth it.",
            "I finished my college semester with a 4.0.",
            "I passed my math test which was the deciding factor if I passed the class or not.",
            "Yesterday afternoon got the results of the state test and my son got a 100 percent, such a proud happy moment.",
            "I became happy when I finished my thesis paper for Law School.",
            "I finally received my masters through this site",
            "I got a phone call from one of my grandsons telling me that he was chosen to interview for a prestigious internship at Harvard University. I am still smiling",
            "I scored well in my Astronomy test.",
            "I found out a few days ago that my daughter earned a 4.0 GPA this semester!",
            "Last semester I took seven classes and passed all of them with straight A's.",
            "My niece won a scholarship to college."
          ],
          "description2taxonomy": {}
        },
        "relates to career milestones; specifically, the text mentions a promotion, raise, or positive feedback at work as a source of happiness. For example, 'I got a raise at my job.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=2923787206741312330",
          "description": "relates to career milestones; specifically, the text mentions a promotion, raise, or positive feedback at work as a source of happiness. For example, 'I got a raise at my job.'",
          "texts": [
            "Prior to this, I worked in art for years. My pieces might sell, but I rarely won anything, particularly in a mixed show. That started to change in the summer of 2016. Though these were not big awards, i suddenly started to get honorable mentions, merit awards, and even a few 3rd places. I was floored. This streak of winning went until January -- nearly 6 months. It is the first time in my LIFE that this has ever happened.",
            "I had got a promotion in work as a manger yesterday because of the success we have received in last two projects.",
            "Another event that made me happy was the end of a shift at the clinic where the provider gave me feedback and let me know that I was doing very well.",
            "In office i got selected to drive a six sigma quality project. During the kick off meeting the project owner introduced me in front of the whole team about my plus points and all people started appreciating about my knowledge.",
            "The woman I'm dog sitting for paid me twice as much as I was expecting!",
            "I have been getting bonuses from my job which is i'm getting regularly, it is one of the happy moments",
            "i got a raise from my job. i was surprised because i was not expecting it.",
            "Finishing a project at work and getting praise for it.",
            "I had a client express deep gratitude for the work I've done for her - she said I had changed her life.",
            "I got a raise at my job.",
            "I got a promotion at my job. I got a significant pay raise as well as managerial benefits."
          ],
          "description2taxonomy": {}
        },
        "relates to overcoming personal challenges; specifically, the text shares a happy moment where the speaker faced and defeated a personal struggle, such as sticking to a dietary plan. For example, 'I have not cheated one time on my diet since starting it.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=3638015725450557648",
          "description": "relates to overcoming personal challenges; specifically, the text shares a happy moment where the speaker faced and defeated a personal struggle, such as sticking to a dietary plan. For example, 'I have not cheated one time on my diet since starting it.'",
          "texts": [
            "I am sticking to my daily workout goals. That's an achievement which makes me happy and satisfied.",
            "I have not cheated one time on my diet since starting it, which is a huge accomplishment and makes me happy."
          ],
          "description2taxonomy": {}
        },
        "focuses on hobbies and interests; specifically, the text discusses a happy moment resulting from success in a personal interest, game, or competition. For example, 'I reached a desirable ranking in the game I play.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=-8954859275299140880",
          "description": "focuses on hobbies and interests; specifically, the text discusses a happy moment resulting from success in a personal interest, game, or competition. For example, 'I reached a desirable ranking in the game I play.'",
          "texts": [
            "Prior to this, I worked in art for years. My pieces might sell, but I rarely won anything, particularly in a mixed show. That started to change in the summer of 2016. Though these were not big awards, i suddenly started to get honorable mentions, merit awards, and even a few 3rd places. I was floored. This streak of winning went until January -- nearly 6 months. It is the first time in my LIFE that this has ever happened.",
            "I reached a desirable ranking on the game I play.",
            "I reached my weekly fitness goal in running.",
            "Winning the chess completion.",
            "Won a very large tournament in one of my new hobbies."
          ],
          "description2taxonomy": {}
        },
        "spotlights community or social impact; specifically, the text emphasizes happiness achieved through making a positive contribution to one's community or social group. For example, 'I organized a successful charity event that raised funds for the local hospital.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=-6846586914010265469",
          "description": "spotlights community or social impact; specifically, the text emphasizes happiness achieved through making a positive contribution to one's community or social group. For example, 'I organized a successful charity event that raised funds for the local hospital.'",
          "texts": [],
          "description2taxonomy": {}
        },
        "describes financial milestones; specifically, the text highlights a happy moment when the speaker attained a financial goal, such as saving money or paying off debt. For example, 'I finally paid off my student loans after years of saving.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=5557648616846370980",
          "description": "describes financial milestones; specifically, the text highlights a happy moment when the speaker attained a financial goal, such as saving money or paying off debt. For example, 'I finally paid off my student loans after years of saving.'",
          "texts": [
            "What made me happy was when I finally paid off my apple watch with the money from Mturk. I was very happy."
          ],
          "description2taxonomy": {}
        },
        "highlights entrepreneurial success; specifically, the text describes a happy moment sprung from starting or successfully running a business. For example, 'My small business has now expanded to three locations.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=1607990982721400057",
          "description": "highlights entrepreneurial success; specifically, the text describes a happy moment sprung from starting or successfully running a business. For example, 'My small business has now expanded to three locations.'",
          "texts": [
            "A week ago they gave me the registration of my first company."
          ],
          "description2taxonomy": {}
        },
        "features achievements with mentors or teachers; specifically, the text shares a happy moment that is connected to the guidance or acknowledgement of a mentor or teacher. For example, 'My professor praised my research paper and it made my day.'": {
          "node_name": "root_id=9_node=8810661862334599154_node=-1514669919130414810",
          "description": "features achievements with mentors or teachers; specifically, the text shares a happy moment that is connected to the guidance or acknowledgement of a mentor or teacher. For example, 'My professor praised my research paper and it made my day.'",
          "texts": [
            "Another event that made me happy was the end of a shift at the clinic where the provider gave me feedback and let me know that I was doing very well.",
            "I was happy when my great-grandmother sent me a short text saying \"I'm so proud of your accomplishment. Thanks for being you.\"",
            "Just yesterday after I showed my artwork to a professor, he said that it is \"wonderful, great idea\"."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "spent time with coworkers; specifically, the text discusses an event or situation involving colleagues from work. For example, 'We successfully finished our project and celebrated together after work.'": {
      "node_name": "root_id=9_node=-2729802653903317221",
      "description": "spent time with coworkers; specifically, the text discusses an event or situation involving colleagues from work. For example, 'We successfully finished our project and celebrated together after work.'",
      "texts": [
        "Today I was able to give out coats to my co-workers for an upcoming event.",
        "I had lunch with some friends at work and we had a engaging conversation about our plans for the weekend",
        "On 17th March 2017 by celebrating this happy occasion I gave a lunch party to the staff of the hospital. After finishing the lunch all the staff gave their blessings to our new born child. The chief doctor put his hand on the head of our child and blessed deeply. I would not forget this happy occasion in my life.",
        "In office i got selected to drive a six sigma quality project. During the kick off meeting the project owner introduced me in front of the whole team about my plus points and all people started appreciating about my knowledge.",
        "My business partners and I made solid progress on a deal we have been working hard to move forward. Today, we took a very major step in closing the deal.",
        "Hanging out a couple of coworkers on Thursday."
      ],
      "description2taxonomy": {}
    },
    "includes romantic partners; specifically, the text discusses a moment or activity shared with a spouse, boyfriend, girlfriend, or significant other. For example, 'I proposed to my girlfriend, and she accepted.'": {
      "node_name": "root_id=9_node=-4896617668763039356",
      "description": "includes romantic partners; specifically, the text discusses a moment or activity shared with a spouse, boyfriend, girlfriend, or significant other. For example, 'I proposed to my girlfriend, and she accepted.'",
      "texts": [
        "i have headache but my wife is smiling about it.",
        "My wife had been sick for a few days, then I found out it was because we were having a baby.",
        "My boyfriend telling me I would be flying business class to Europe.",
        "My wife and I went out on a date last month that was perfect. We were able to get away and spend some time to ourselves.",
        "I left my purse at home and my boyfriend came and brought it to me at work.",
        "I went with my fiancA(c)s parents to show them our wedding venue and to start planning the layout and details. We spent all morning together starting to think about ideas and then went out for brunch together. I was so happy thinking about the wedding and also just being able to spend time with them. They truly are my parents too.",
        "My boyfriend made the best burgers on the grill last night, they were delicious!",
        "I had a delicious dinner with my girlfriend last night.",
        "I was happy when my partner rubbed my sore back for me.",
        "I got to spend several days in a row with my girlfriend where we did not have to do anything but enjoy each others company and do whatever we wanted to do such as catching up on our rest and loving each other.",
        "This morning my husband let me sleep in, and made french toast for breakfast.",
        "My girlfriend told me that she had gotten the job she had applied for.",
        "last 3 days ago i can propose love to my girl friend. she was accepted my LOve Purpose.",
        "Seeing my wife happy and content after watching her brother and sister in law go through a difficult surgery.",
        "My wife told me she loves me.",
        "I had a good talk with my wife.",
        "My girlfriend got drunk and was extremely mean to me. She said some things that she shouldn't have due to the alcohol. When I came home from work the next day, she had a hand written card and dinner waiting to apologize. It made me feel as though she truly cared about me, and I was grateful to have her.",
        "My husband made a good profit in business today. I am very happy because of that.",
        "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
        "This morning, I woke up to a nice breakfast from my significant other. I always appreciate them taking the time to care for me when I am sick.",
        "I found out that my husband gets monday off and doesnt have to work overtime this weekend so thats great news!",
        "a special night with my wife after long trip",
        "THE GIFT PRESENTED BY MY HUSBAND MADE ME VERY HAPPY.NO MATTER HOW DOES THE GIFT WORTH,ITS ALL BECAUSE THE GIFT IS FULL OF HIS LOVE.",
        "My husband was paid early today so we are able to pay rent.",
        "I started my wedding planning!",
        "It was the best day in my life.. I Married my spouse.. it was my dream come true.. Very happy to have such a wonderful girl in my life... she always give positivity.. it was happiest moment in life..",
        "I was happy when my boyfriend agreed to go on a road trip through the southwest and said to start planning the details.",
        "The day when my girlfriend moved in with me.",
        "One month ago my wife and I went fishing on the bighorn river.",
        "When I saw the ultrasound of our baby move around. It made me realize how precious life can be and its the little moments that make it all worth it.",
        "Normally we have sex whenever we get time. After we came from the engagement ceremony I could not resist to look at my wife who was looking very sexy. I took her in my hands. She also did not resist. and finally we had a very satisfying sex.",
        "i am very happy because i marry with my lover , she is very beautiful and i love so much, i am really love her and now i marry her , i am very lucky so i am very happy",
        "I have been married a month now as of two days ago, it was definitely one of the happiest days I've had in the past few months.",
        "I spontaneously took a trip to visit a guy that I've been seeing two weeks ago.",
        "I celebrated my wedding anniversary.",
        "I have started dating someone and we recently took our first road trip together. He would reach over and grab my hand from time to time and it was really nice.",
        "I went movie with my lover very first time after my engagement made very happy.",
        "I was very happy to see my husband after he was away working for the last two and a half months.",
        "My wife made a cake after a long long time, which was very very yummy.",
        "my wife fell asleep early last night so i got to watch 3 episodes of my show",
        "My husband took us out for dinner.",
        "last night i do sex with my lover",
        "I hugged my fiance.",
        "I had a romantic date with my partner and we had a great night.",
        "It made me happy to give lots of chocolates to my boyfriend on his birthday."
      ],
      "description2taxonomy": {
        "involves financial achievements or support; specifically, the text discusses positive financial events or decisions with a romantic partner, such as business profits or paying bills. For example, 'my wife and I paid off our mortgage after years of hard work.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=-7009499329664161229",
          "description": "involves financial achievements or support; specifically, the text discusses positive financial events or decisions with a romantic partner, such as business profits or paying bills. For example, 'my wife and I paid off our mortgage after years of hard work.'",
          "texts": [
            "My husband made a good profit in business today. I am very happy because of that.",
            "My husband was paid early today so we are able to pay rent."
          ],
          "description2taxonomy": {}
        },
        "refers to shared hobbies or activities; specifically, the text describes romantic partners participating in common interests, such as traveling, sports, or entertainment. For example, 'my girlfriend and I took our first dance class together and had a blast.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=-2807773501435385021",
          "description": "refers to shared hobbies or activities; specifically, the text describes romantic partners participating in common interests, such as traveling, sports, or entertainment. For example, 'my girlfriend and I took our first dance class together and had a blast.'",
          "texts": [
            "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
            "I was happy when my boyfriend agreed to go on a road trip through the southwest and said to start planning the details.",
            "One month ago my wife and I went fishing on the bighorn river.",
            "I have started dating someone and we recently took our first road trip together. He would reach over and grab my hand from time to time and it was really nice."
          ],
          "description2taxonomy": {}
        },
        "involves celebrating milestones or achievements; specifically, the text focuses on couples commemorating a special event or significant accomplishment, such as a proposal or engagement. For example, 'last 3 days ago I can propose love to my girlfriend. She accepted my love proposal.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=142159863535206545",
          "description": "involves celebrating milestones or achievements; specifically, the text focuses on couples commemorating a special event or significant accomplishment, such as a proposal or engagement. For example, 'last 3 days ago I can propose love to my girlfriend. She accepted my love proposal.'",
          "texts": [
            "I went with my fiancA(c)s parents to show them our wedding venue and to start planning the layout and details. We spent all morning together starting to think about ideas and then went out for brunch together. I was so happy thinking about the wedding and also just being able to spend time with them. They truly are my parents too.",
            "My girlfriend told me that she had gotten the job she had applied for.",
            "last 3 days ago i can propose love to my girl friend. she was accepted my LOve Purpose.",
            "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
            "a special night with my wife after long trip",
            "I started my wedding planning!",
            "It was the best day in my life.. I Married my spouse.. it was my dream come true.. Very happy to have such a wonderful girl in my life... she always give positivity.. it was happiest moment in life..",
            "The day when my girlfriend moved in with me.",
            "i am very happy because i marry with my lover , she is very beautiful and i love so much, i am really love her and now i marry her , i am very lucky so i am very happy",
            "I have been married a month now as of two days ago, it was definitely one of the happiest days I've had in the past few months.",
            "I celebrated my wedding anniversary.",
            "I went movie with my lover very first time after my engagement made very happy.",
            "I hugged my fiance."
          ],
          "description2taxonomy": {}
        },
        "involves unexpected or spontaneous events; specifically, the text conveys a happy moment resulting from unplanned, surprising actions or circumstances. For example, 'I spontaneously took a trip to visit a guy that I've been seeing two weeks ago.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=4478892611757093400",
          "description": "involves unexpected or spontaneous events; specifically, the text conveys a happy moment resulting from unplanned, surprising actions or circumstances. For example, 'I spontaneously took a trip to visit a guy that I've been seeing two weeks ago.'",
          "texts": [
            "My wife had been sick for a few days, then I found out it was because we were having a baby.",
            "My boyfriend telling me I would be flying business class to Europe.",
            "I left my purse at home and my boyfriend came and brought it to me at work.",
            "This morning my husband let me sleep in, and made french toast for breakfast.",
            "It was the best day in my life.. I Married my spouse.. it was my dream come true.. Very happy to have such a wonderful girl in my life... she always give positivity.. it was happiest moment in life..",
            "The day when my girlfriend moved in with me.",
            "When I saw the ultrasound of our baby move around. It made me realize how precious life can be and its the little moments that make it all worth it.",
            "I spontaneously took a trip to visit a guy that I've been seeing two weeks ago."
          ],
          "description2taxonomy": {}
        },
        "involves shared meals or treats; specifically, the text describes a happy moment in which a couple enjoys food or dessert together. For example, 'My wife made a cake after a long long time, which was very very yummy.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=-6188344464107387216",
          "description": "involves shared meals or treats; specifically, the text describes a happy moment in which a couple enjoys food or dessert together. For example, 'My wife made a cake after a long long time, which was very very yummy.'",
          "texts": [
            "My boyfriend made the best burgers on the grill last night, they were delicious!",
            "I had a delicious dinner with my girlfriend last night.",
            "This morning my husband let me sleep in, and made french toast for breakfast.",
            "This morning, I woke up to a nice breakfast from my significant other. I always appreciate them taking the time to care for me when I am sick.",
            "My wife made a cake after a long long time, which was very very yummy.",
            "My husband took us out for dinner.",
            "It made me happy to give lots of chocolates to my boyfriend on his birthday."
          ],
          "description2taxonomy": {}
        },
        "involves shared rest or relaxation; specifically, the text details a happy moment that occurs when a romantic partner is able to rest or take time off of work. For example, 'I found out that my husband gets Monday off and doesn't have to work overtime this weekend, so that's great news!'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=3087482144154244334",
          "description": "involves shared rest or relaxation; specifically, the text details a happy moment that occurs when a romantic partner is able to rest or take time off of work. For example, 'I found out that my husband gets Monday off and doesn't have to work overtime this weekend, so that's great news!'",
          "texts": [
            "My wife and I went out on a date last month that was perfect. We were able to get away and spend some time to ourselves.",
            "I was happy when my partner rubbed my sore back for me.",
            "I got to spend several days in a row with my girlfriend where we did not have to do anything but enjoy each others company and do whatever we wanted to do such as catching up on our rest and loving each other.",
            "This morning my husband let me sleep in, and made french toast for breakfast.",
            "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
            "I found out that my husband gets monday off and doesnt have to work overtime this weekend so thats great news!",
            "a special night with my wife after long trip",
            "I was very happy to see my husband after he was away working for the last two and a half months.",
            "my wife fell asleep early last night so i got to watch 3 episodes of my show"
          ],
          "description2taxonomy": {}
        },
        "involves intimate physical connection; specifically, the text describes a moment or activity characterized by sexual or physically affectionate experiences with a romantic partner. For example, 'We spent the evening cuddling and making love.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=796150956273895047",
          "description": "involves intimate physical connection; specifically, the text describes a moment or activity characterized by sexual or physically affectionate experiences with a romantic partner. For example, 'We spent the evening cuddling and making love.'",
          "texts": [
            "I got to spend several days in a row with my girlfriend where we did not have to do anything but enjoy each others company and do whatever we wanted to do such as catching up on our rest and loving each other.",
            "a special night with my wife after long trip",
            "Normally we have sex whenever we get time. After we came from the engagement ceremony I could not resist to look at my wife who was looking very sexy. I took her in my hands. She also did not resist. and finally we had a very satisfying sex.",
            "last night i do sex with my lover"
          ],
          "description2taxonomy": {}
        },
        "showcases expressions of love; specifically, the text conveys moments when romantic partners openly declare their love and affection for each other. For example, 'he looked deeply into my eyes and told me he loved me more than anything in the world.'": {
          "node_name": "root_id=9_node=-4896617668763039356_node=-8104394284883440463",
          "description": "showcases expressions of love; specifically, the text conveys moments when romantic partners openly declare their love and affection for each other. For example, 'he looked deeply into my eyes and told me he loved me more than anything in the world.'",
          "texts": [
            "My wife told me she loves me.",
            "THE GIFT PRESENTED BY MY HUSBAND MADE ME VERY HAPPY.NO MATTER HOW DOES THE GIFT WORTH,ITS ALL BECAUSE THE GIFT IS FULL OF HIS LOVE.",
            "i am very happy because i marry with my lover , she is very beautiful and i love so much, i am really love her and now i marry her , i am very lucky so i am very happy"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves family; specifically, the text describes an interaction or shared experience with a family member or members. For example, 'I spent the day with my siblings at the park.'": {
      "node_name": "root_id=9_node=6446530335824535720",
      "description": "involves family; specifically, the text describes an interaction or shared experience with a family member or members. For example, 'I spent the day with my siblings at the park.'",
      "texts": [
        "the wedding of my brother",
        "I can remember the graduation day I got the degree certificate, the smile on my parent`s face made the 3 years of hell worth it.",
        "I was happy seeing my daughter's dance performance in school.",
        "It was when we went to Florida for vacation.",
        "My wife had been sick for a few days, then I found out it was because we were having a baby.",
        "I took my three year old daughter to the dentist for the first time ever, and she was very well behaved.",
        "MY son made the varsity baseball team",
        "My brother asked me to go to Seattle along with my cousin so it would cheer me up while I was having a hard time coping with dropping out of university my fourth year.",
        "I went with my fiancA(c)s parents to show them our wedding venue and to start planning the layout and details. We spent all morning together starting to think about ideas and then went out for brunch together. I was so happy thinking about the wedding and also just being able to spend time with them. They truly are my parents too.",
        "I came up with a good idea for a gift for my sister who is graduating from college.",
        "My niece told me she loves me.",
        "I attended a musical concert in my city with family.",
        "I had a nice evening with my family and friends. We had a potluck and had good conversation.",
        "yesterday i went to shopping with my family to buy lot of toys for my son making more happy for me and my family...",
        "When I'm with my kids.",
        "This morning my husband let me sleep in, and made french toast for breakfast.",
        "My Dad's 89th b-day made me happy to see him and spend time with him.",
        "My son gave me a hug and told me he loves me.",
        "Yesterday I took my son and his sister to a new park where they had a lot of fun and met some new kids.",
        "I took my nephew out to the zoo and I had a great time watching him really enjoy himself.",
        "When my daughter kissed my pregnant stomach.",
        "when everyone in my family is getting along. that makes me happy",
        "I WENT TO SHOPPING WITH MY FAMILY BUYING LOT OF TOYS FOR MY SON IS MY HAPPIEST MOMENT IN THE FAST 24 HOURS....",
        "Seeing my wife happy and content after watching her brother and sister in law go through a difficult surgery.",
        "My son got a part in the school performance, which he had been hoping for!",
        "I bought season passes for my family to the area amusement /water park.",
        "My cousins came over to my house for the very first time ever since I got married.",
        "I talked to my mother.",
        "I had a good talk with my wife.",
        "an event that makes my sister happy last month was her wedding",
        "Had dinner with my Family, now that my dad is getting over being sick.",
        "My parents picked up my son for a day at the park.",
        "I Was Very Happy To see my Cousins at My Place for a summer Vacation.",
        "I got my nephew a birthday present he never expected and he was absolutely gleeful.",
        "Hearing that my sister-in-law passed all her exams.",
        "Yesterday afternoon got the results of the state test and my son got a 100 percent, such a proud happy moment.",
        "I ran into my ba Brittany who seemed much happier to see Big Dad than usual.",
        "I was happy when my great-grandmother sent me a short text saying \"I'm so proud of your accomplishment. Thanks for being you.\"",
        "I was incredibly worried about coming up with the cost for a very formal dress for an upcoming family member's wedding, and my mother-in-law offered to purchase it for me.",
        "My daughter cooked dinner",
        "My daughter who is only 5 years old had been playing around in the park. All of a sudden she stopped playing and ran to me to give me a hug and then again she ran away and started playing.",
        "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
        "Having my daughter surprise me with some flowers she picked from the yard.",
        "Yesterday, we went out to airport in order to receive my niece, who is returning back to mother country after her 3 months foreign trip.",
        "My dad came over this morning and it made me happy to see him.",
        "I saw a family member I haven't seen for a while.",
        "My grandma came to visit from Jersey.",
        "a special night with my wife after long trip",
        "My brother took me to his shop for a cup of coffee.",
        "I was able to go out to eat with my family.",
        "I got a phone call from one of my grandsons telling me that he was chosen to interview for a prestigious internship at Harvard University. I am still smiling",
        "I attended a crawfish boil with my family.",
        "MY BROTHER BIRTHDAY WE ARE GOING TO HOTEL THAT IS HAPPY MOMENT IN MY LIFE.",
        "I am on vacation next week, so I can spend the whole week hanging out with my family.",
        "My cousin took first place in a state-wide truck driving competition a few weeks ago.",
        "Go out to eat burgers with my family",
        "I was having lunch with my family. Since my childhood we have a pattern in our home, first everybody at our home has lunch while my mother serves and while we are on our last Roti she too joins with her plate.I was little extra hungry. She had just joined with her plate along with my sister. I asked her for Roti. She said \"Wait I am making one for you\" and she left her seat.I held her hand and said, \"Mumma! I am in some cooking mood. You have food, I will make a roti for me\". She said, \"Why will you work in kitchen while I am here?\"I said, \"I want to make a roti\" and I left my seat. Sister popped up saying, \"Have this roti from mummy's plate, complete your lunch and then make a roti for mumma.\"I said, \"Well! You are falling for a dangerous act.Hahahahah.\" I completed my lunch and started with roti, This was it! Previously I have cooked many times, but only for me. This was the first time I cooked for mother.I made a roti and served it to mother. She made 3 parts of it, one for my sister, one for my father and one for herself. They all had their parts and I was observing them with suspense about comments.Sister chuckled, Your wife is lucky, you can feed her deliciously. Father giggled, Your Gf must have said you to learn cooking this morning.Mother was little emotional, she said, My son has grown up. Roti is",
        "I was really happy when my family surprised me by making dinner and it was delicious.",
        "It made me happy to see my dad sitting outside on the patio at the hospital last week after his being in the ICU since the end of February.",
        "My sister brought me a cupcake",
        "Going to the new Power Rangers movie with my father made me happy.",
        "I was very happy to see my husband after he was away working for the last two and a half months.",
        "My cousin and her boyfriend came to visit me.",
        "A few days ago I was happy to watch my child and his little league team win the tournament.",
        "I bought pizza and my family was happy.",
        "I don't get to spend as much time with my sister now that I have my son, so I am happy that my sister invited me out for dinner tonight.",
        "My husband took us out for dinner.",
        "I found out a few days ago that my daughter earned a 4.0 GPA this semester!",
        "I took my grandson Joe who is 2 1/2 swimming and he was so cute and fun.",
        "My son had a good day today. When I came home from work I was pleased to see that he had cleaned his room and taken a shower like I had asked. He even sat down with me and told me about his field trip today. I felt very close to him.",
        "One moment in the last three months that made me happy was the first time my daughter ever called me \"Daddy.",
        "I spent two hours on the phone with my sister yesterday- she is the only family remember who lives in another state.",
        "My brother had another baby with his wife, so now I have 2 nieces!",
        "My daughter made me a mother's day magnet at school",
        "I took my daughter to Corning Glass Museum for the day.",
        "Tonight I walked in the house after work and my daughter came running up to me, excited because she peed in the \"big girl potty\" when she got home.",
        "The moment my daughter went and sat on the potty all by herself made me happier than ever.",
        "I went to pick up my god kids (who I don't get to see a lot) from school. I was waiting at the entrance that my god daughter exists out of and when she saw me she ran to hug me.",
        "My daughter hugged me and told me how much she oved me in front of her friends.",
        "My daughter looking and me and smiling left me happy.",
        "My niece won a scholarship to college."
      ],
      "description2taxonomy": {
        "involves outdoor activities with family; specifically, the text describes time spent with family members participating in outdoor activities, such as picnics or sports. For example, 'We went on a family hike and enjoyed the beautiful scenery together.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=8846641492482421816",
          "description": "involves outdoor activities with family; specifically, the text describes time spent with family members participating in outdoor activities, such as picnics or sports. For example, 'We went on a family hike and enjoyed the beautiful scenery together.'",
          "texts": [
            "I attended a crawfish boil with my family."
          ],
          "description2taxonomy": {}
        },
        "involves parents; specifically, the text describes a happy moment shared with one or both of the person's parents. For example, 'I talked to my mother.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=521395199183158403",
          "description": "involves parents; specifically, the text describes a happy moment shared with one or both of the person's parents. For example, 'I talked to my mother.'",
          "texts": [
            "I can remember the graduation day I got the degree certificate, the smile on my parent`s face made the 3 years of hell worth it.",
            "I went with my fiancA(c)s parents to show them our wedding venue and to start planning the layout and details. We spent all morning together starting to think about ideas and then went out for brunch together. I was so happy thinking about the wedding and also just being able to spend time with them. They truly are my parents too.",
            "My Dad's 89th b-day made me happy to see him and spend time with him.",
            "My son gave me a hug and told me he loves me.",
            "When my daughter kissed my pregnant stomach.",
            "I talked to my mother.",
            "Had dinner with my Family, now that my dad is getting over being sick.",
            "My parents picked up my son for a day at the park.",
            "Yesterday afternoon got the results of the state test and my son got a 100 percent, such a proud happy moment.",
            "I was incredibly worried about coming up with the cost for a very formal dress for an upcoming family member's wedding, and my mother-in-law offered to purchase it for me.",
            "My dad came over this morning and it made me happy to see him.",
            "I was able to go out to eat with my family.",
            "I was having lunch with my family. Since my childhood we have a pattern in our home, first everybody at our home has lunch while my mother serves and while we are on our last Roti she too joins with her plate.I was little extra hungry. She had just joined with her plate along with my sister. I asked her for Roti. She said \"Wait I am making one for you\" and she left her seat.I held her hand and said, \"Mumma! I am in some cooking mood. You have food, I will make a roti for me\". She said, \"Why will you work in kitchen while I am here?\"I said, \"I want to make a roti\" and I left my seat. Sister popped up saying, \"Have this roti from mummy's plate, complete your lunch and then make a roti for mumma.\"I said, \"Well! You are falling for a dangerous act.Hahahahah.\" I completed my lunch and started with roti, This was it! Previously I have cooked many times, but only for me. This was the first time I cooked for mother.I made a roti and served it to mother. She made 3 parts of it, one for my sister, one for my father and one for herself. They all had their parts and I was observing them with suspense about comments.Sister chuckled, Your wife is lucky, you can feed her deliciously. Father giggled, Your Gf must have said you to learn cooking this morning.Mother was little emotional, she said, My son has grown up. Roti is",
            "It made me happy to see my dad sitting outside on the patio at the hospital last week after his being in the ICU since the end of February.",
            "Going to the new Power Rangers movie with my father made me happy.",
            "My daughter made me a mother's day magnet at school",
            "The moment my daughter went and sat on the potty all by herself made me happier than ever.",
            "My daughter hugged me and told me how much she oved me in front of her friends."
          ],
          "description2taxonomy": {}
        },
        "involves siblings; specifically, the text describes a happy moment shared with the individual's brother or sister. For example, 'My brother took me to his shop for a cup of coffee.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=7840790757584325294",
          "description": "involves siblings; specifically, the text describes a happy moment shared with the individual's brother or sister. For example, 'My brother took me to his shop for a cup of coffee.'",
          "texts": [
            "the wedding of my brother",
            "My brother asked me to go to Seattle along with my cousin so it would cheer me up while I was having a hard time coping with dropping out of university my fourth year.",
            "I came up with a good idea for a gift for my sister who is graduating from college.",
            "an event that makes my sister happy last month was her wedding",
            "My brother took me to his shop for a cup of coffee.",
            "MY BROTHER BIRTHDAY WE ARE GOING TO HOTEL THAT IS HAPPY MOMENT IN MY LIFE.",
            "I was having lunch with my family. Since my childhood we have a pattern in our home, first everybody at our home has lunch while my mother serves and while we are on our last Roti she too joins with her plate.I was little extra hungry. She had just joined with her plate along with my sister. I asked her for Roti. She said \"Wait I am making one for you\" and she left her seat.I held her hand and said, \"Mumma! I am in some cooking mood. You have food, I will make a roti for me\". She said, \"Why will you work in kitchen while I am here?\"I said, \"I want to make a roti\" and I left my seat. Sister popped up saying, \"Have this roti from mummy's plate, complete your lunch and then make a roti for mumma.\"I said, \"Well! You are falling for a dangerous act.Hahahahah.\" I completed my lunch and started with roti, This was it! Previously I have cooked many times, but only for me. This was the first time I cooked for mother.I made a roti and served it to mother. She made 3 parts of it, one for my sister, one for my father and one for herself. They all had their parts and I was observing them with suspense about comments.Sister chuckled, Your wife is lucky, you can feed her deliciously. Father giggled, Your Gf must have said you to learn cooking this morning.Mother was little emotional, she said, My son has grown up. Roti is",
            "My sister brought me a cupcake",
            "I don't get to spend as much time with my sister now that I have my son, so I am happy that my sister invited me out for dinner tonight.",
            "I spent two hours on the phone with my sister yesterday- she is the only family remember who lives in another state.",
            "My brother had another baby with his wife, so now I have 2 nieces!"
          ],
          "description2taxonomy": {}
        },
        "involves extended family; specifically, the text describes a happy moment shared with relatives beyond the immediate family, such as aunts, uncles, cousins, or in-laws. For example, 'I saw a family member I haven't seen for a while.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=2095010178793865669",
          "description": "involves extended family; specifically, the text describes a happy moment shared with relatives beyond the immediate family, such as aunts, uncles, cousins, or in-laws. For example, 'I saw a family member I haven't seen for a while.'",
          "texts": [
            "the wedding of my brother",
            "My brother asked me to go to Seattle along with my cousin so it would cheer me up while I was having a hard time coping with dropping out of university my fourth year.",
            "My niece told me she loves me.",
            "I took my nephew out to the zoo and I had a great time watching him really enjoy himself.",
            "Seeing my wife happy and content after watching her brother and sister in law go through a difficult surgery.",
            "My cousins came over to my house for the very first time ever since I got married.",
            "I Was Very Happy To see my Cousins at My Place for a summer Vacation.",
            "I got my nephew a birthday present he never expected and he was absolutely gleeful.",
            "Hearing that my sister-in-law passed all her exams.",
            "I was happy when my great-grandmother sent me a short text saying \"I'm so proud of your accomplishment. Thanks for being you.\"",
            "I was incredibly worried about coming up with the cost for a very formal dress for an upcoming family member's wedding, and my mother-in-law offered to purchase it for me.",
            "Yesterday, we went out to airport in order to receive my niece, who is returning back to mother country after her 3 months foreign trip.",
            "I saw a family member I haven't seen for a while.",
            "My grandma came to visit from Jersey.",
            "My cousin took first place in a state-wide truck driving competition a few weeks ago.",
            "My cousin and her boyfriend came to visit me.",
            "My brother had another baby with his wife, so now I have 2 nieces!",
            "I went to pick up my god kids (who I don't get to see a lot) from school. I was waiting at the entrance that my god daughter exists out of and when she saw me she ran to hug me.",
            "My niece won a scholarship to college."
          ],
          "description2taxonomy": {}
        },
        "involves spouse or partner; specifically, the text describes a happy moment shared with a spouse or romantic partner. For example, 'My husband took us out for dinner.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=-6120793818994871609",
          "description": "involves spouse or partner; specifically, the text describes a happy moment shared with a spouse or romantic partner. For example, 'My husband took us out for dinner.'",
          "texts": [
            "My wife had been sick for a few days, then I found out it was because we were having a baby.",
            "I went with my fiancA(c)s parents to show them our wedding venue and to start planning the layout and details. We spent all morning together starting to think about ideas and then went out for brunch together. I was so happy thinking about the wedding and also just being able to spend time with them. They truly are my parents too.",
            "This morning my husband let me sleep in, and made french toast for breakfast.",
            "Seeing my wife happy and content after watching her brother and sister in law go through a difficult surgery.",
            "I had a good talk with my wife.",
            "My husband and I drank champagne, listened to some of our favorite old songs from when we were dating and looked through our wedding album together. We even danced! Had a really lovely time :)",
            "a special night with my wife after long trip",
            "I was very happy to see my husband after he was away working for the last two and a half months.",
            "My husband took us out for dinner."
          ],
          "description2taxonomy": {}
        },
        "involves entire family; specifically, the text describes a happy moment shared with multiple family members across generations. For example, 'I went shopping with my family buying lots of toys for my son.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=3322544338052307158",
          "description": "involves entire family; specifically, the text describes a happy moment shared with multiple family members across generations. For example, 'I went shopping with my family buying lots of toys for my son.'",
          "texts": [
            "yesterday i went to shopping with my family to buy lot of toys for my son making more happy for me and my family...",
            "when everyone in my family is getting along. that makes me happy",
            "I WENT TO SHOPPING WITH MY FAMILY BUYING LOT OF TOYS FOR MY SON IS MY HAPPIEST MOMENT IN THE FAST 24 HOURS....",
            "I bought season passes for my family to the area amusement /water park.",
            "I was having lunch with my family. Since my childhood we have a pattern in our home, first everybody at our home has lunch while my mother serves and while we are on our last Roti she too joins with her plate.I was little extra hungry. She had just joined with her plate along with my sister. I asked her for Roti. She said \"Wait I am making one for you\" and she left her seat.I held her hand and said, \"Mumma! I am in some cooking mood. You have food, I will make a roti for me\". She said, \"Why will you work in kitchen while I am here?\"I said, \"I want to make a roti\" and I left my seat. Sister popped up saying, \"Have this roti from mummy's plate, complete your lunch and then make a roti for mumma.\"I said, \"Well! You are falling for a dangerous act.Hahahahah.\" I completed my lunch and started with roti, This was it! Previously I have cooked many times, but only for me. This was the first time I cooked for mother.I made a roti and served it to mother. She made 3 parts of it, one for my sister, one for my father and one for herself. They all had their parts and I was observing them with suspense about comments.Sister chuckled, Your wife is lucky, you can feed her deliciously. Father giggled, Your Gf must have said you to learn cooking this morning.Mother was little emotional, she said, My son has grown up. Roti is",
            "I was really happy when my family surprised me by making dinner and it was delicious."
          ],
          "description2taxonomy": {}
        },
        "involves children; specifically, the text describes a happy moment involving the individual's own children or child. For example, 'My daughter looking and me and smiling left me happy.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=-5373904353966105997",
          "description": "involves children; specifically, the text describes a happy moment involving the individual's own children or child. For example, 'My daughter looking and me and smiling left me happy.'",
          "texts": [
            "I was happy seeing my daughter's dance performance in school.",
            "I took my three year old daughter to the dentist for the first time ever, and she was very well behaved.",
            "MY son made the varsity baseball team",
            "yesterday i went to shopping with my family to buy lot of toys for my son making more happy for me and my family...",
            "When I'm with my kids.",
            "My son gave me a hug and told me he loves me.",
            "Yesterday I took my son and his sister to a new park where they had a lot of fun and met some new kids.",
            "I took my nephew out to the zoo and I had a great time watching him really enjoy himself.",
            "When my daughter kissed my pregnant stomach.",
            "I WENT TO SHOPPING WITH MY FAMILY BUYING LOT OF TOYS FOR MY SON IS MY HAPPIEST MOMENT IN THE FAST 24 HOURS....",
            "My son got a part in the school performance, which he had been hoping for!",
            "I got my nephew a birthday present he never expected and he was absolutely gleeful.",
            "Yesterday afternoon got the results of the state test and my son got a 100 percent, such a proud happy moment.",
            "My daughter cooked dinner",
            "My daughter who is only 5 years old had been playing around in the park. All of a sudden she stopped playing and ran to me to give me a hug and then again she ran away and started playing.",
            "Having my daughter surprise me with some flowers she picked from the yard.",
            "I got a phone call from one of my grandsons telling me that he was chosen to interview for a prestigious internship at Harvard University. I am still smiling",
            "A few days ago I was happy to watch my child and his little league team win the tournament.",
            "I found out a few days ago that my daughter earned a 4.0 GPA this semester!",
            "I took my grandson Joe who is 2 1/2 swimming and he was so cute and fun.",
            "My son had a good day today. When I came home from work I was pleased to see that he had cleaned his room and taken a shower like I had asked. He even sat down with me and told me about his field trip today. I felt very close to him.",
            "One moment in the last three months that made me happy was the first time my daughter ever called me \"Daddy.",
            "My daughter made me a mother's day magnet at school",
            "I took my daughter to Corning Glass Museum for the day.",
            "Tonight I walked in the house after work and my daughter came running up to me, excited because she peed in the \"big girl potty\" when she got home.",
            "The moment my daughter went and sat on the potty all by herself made me happier than ever.",
            "My daughter hugged me and told me how much she oved me in front of her friends.",
            "My daughter looking and me and smiling left me happy."
          ],
          "description2taxonomy": {}
        },
        "mentions family trips or vacations; specifically, the text focuses on leisure time away from home spent with family members. For example, 'We traveled as a family and explored the beautiful sights of Italy together.'": {
          "node_name": "root_id=9_node=6446530335824535720_node=5015791590710159964",
          "description": "mentions family trips or vacations; specifically, the text focuses on leisure time away from home spent with family members. For example, 'We traveled as a family and explored the beautiful sights of Italy together.'",
          "texts": [
            "It was when we went to Florida for vacation.",
            "I Was Very Happy To see my Cousins at My Place for a summer Vacation.",
            "I am on vacation next week, so I can spend the whole week hanging out with my family."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves friends; specifically, the text describes an interaction or shared experience with a friend or group of friends. For example, 'I had a phone call with some old friends.'": {
      "node_name": "root_id=9_node=-2414013384559116102",
      "description": "involves friends; specifically, the text describes an interaction or shared experience with a friend or group of friends. For example, 'I had a phone call with some old friends.'",
      "texts": [
        "I made a new friend on the TV station tour.",
        "My friends had planned a surprise baby shower for me. I wasn't expecting one at all and really didn't want to plan one myself, but to my surprise they were planning behind my back. It made me really happy that they decided to do this for me.",
        "I went to a friend's house last night and we played video games for hours.",
        "My friends and me went for Go-karting.",
        "I had a nice evening with my family and friends. We had a potluck and had good conversation.",
        "I love play baseball in the Stadium with my Friends",
        "I met my friend for lunch.",
        "My birthday was yesterday and several friends gave me a party.",
        "I had lunch with some friends at work and we had a engaging conversation about our plans for the weekend",
        "I completed a very challenging 2000 piece puzzle the other day with the help of a few friends.",
        "My friend bought me food.",
        "I had nice lunch with my friends in Taj Hotel.",
        "I saw an old friend I hadn't seen since high school.",
        "MY BIRTHDAY CELEBRATED WITH MY FRIENDS AND RELATIVES AT BEACH . ITS VERY HAPPY",
        "Last night I spent a couple hours talking with a friend I had not spoken to in a while.",
        "Playing games with my friends.",
        "I was able to throw a party for a friend that was fun",
        "A friend agree to hit up happy hour after work the following day so we can catch up.",
        "I met a friend at a bar and had some drinks.",
        "I got a text from a friend whom I haven't heard from in a while.",
        "I went to San Francisco to see friends.",
        "I went out with my friends to the bars and got to talk to some people i havent seen an a while.",
        "I made plans to meet up with a friend tonight that I don't see very often.",
        "Me and my friend got a big fight and we didnt sleep till next day early morning. Evening when we met she hugged and slept on my shoulders while driving to home. I was happy and thought everything is pleasant again.",
        "My best friend graduated from college.",
        "I had a phone call with some old friends",
        "A three day trip to Phoenix for some spring training baseball with a friend.",
        "I talked to my best friend via text after not having any time to talk to any friends recently.",
        "A friend brought their newborn baby to visit .",
        "A woman friend of mine living in Vancouver suddenly stopped posting on Facebook. We were friends even offline. She had helped me in writing the romance novel I am doing. I wrote to her several times with no reply. I was worried and asked even her other friends on Facebook but no one knew what had happened to Lisa. I was resigned to the fact that maybe she was dead. I did not know her home address or phone. Suddenly I received an email the other day. She asked me not to get angry. She added she would write again later to explain everything.",
        "A friend invited me out for a drink last night and it made me happy that someone wanted to spend time with me.",
        "One of my best friends got admission into one of the best masters course of the world.",
        "I spent time with my friends playing dungeons and dragons for the first time in about 20 years.",
        "Having lunch with my two best friends on Saturday made me happy.",
        "I talked with my girl freind long time on phone and we had a lot of fun talking and laughing.",
        "I had a really enjoyable walk and pub visit with friends on one of the first sunny spring afternoons of the year.",
        "I met one of my old friend in a wedding ceremony and talk many matters.",
        "I got news from my friend that his parents said it's okay for me to stay over for a week",
        "3. I was able to spend some quality time with my friends.",
        "Last night I played a co-operative video game with 2 of my best friends for over 3 hours"
      ],
      "description2taxonomy": {
        "involves reuniting with old friends; specifically, the text describes reconnecting with a friend or group of friends after some time. for example, 'I met one of my old friends in a wedding ceremony and talked about many matters.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=6761312905431139139",
          "description": "involves reuniting with old friends; specifically, the text describes reconnecting with a friend or group of friends after some time. for example, 'I met one of my old friends in a wedding ceremony and talked about many matters.'",
          "texts": [
            "I saw an old friend I hadn't seen since high school.",
            "Last night I spent a couple hours talking with a friend I had not spoken to in a while.",
            "A friend agree to hit up happy hour after work the following day so we can catch up.",
            "I got a text from a friend whom I haven't heard from in a while.",
            "I went out with my friends to the bars and got to talk to some people i havent seen an a while.",
            "I made plans to meet up with a friend tonight that I don't see very often.",
            "I had a phone call with some old friends",
            "I talked to my best friend via text after not having any time to talk to any friends recently.",
            "A woman friend of mine living in Vancouver suddenly stopped posting on Facebook. We were friends even offline. She had helped me in writing the romance novel I am doing. I wrote to her several times with no reply. I was worried and asked even her other friends on Facebook but no one knew what had happened to Lisa. I was resigned to the fact that maybe she was dead. I did not know her home address or phone. Suddenly I received an email the other day. She asked me not to get angry. She added she would write again later to explain everything.",
            "I spent time with my friends playing dungeons and dragons for the first time in about 20 years.",
            "I met one of my old friend in a wedding ceremony and talk many matters.",
            "3. I was able to spend some quality time with my friends."
          ],
          "description2taxonomy": {}
        },
        "refers to a shared meal; specifically, the text describes having lunch or dinner with friends, often accompanied by conversation. For example, 'I had a nice lunch with my friends in Taj Hotel.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=-1705832757306461836",
          "description": "refers to a shared meal; specifically, the text describes having lunch or dinner with friends, often accompanied by conversation. For example, 'I had a nice lunch with my friends in Taj Hotel.'",
          "texts": [
            "I had a nice evening with my family and friends. We had a potluck and had good conversation.",
            "I met my friend for lunch.",
            "I had lunch with some friends at work and we had a engaging conversation about our plans for the weekend",
            "I had nice lunch with my friends in Taj Hotel.",
            "Having lunch with my two best friends on Saturday made me happy."
          ],
          "description2taxonomy": {}
        },
        "involves thoughtful gestures; specifically, the text recounts moments when friends demonstrate care or support through actions. For example, 'My friend bought me food.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=-6616450904782633208",
          "description": "involves thoughtful gestures; specifically, the text recounts moments when friends demonstrate care or support through actions. For example, 'My friend bought me food.'",
          "texts": [
            "My friends had planned a surprise baby shower for me. I wasn't expecting one at all and really didn't want to plan one myself, but to my surprise they were planning behind my back. It made me really happy that they decided to do this for me.",
            "My friend bought me food.",
            "Me and my friend got a big fight and we didnt sleep till next day early morning. Evening when we met she hugged and slept on my shoulders while driving to home. I was happy and thought everything is pleasant again.",
            "A friend invited me out for a drink last night and it made me happy that someone wanted to spend time with me."
          ],
          "description2taxonomy": {}
        },
        "celebrates friends' achievements; specifically, the text conveys happiness derived from a friend's personal or professional success. For example, 'One of my best friends got admission into one of the best masters courses in the world.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=2084073469021887565",
          "description": "celebrates friends' achievements; specifically, the text conveys happiness derived from a friend's personal or professional success. For example, 'One of my best friends got admission into one of the best masters courses in the world.'",
          "texts": [
            "My best friend graduated from college.",
            "One of my best friends got admission into one of the best masters course of the world."
          ],
          "description2taxonomy": {}
        },
        "includes family connections; specifically, the text mentions friends' family members or shared interactions involving their families. For example, 'A friend brought their newborn baby to visit.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=8532985142421011156",
          "description": "includes family connections; specifically, the text mentions friends' family members or shared interactions involving their families. For example, 'A friend brought their newborn baby to visit.'",
          "texts": [
            "A friend brought their newborn baby to visit .",
            "I got news from my friend that his parents said it's okay for me to stay over for a week"
          ],
          "description2taxonomy": {}
        },
        "involves attending a social gathering; specifically, the text describes being at a party, celebration, or similar event with friends. For example, 'I attended my friend's birthday party and had a blast.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=-7055555433214243037",
          "description": "involves attending a social gathering; specifically, the text describes being at a party, celebration, or similar event with friends. For example, 'I attended my friend's birthday party and had a blast.'",
          "texts": [
            "My friends had planned a surprise baby shower for me. I wasn't expecting one at all and really didn't want to plan one myself, but to my surprise they were planning behind my back. It made me really happy that they decided to do this for me.",
            "My birthday was yesterday and several friends gave me a party.",
            "MY BIRTHDAY CELEBRATED WITH MY FRIENDS AND RELATIVES AT BEACH . ITS VERY HAPPY",
            "I was able to throw a party for a friend that was fun"
          ],
          "description2taxonomy": {}
        },
        "mentions meeting new friends; specifically, the text describes making a new friend or forming a new connection with someone. For example, 'I made a new friend at the bookstore today.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=-7633584608045624602",
          "description": "mentions meeting new friends; specifically, the text describes making a new friend or forming a new connection with someone. For example, 'I made a new friend at the bookstore today.'",
          "texts": [
            "I made a new friend on the TV station tour."
          ],
          "description2taxonomy": {}
        },
        "includes shared activities or hobbies; specifically, the text describes engaging in a common interest or activity with friends. For example, 'My friends and I went hiking together and enjoyed a beautiful view.'": {
          "node_name": "root_id=9_node=-2414013384559116102_node=-3556786554347505933",
          "description": "includes shared activities or hobbies; specifically, the text describes engaging in a common interest or activity with friends. For example, 'My friends and I went hiking together and enjoyed a beautiful view.'",
          "texts": [
            "I went to a friend's house last night and we played video games for hours.",
            "My friends and me went for Go-karting.",
            "I love play baseball in the Stadium with my Friends",
            "I completed a very challenging 2000 piece puzzle the other day with the help of a few friends.",
            "Playing games with my friends.",
            "A three day trip to Phoenix for some spring training baseball with a friend.",
            "I spent time with my friends playing dungeons and dragons for the first time in about 20 years.",
            "I had a really enjoyable walk and pub visit with friends on one of the first sunny spring afternoons of the year.",
            "Last night I played a co-operative video game with 2 of my best friends for over 3 hours"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves pets or animals; specifically, the text discusses an interaction or moment with an animal or pet. For example, 'I started volunteering at the animal shelter again.'": {
      "node_name": "root_id=9_node=-870301438145998246",
      "description": "involves pets or animals; specifically, the text discusses an interaction or moment with an animal or pet. For example, 'I started volunteering at the animal shelter again.'",
      "texts": [
        "Having lunch on our deck with the dog yesterday. The weather was ideal. The morning had been a bit stressful and lunch with the dog was the break that I needed.",
        "I found a baby bunny hiding on the side our barn.",
        "My puppy was in a mood to play fight, so we proceeded to play fight for a few minutes.",
        "I started volunteering at the Atlanta Humane Society again.",
        "Our new cat tree arrived, and while assembling it, Carol watched a while, then suddenly jumped on it and went to town like old times.",
        "I took my nephew out to the zoo and I had a great time watching him really enjoy himself.",
        "Annie my cat started feeling better after she was sick.",
        "I spent time with my cat.",
        "My dog and my cat were playing together. I just got a puppy and my cat is 13 years old.",
        "The woman I'm dog sitting for paid me twice as much as I was expecting!",
        "Pet my cat",
        "I ran into my ba Brittany who seemed much happier to see Big Dad than usual.",
        "My cat slept on my lap.",
        "My rabbits were described as 'in excellent health and beautiful condition' at their vet check-up.",
        "My vet figured out my cat's disease and he has started recovering after getting the right medication.",
        "Yesterday I helped my class of special education students release the butterflies we have been watching grow from caterpillars!",
        "After checking Craig's List and the local want ads for a couple weeks, there are kittens available to adopt!",
        "I picked up a puppy about two months ago. It is a breed that is hard to find in New York state. Pembroke Welsh Corgis",
        "While eating breakfast, i felt a light jab from my border collie, she had gathered the paper dish the bird tossed from the top of his cage and brought it to me for her task treat!",
        "I was happy when I cuddled my cat.",
        "I got a package of free dog food samples in the mail.",
        "My dog gave me the sweetest kiss earlier today. It really made my day, I was already feeling under the weather.",
        "I hatched the duck eggs I've been incubating! They finally hatched and the babies are soft.",
        "I got to play with my new puppy husky named Kaede.",
        "I built a pond in my garden and Put 10 golden carp fishes in it. It was after many days of heavy digging and effort that I was able to finish it. I am happy to see the fishes thrive in the pond alogn with the natural pond vegetation.",
        "Returning home from vacation to my pet cat.",
        "I have an old pet that people wanted me to get rid of after I had a bad accident. They decided to leave me alone about my pet. So, I get to keep her."
      ],
      "description2taxonomy": {
        "involves animal care or assistance; specifically, the text mentions providing help, support, or aid to an animal, such as fostering or caretaking. For example, 'The woman I'm dog sitting for paid me twice as much as I was expecting!'": {
          "node_name": "root_id=9_node=-870301438145998246_node=-9090445108279458809",
          "description": "involves animal care or assistance; specifically, the text mentions providing help, support, or aid to an animal, such as fostering or caretaking. For example, 'The woman I'm dog sitting for paid me twice as much as I was expecting!'",
          "texts": [
            "I found a baby bunny hiding on the side our barn.",
            "I started volunteering at the Atlanta Humane Society again.",
            "The woman I'm dog sitting for paid me twice as much as I was expecting!",
            "Pet my cat",
            "My rabbits were described as 'in excellent health and beautiful condition' at their vet check-up.",
            "While eating breakfast, i felt a light jab from my border collie, she had gathered the paper dish the bird tossed from the top of his cage and brought it to me for her task treat!",
            "I have an old pet that people wanted me to get rid of after I had a bad accident. They decided to leave me alone about my pet. So, I get to keep her."
          ],
          "description2taxonomy": {}
        },
        "describes a pet's recovery or health improvement; specifically, the text talks about a pet feeling better, getting the right medication, or overcoming an illness. For example, 'Annie my cat started feeling better after she was sick.'": {
          "node_name": "root_id=9_node=-870301438145998246_node=-6774546435067207537",
          "description": "describes a pet's recovery or health improvement; specifically, the text talks about a pet feeling better, getting the right medication, or overcoming an illness. For example, 'Annie my cat started feeling better after she was sick.'",
          "texts": [
            "Annie my cat started feeling better after she was sick.",
            "My vet figured out my cat's disease and he has started recovering after getting the right medication."
          ],
          "description2taxonomy": {}
        },
        "involves spending quality time with pets; specifically, the text describes the shared moments, activities, or relaxation between the person and their pet. For example, 'My dog and my cat were playing together.'": {
          "node_name": "root_id=9_node=-870301438145998246_node=-5095493437371735153",
          "description": "involves spending quality time with pets; specifically, the text describes the shared moments, activities, or relaxation between the person and their pet. For example, 'My dog and my cat were playing together.'",
          "texts": [
            "Having lunch on our deck with the dog yesterday. The weather was ideal. The morning had been a bit stressful and lunch with the dog was the break that I needed.",
            "My puppy was in a mood to play fight, so we proceeded to play fight for a few minutes.",
            "I spent time with my cat.",
            "My dog and my cat were playing together. I just got a puppy and my cat is 13 years old.",
            "My cat slept on my lap.",
            "While eating breakfast, i felt a light jab from my border collie, she had gathered the paper dish the bird tossed from the top of his cage and brought it to me for her task treat!",
            "I was happy when I cuddled my cat.",
            "My dog gave me the sweetest kiss earlier today. It really made my day, I was already feeling under the weather.",
            "I got to play with my new puppy husky named Kaede."
          ],
          "description2taxonomy": {}
        },
        "relates to adopting or acquiring new pets; specifically, the text discusses the process or excitement of bringing a new animal into the household. For example, 'After checking Craig's List and the local want ads for a couple weeks, there are kittens available to adopt!'": {
          "node_name": "root_id=9_node=-870301438145998246_node=-836275368983229914",
          "description": "relates to adopting or acquiring new pets; specifically, the text discusses the process or excitement of bringing a new animal into the household. For example, 'After checking Craig's List and the local want ads for a couple weeks, there are kittens available to adopt!'",
          "texts": [
            "After checking Craig's List and the local want ads for a couple weeks, there are kittens available to adopt!",
            "I picked up a puppy about two months ago. It is a breed that is hard to find in New York state. Pembroke Welsh Corgis"
          ],
          "description2taxonomy": {}
        },
        "mentions attending an event with animals; specifically, the text discusses a group activity or public occasion involving animals, such as a visit to the zoo or an animal show. For example, 'My family and I had a great time at the dolphin show.'": {
          "node_name": "root_id=9_node=-870301438145998246_node=7313081891599332884",
          "description": "mentions attending an event with animals; specifically, the text discusses a group activity or public occasion involving animals, such as a visit to the zoo or an animal show. For example, 'My family and I had a great time at the dolphin show.'",
          "texts": [
            "I took my nephew out to the zoo and I had a great time watching him really enjoy himself.",
            "Yesterday I helped my class of special education students release the butterflies we have been watching grow from caterpillars!"
          ],
          "description2taxonomy": {}
        },
        "describes a moment of pet-related accomplishment; specifically, the text recounts a positive event or achievement involving a person's pet. For example, 'My dog finally learned how to do a trick I've been teaching him for weeks.'": {
          "node_name": "root_id=9_node=-870301438145998246_node=-2665323566257888606",
          "description": "describes a moment of pet-related accomplishment; specifically, the text recounts a positive event or achievement involving a person's pet. For example, 'My dog finally learned how to do a trick I've been teaching him for weeks.'",
          "texts": [
            "Our new cat tree arrived, and while assembling it, Carol watched a while, then suddenly jumped on it and went to town like old times.",
            "While eating breakfast, i felt a light jab from my border collie, she had gathered the paper dish the bird tossed from the top of his cage and brought it to me for her task treat!"
          ],
          "description2taxonomy": {}
        },
        "discusses receiving or giving gifts related to animals; specifically, the text mentions a present, surprise, or gesture involving a pet or animal-themed item. For example, 'My best friend got me a cat-themed birthday cake and it was perfect.'": {
          "node_name": "root_id=9_node=-870301438145998246_node=-763949509607960094",
          "description": "discusses receiving or giving gifts related to animals; specifically, the text mentions a present, surprise, or gesture involving a pet or animal-themed item. For example, 'My best friend got me a cat-themed birthday cake and it was perfect.'",
          "texts": [
            "While eating breakfast, i felt a light jab from my border collie, she had gathered the paper dish the bird tossed from the top of his cage and brought it to me for her task treat!",
            "I got a package of free dog food samples in the mail."
          ],
          "description2taxonomy": {}
        },
        "involves birds as a source of happiness; specifically, the text shares a happy moment or interaction with pet or wild birds. For example, 'I enjoyed watching my parakeets sing and chirp with each other today.'": {
          "node_name": "root_id=9_node=-870301438145998246_node=5791698918115240638",
          "description": "involves birds as a source of happiness; specifically, the text shares a happy moment or interaction with pet or wild birds. For example, 'I enjoyed watching my parakeets sing and chirp with each other today.'",
          "texts": [
            "I hatched the duck eggs I've been incubating! They finally hatched and the babies are soft."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves no one; specifically, the text describes a happy moment experienced alone or without any specific person mentioned. For example, 'I finished reading a great book and felt accomplished.'": {
      "node_name": "root_id=9_node=5585066939039520995",
      "description": "involves no one; specifically, the text describes a happy moment experienced alone or without any specific person mentioned. For example, 'I finished reading a great book and felt accomplished.'",
      "texts": [
        "While i was travelling in my bike today morning, cool breezeeeeee hit me for about ten minutes, which made me feel very happy.",
        "I finished my college semester with a 4.0.",
        "I finished reading a book that i had been struggling with",
        "I was able to bbq outside because the weather was nice and that made me happy.",
        "I felt happy when I finished a very long tedious task at work. I had been working on it for the past two days that basically involved recoding a data set.",
        "Feel asleep to the sound of a rain storm.",
        "I finally had a cheeseburger after a long time.",
        "Yesterday, I cleared all my pending tasks such as buying house stuffs etc., then i could spare time for myself. I would like to do this frequently.",
        "I found a bag of candy that was unopened when I was hungry.",
        "I was able to lose a few pounds I'd been carrying.",
        "Sleeping extra late.",
        "I made and baked chocolate chip cookies.",
        "I got the lawn mowed.",
        "I was able to pay off some bills that had piled up.",
        "I worked out at the gym and got a lot done during it.",
        "I got a long-overdue haircut and it looks very nice.",
        "Feeling like I made a difference at work.",
        "My cat slept on my lap.",
        "I won $2 on a lottery ticket.",
        "I reached a desirable ranking on the game I play.",
        "Wrote my last final for college and now I'm finished college for the summer.",
        "I finished reading the library book I wanted to read and it was a good story.",
        "I discovered a carton of Jello Pudding in my refrigerator just as I was finishing lunch yesterday and savored the treat.",
        "I did my makeup well and I looked pretty.",
        "I became happy when I finished my thesis paper for Law School.",
        "I was so happy on the day that the last of the snow melted.",
        "I found $20 on the sidewalk.",
        "I reached my weekly fitness goal in running.",
        "I went shopping and found out that I had enough money in my food budget to buy good quality food.",
        "I am sticking to my daily workout goals. That's an achievement which makes me happy and satisfied.",
        "making espresso after i wake up",
        "Taking a hot shower made me feel happy.",
        "I had a beautiful morning filled with a great workout and prayer session.",
        "I felt a moment of inspiration about how I could be happy in life...by thinking about all that I could look forward to in the future.",
        "I changed some furniture around to give my living room a new feel and it has made things more comfortable.",
        "Having time to watch old classic movies",
        "I had some white chocolate chip, macadamia cookies.",
        "Finished cleaning a part of my house.",
        "Today I was happy when class was let out half an hour early.",
        "I had a nice, hearty breakfast.",
        "I have not cheated one time on my diet since starting it, which is a huge accomplishment and makes me happy.",
        "I finished all of the laundry that had been piled up.",
        "I took a walk today while the weather was nice and sunny.",
        "Today the road is free from traffic and i enjoyed riding my bike.",
        "Returning home from vacation to my pet cat.",
        "I was happy when I found time to exercise.",
        "My favorite ice cream place opened for the season and I bought and ate a quart of my favorite flavor.",
        "When I found a place to live I could call home."
      ],
      "description2taxonomy": {
        "involves a pleasant surprise; specifically, the text recounts a happy moment resulting from an unexpected event or discovery. For example, 'I found $20 on the sidewalk.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=4723054251860642572",
          "description": "involves a pleasant surprise; specifically, the text recounts a happy moment resulting from an unexpected event or discovery. For example, 'I found $20 on the sidewalk.'",
          "texts": [
            "I found a bag of candy that was unopened when I was hungry.",
            "I won $2 on a lottery ticket.",
            "I discovered a carton of Jello Pudding in my refrigerator just as I was finishing lunch yesterday and savored the treat.",
            "I found $20 on the sidewalk.",
            "I went shopping and found out that I had enough money in my food budget to buy good quality food.",
            "Today I was happy when class was let out half an hour early.",
            "My favorite ice cream place opened for the season and I bought and ate a quart of my favorite flavor.",
            "When I found a place to live I could call home."
          ],
          "description2taxonomy": {}
        },
        "involves relaxation or leisure; specifically, the text describes happiness found in downtime, rest, or peaceful moments. For example, 'I slept extra late and felt refreshed.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=-8090829089333885022",
          "description": "involves relaxation or leisure; specifically, the text describes happiness found in downtime, rest, or peaceful moments. For example, 'I slept extra late and felt refreshed.'",
          "texts": [
            "While i was travelling in my bike today morning, cool breezeeeeee hit me for about ten minutes, which made me feel very happy.",
            "I was able to bbq outside because the weather was nice and that made me happy.",
            "Feel asleep to the sound of a rain storm.",
            "Sleeping extra late.",
            "My cat slept on my lap.",
            "Taking a hot shower made me feel happy.",
            "Having time to watch old classic movies",
            "I took a walk today while the weather was nice and sunny.",
            "Today the road is free from traffic and i enjoyed riding my bike."
          ],
          "description2taxonomy": {}
        },
        "involves improved living conditions; specifically, the text focuses on changes in one's environment or living space that brought happiness. For example, 'I changed some furniture around to give my living room a new feel.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=-1258745204878509783",
          "description": "involves improved living conditions; specifically, the text focuses on changes in one's environment or living space that brought happiness. For example, 'I changed some furniture around to give my living room a new feel.'",
          "texts": [
            "I changed some furniture around to give my living room a new feel and it has made things more comfortable."
          ],
          "description2taxonomy": {}
        },
        "involves food or refreshment; specifically, the text describes happiness derived from consumption of food or drink. For example, 'I finally had a cheeseburger after a long time.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=-8871073396424109391",
          "description": "involves food or refreshment; specifically, the text describes happiness derived from consumption of food or drink. For example, 'I finally had a cheeseburger after a long time.'",
          "texts": [
            "I finally had a cheeseburger after a long time.",
            "I found a bag of candy that was unopened when I was hungry.",
            "I made and baked chocolate chip cookies.",
            "I discovered a carton of Jello Pudding in my refrigerator just as I was finishing lunch yesterday and savored the treat.",
            "making espresso after i wake up",
            "I had some white chocolate chip, macadamia cookies.",
            "I had a nice, hearty breakfast.",
            "My favorite ice cream place opened for the season and I bought and ate a quart of my favorite flavor."
          ],
          "description2taxonomy": {}
        },
        "involves spiritual or physical exercise; specifically, the text describes happiness related to engaging in activities that promote physical or spiritual well-being. For example, 'I had a beautiful morning filled with a great workout and prayer session.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=-2167632200909118368",
          "description": "involves spiritual or physical exercise; specifically, the text describes happiness related to engaging in activities that promote physical or spiritual well-being. For example, 'I had a beautiful morning filled with a great workout and prayer session.'",
          "texts": [
            "I worked out at the gym and got a lot done during it.",
            "I reached my weekly fitness goal in running.",
            "I am sticking to my daily workout goals. That's an achievement which makes me happy and satisfied.",
            "I had a beautiful morning filled with a great workout and prayer session.",
            "I took a walk today while the weather was nice and sunny.",
            "I was happy when I found time to exercise."
          ],
          "description2taxonomy": {}
        },
        "involves an accomplishment; specifically, the text describes the completion of a task or goal that led to happiness. For example, 'I finished all of the laundry that had been piled up.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=1707768671778476651",
          "description": "involves an accomplishment; specifically, the text describes the completion of a task or goal that led to happiness. For example, 'I finished all of the laundry that had been piled up.'",
          "texts": [
            "I finished my college semester with a 4.0.",
            "I finished reading a book that i had been struggling with",
            "I felt happy when I finished a very long tedious task at work. I had been working on it for the past two days that basically involved recoding a data set.",
            "Yesterday, I cleared all my pending tasks such as buying house stuffs etc., then i could spare time for myself. I would like to do this frequently.",
            "I was able to lose a few pounds I'd been carrying.",
            "I made and baked chocolate chip cookies.",
            "I got the lawn mowed.",
            "I was able to pay off some bills that had piled up.",
            "I got a long-overdue haircut and it looks very nice.",
            "I reached a desirable ranking on the game I play.",
            "Wrote my last final for college and now I'm finished college for the summer.",
            "I finished reading the library book I wanted to read and it was a good story.",
            "I became happy when I finished my thesis paper for Law School.",
            "I reached my weekly fitness goal in running.",
            "I am sticking to my daily workout goals. That's an achievement which makes me happy and satisfied.",
            "Finished cleaning a part of my house.",
            "I have not cheated one time on my diet since starting it, which is a huge accomplishment and makes me happy.",
            "I finished all of the laundry that had been piled up."
          ],
          "description2taxonomy": {}
        },
        "embodies a moment of self-reflection or introspection; specifically, the text conveys a happy moment experienced while thinking deeply about oneself or one's life. For example, 'I felt a moment of inspiration about how I could be happy in life...by thinking about all that I could look forward to in the future.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=8755181876473804219",
          "description": "embodies a moment of self-reflection or introspection; specifically, the text conveys a happy moment experienced while thinking deeply about oneself or one's life. For example, 'I felt a moment of inspiration about how I could be happy in life...by thinking about all that I could look forward to in the future.'",
          "texts": [
            "I felt a moment of inspiration about how I could be happy in life...by thinking about all that I could look forward to in the future."
          ],
          "description2taxonomy": {}
        },
        "describes a positive homecoming or return; specifically, the text mentions a happy moment experienced when returning to a familiar place or situation. For example, 'Coming back to my childhood home filled me with happiness.'": {
          "node_name": "root_id=9_node=5585066939039520995_node=3242503624169893865",
          "description": "describes a positive homecoming or return; specifically, the text mentions a happy moment experienced when returning to a familiar place or situation. For example, 'Coming back to my childhood home filled me with happiness.'",
          "texts": [
            "Returning home from vacation to my pet cat."
          ],
          "description2taxonomy": {}
        }
      }
    }
  }
}