{
  "node_name": "root_id=8",
  "description": "root",
  "texts": [
    "The Mega-Fight Edition (Vol.VII): Oscar De La Hoya's Double Take",
    "Eating healthy is rewarding at I Dream of Falafel Chicago",
    "Rose Bowl 2015: Oregon vs. Florida State live stream & TV game time",
    "Cross country skiing comes to the Midwest update",
    "15 Quotes about life",
    "'YU-GI-OH!' card analysis: Fissure",
    "Ohio's incoming Gov. looking to cash in on Marcellus Shale",
    "Ke$ha talks 'Douchebag' on live TV: Ryan Seacrest left talking fast (video)",
    "Akhenaten and the Culture of Love",
    "Free Starbucks coffee $40 gift card Facebook scam haunts the timeline",
    "Is The Music Scene Dead?",
    "Michael Buble announces first-ever shows in Dubai",
    "2013 horoscope goes viral on web",
    "Seven slim-down secrets of superstars, from Jennifer Aniston to Fergie",
    "Go old with the New Year",
    "2012 NFL Postseason schedule: Early Las Vegas odds",
    "'My Last Year With the Nuns' will have theatrical premiere Jan. 9 in Seattle",
    "High School English: Philosophy - Sophie's World Part Thirty-Five (video)",
    "Dayton faces Lobos in The Pit",
    "Fishing on the largest pier in the Gulf of Mexico Gulf Shores Alabama (Photos)",
    "Teaching Consumerism in the Classroom",
    "Lawsuit: Guns seized after veteran, decorated cop seeks treatment for insomnia",
    "Man demands job at McDonald's at gun point",
    "Practice sessions - Part 3",
    "2010 Year End Review!",
    "Hugh Hefner and Crystal Harris finally tie the knot",
    "Cleveland Museum of Art acquires Benkaim Deccan and Mughal painting collection",
    "Shop Kmart's semi-annual intimate apparel event",
    "New Year's Day Resolution Activities for Children",
    "Ask Michael Q&A : Where do I draw the line when it comes to family?",
    "Ahead of the storm, Gutlove, family and friends begin installation of 'Verve'",
    "'Deadpool' other Marvel games license expires, pulled from digital stores",
    "Lauren Conrad 'tweets New Years Eve fun' (PHOTO)",
    "Creationism and evolution offer many distinctions yet many similarities",
    "Celebrity trainer unveils his new diet for shorter women on The View and GMA",
    "Bruins upset the Flyers at Fenway",
    "Kim Kardashian's pre-new year's eve dress: Fashion hit or miss? (view photos and watch video)",
    "Angeleana M. Walker is missing girl in Spokane, Washington",
    "Home Hangover Remedies",
    "Jersey Shore: Deena spends New Year's Eve with boyfriend, parents (PHOTO)",
    "The leap from vegetarian to vegan and a New Year's pot of beans",
    "New Year Resolutions and those 'pesky' ghosts",
    "The Best Marketing Campaigns of 2012 (Photos)",
    "Hiatus?",
    "Sarah Ding conquers conventions with her art",
    "Diet budget friendly; low fat blueberry bran muffins",
    "Cowboy Troy",
    "Oprah Winfrey Network begins with 'Kidnapped' show",
    "Cat behaviors defined",
    "Actor James Avery dead at 65",
    "The best dressed list of 2012 (Photos)",
    "Local companies worth investing in: The 2010 year in review",
    "Open carry handgun flipflop Wendy Davis won't go quietly into that good night",
    "Dad $130 million lawsuit adoption: Alleged fraud over birth father's rights",
    "A new beginning in 2013",
    "Make a resolution that works",
    "Schizophrenic Fla. man decapitates 'chore nagging' mother on New Year's Eve",
    "Happy New Year! So you want to buy a home in 2015?",
    "Sarah Palin sparks fury with Facebook pictures of her son and dog",
    "Kate Gosselin dating: Gosselin reportedly lands millionaire Jeff Prescott",
    "Save up to 60% off at Sears' fashion clearance",
    "LeAnn Rimes vacations in Cabo showing off side boob",
    "Au Bon Pain delights with new holiday menu",
    "DiCaprio welcomes the New Year on a wild yacht ride with topless beauties",
    "Kaley Cuoco's pink wedding gown become a trend? 'Big Bang Theory' star marries",
    "Santa Cruz restaurant Kianti's 10th anniversary party with specials and prizes",
    "Capital Region forecast for Saturday January 1, 2011",
    "Giuliana Rancic claims she made 'dumb' New Year's resolution for 2011",
    "A touch of reality",
    "Alexandria Citizens Band Humming HomeMade Hummus",
    "New Years weather: 2009 records lead to a return of old man winter",
    "Most Anticipated Films of 2015",
    "Torture should be used occasionally",
    "Hailey Glassman's friends reveal Hailey is afraid of Jon Gosselin",
    "When one woman cop took on a country, a corporation, and the UN",
    "FYI WIRZ: fast Darlington Raceway slows for South Carolina blood drives",
    "First Night Alexandria a big hit again",
    "How to Make an Unbreakable Resolution For The New Year!",
    "IDF-Jewish-Muslim noise dispute in Hebron in West Bank",
    "Utah Jazz head coach Quin Snyder gives his players a death stare, they win by 6",
    "Cougars on the prowl in Sacramento. Be aware. Be alert",
    "Captain America Artist Comes to Minneola!",
    "10 steps to leading yourself and others to success",
    "123rd Tournament of Roses Parade airs on NBC",
    "Judge cites government missteps: Tosses Blackwater case",
    "Kim Kardashian dishes on biggest pregnancy craving, New Year's resolution",
    "Jon Gosselin's ex dating 'Real Housewives of New Jersey' son: report",
    "Biggest metal news stories for each month of 2013",
    "'Teen Mom': Gary Shirley says Amber Portwood won't regain custody of daughter",
    "So This is 2013",
    "First ride of 2010: The Sangre de Cristo Range and Skyline Drive",
    "Live, Love, & Give - The Holiday Dinner Series",
    "New Year's Day 2015 bowl schedule & odds; Cotton, Sugar, Rose Bowl headline day",
    "Marvel news: Actress hints that 'S.H.I.E.L.D.' will not pull much from comics",
    "Delicious soup recipes: Italian sausage soup with pasta",
    "North Korea allows first Western movie to be aired: 'Bend it Like Beckham'",
    "Next Christmas, throw away a tree, or not",
    "Child abuse prevention groups still making noise against Townshend",
    "Child endangerment: Man leaves 3-year-old daughter home alone to buy coke",
    "Looney Tunes Super Stars: Pepe Le Pew Collection",
    "New Reports Say Munchak Still Considering Penn State Job",
    "Baby Dies After Being Removed From Life Support;Family Pushes For The Olivia Law",
    "Make Mine a Builder's Tea- it's manly!",
    "Fiesta Bowl 2014 TV coverage time, live stream for UFC vs. Baylor",
    "Newest Addition",
    "Jennifer Lopez in skin tight leotard at Times Square pictures and video",
    "Marion Square: A great place to start for budget friendly fun",
    "Senate passes 'fiscal cliff' bill",
    "Gospel music channel video awards at 7/6 c",
    "Three goals for DC Actors in 2012",
    "10 Ski areas close to Boston",
    "Foreclosure mediation act to help homeowners facing foreclosure",
    "End of the year with Tahlequah Mayor Jason Nichols ...",
    "Grassroots 2015: Arizona should model their Common Core fight after Oklahoma's",
    "Is Janet Napolitano up to the job? A cartoon!",
    "AirAsia did not have permit to fly on day of plane crash",
    "Start off the Year with a Pair of Boots from the DUO Winter Sale",
    "Governor announces $125.3 million for rural and urban local road improvements December 30, 2010",
    "Jim Cantore is heading to Boston to cover Winter Storm Hercules for TWC",
    "Hopping John: a New Year's Day tradition",
    "Charlaine Harris squashed rumors of a 'True Blood' collaboration",
    "Free 2011 online printable calendars",
    "Book club food: 5 party appetizer ideas - stuffed mushrooms, deviled eggs, dip",
    "More Baltimore Men Opting for Cosmetic Surgery",
    "NFL coaches fired: Dallas owner refuses to address assistants",
    "Colts heart too much for Texans (Photos)",
    "Women's 4x100-meter freestyle relay Olympic medal winners",
    "James Avery of 'The Fresh Prince of Bel-Air' passes away at 68",
    "A 99ers Year in Review - 2010",
    "Filmmaker Nia Malika Dixon - In the Zone",
    "10 Reasons the 'Wolf of Wall Street' is a Schmuck",
    "Hasbro is replacing piece in Play-Doh set that looks like a male genital organ",
    "Energy healing sessions available every Sunday at Unity South Atlanta Church",
    "2010 - How do you say it, 'twenty ten' or 'two-thousand ten'?",
    "Exploring Northern Napa Valley",
    "January 1, 1985: 25 years ago",
    "New footage from 'Toy Story 3' now online",
    "Don't waste your time at Town of Islip's Winter by the Bay",
    "Freelancers tips as Obamacare hits 2 million",
    "Police chief shoots wife: Investigation to determine if it was accidental",
    "Avigdor Lieberman indicted by Israeli court",
    "Recycling Christmas trees",
    "A good-luck dish for New Year's Day",
    "Carpet freshener - make your own (MYO)",
    "Loyal soap opera fans look forward to 2015",
    "Cuccinelli backs down on changing law",
    "Boston weather: Bracing for heavy snow, winds, coastal flooding and very cold",
    "LG Vortex, small profile Android 2.2 phone, available now at local Verizon store",
    "Kim Kardashian opens up about pregnancy",
    "Ohio headline highlights",
    "2010 is the Year of the Tiger",
    "Letting the Christmas celebration continue",
    "Bass fishing a little slow",
    "Humphries named Calgary Sports Examiner athlete of the year",
    "Interview with E.M. Powell, author of The Blood of the Fifth Knight",
    "Examiner Figure Skating in 2012: What the readers read/viewed most",
    "A tale of two Presidents",
    "Father and daughter preview new Brazilian jazz album with Hendrik Meurkens",
    "Chicago educators should further innovate STEM instruction",
    "The Fresh Prince Of Bel-Air actor, James Avery, dead at 65",
    "Kristen Stewart taps experience for 'Still Alice' role",
    "Virginia loses a native son in Captain William B. 'Bill' Overstreet",
    "ABC's 'V': Jane Badler talks reprising old role, connection to Anna",
    "Baby found starved to death outside Fla. restaurant: Parents charged with murder",
    "Providence weather forecast 1/2/12: showers early, sunny afternoon ...",
    "'New Year's Rockin' Eve': Justin Bieber joins forces with Carlos Santana (video)",
    "Event: Cuba: What Everyone Needs to Know",
    "Journalist found in contempt for calling court 'thieves' and 'basket of rotten apples'",
    "Crabby resolves: a 2010 Crabby Kickoff",
    "2012 Homeschool Family Calendar and Planner",
    "Hunting the haunted: Valley View's Hidden Cemetery",
    "Military Option for Manatee students",
    "People wait in line to purchase marijuana legally in Colorado as stores opened",
    "NPS ranger shot and killed at Mount Rainier National Park",
    "Makeover your marriage and your budget",
    "The mugging of a Presidential candidate",
    "Housewives of Atlanta: Kim Zolciak opens New Year with Ciroc, Tiara",
    "NBC's 'Chuck': ringing in 2011 with spoiler dish",
    "Eagles may talk to three Falcons assistants before wooing Kelly",
    "New Year's resolution",
    "Stop making New Year's Resolutions",
    "New Year's resolutions for Libertarians",
    "Encouraging workplace wellness",
    "Freeing Ourselves from Imposed Established Self-Limiting Morality",
    "3 content ideas real estate agents can use to blog and drive traffic",
    "North Carolina senior and caregiver resources",
    "Happy New Year SF, you will hold the 2013 America's Cup",
    "A College Students Guide To Disney World: Hollywood Studios",
    "Is Kelly Johnson Arizona's long-term solution at second base?",
    "Listening to it all ... LIVE!",
    "Gyro sandwich",
    "Sales We're Loving this Week",
    "The unconscious in the Bible",
    "Ke$ha rides Santa Claus on 'New Year's Rockin' Eve' (photos)",
    "Resolutions should be forever",
    "Matchmaker Joe Quiambao reflects on the progression of his first world champion, Andre Berto",
    "Finding a yoga teacher",
    "The Three Days of Moondark",
    "MFJ-986: a transmatch that will handle just about anything",
    "New England Patriots equipment manager Don Brocher loses battle with leukemia",
    "One Direction's Niall Horan wishes fans a good 2013: 'Happy New Year guys'",
    "Couple trapped in closet but door was locked from the inside",
    "Admit one: church to heaven or state to earth - hub",
    "2012 Ford Edge boosts its popularity with EcoBoost (Photos)",
    "ACC women's hoops season opens with explosion Monday night",
    "Developing discipline for personal growth",
    "January 12 and 13, 2013: Gathering of the Gunfighters at Yuma Territorial Prison",
    "Hickenlooper debates living in Denver governor's mansion: WSJ",
    "NASCAR: Five 2014 Sprint Cup Series Predictions",
    "Bad TV's most wanted: Political know-nothings: #7",
    "'It is realistic' that Andre Ward will beat Gennady Golovkin in 2014",
    "Fertility holiday blues",
    "Green Door closes clubhouse",
    "New year's resolutions: begin the year by giving back to one of these great local organizations",
    "Best beauty bet? Kale!",
    "Christmas is over or is it?",
    "2012 Palin panic hits MSNBC: ' I'm just praying that Sarah Palin goes away'",
    "The Wonderful World of Marcus Singletary (part two)",
    "'Teen Mom' Jenelle Evans posts bare baby bump photo online",
    "Sara Paretsky At Women & Children First for V.I. Warshawski 30th Anniversary",
    "2015 track profile: Bristol Motor Speedway",
    "Ski Areas Struggling with Weather; Help May Be On Way",
    "Demi Lovato talks drug addiction, bulimia, anorexia and bipolar disorder",
    "Is your New Year's Day resolution to lose weight? Seven easy tips for weight loss",
    "Illinois lawmakers pondering gun ban in defiance of voters' will",
    "Controversial goal sends Mariners over Perth",
    "Ohio State quarterback Braxton Miller could transfer to Florida State",
    "Kim Kardashian picks Justin Bieber photo shoot as her favorite from 2010",
    "Prized Ferrari collection to be sold at arizona auction",
    "Deadly New Year stampede: 61 die in Ivory Coast",
    "Is it possible to love again?",
    "Kaley Cuoco apology: Actress' feminism comment totally taken out of context",
    "Marquette upends Villanova, 81-77, in Big East opener",
    "80stees com - shop for retro super hero garb",
    "Mega Millions lottery jackpot at $30 million",
    "ARC neutering male dogs & cats in January for $20.00",
    "Review: Showboat Branson Belle for amazing dinner and show in Branson",
    "Business & unemployment: Forbes says weak Obama & roll-backs key to hiring",
    "Cage the Elephant New Year Eve's Concert Review",
    "Neil Armstrong lied: 'One small step for man' was preplanned",
    "Lady Gaga and 'giant black globe' ring in 2012 (photos)",
    "Demi Lovato performs 'Give Your Heart A Break' on New Year's Eve special (video)",
    "New Year's hike is 2 p.m. at McCormick's Creek; Polar Bear Plunge canceled",
    "Providence weather: Dry weather continues",
    "5 female teachers killed: Gunmen open fire in Pakistan",
    "Pottermore Christmas content ends with Draco Malfoy",
    "Lee's overtime tally gives B-Sens much needed divisional win",
    "Tarpon Springs at the end of 2012",
    "Jay-Z to compose 'The Great Gatsby' score",
    "Sean Hannity's television ratings plummeted since Obama won",
    "Boca Grande's off-season fishing - Boca Grande, Florida",
    "Bill Maher celebrates 2012 by 'Tebowing' in a tree",
    "DWI forklift driver destoys hundreds of cases of booze (video)",
    "New Year's Day food traditions",
    "Mrs. Howard Stern eats bread, loses weight",
    "Film and television star James Avery dies",
    "UTSA end year with a win",
    "The New No Shampoo Shampooing Method For Curly Hair",
    "8-month-old Arizona boy Gabriel Johnson still missing after mother's arrest in Miami Beach",
    "2014 New Year's Resolution: more astronomy, less astrology",
    "Fashion models needed",
    "LeBron James sidelined two weeks with pair of injuries",
    "Jump Your Bones Inc. recalls Kangaroo meat pet treats due to possible Salmonella",
    "2009 Entertainment farewells",
    "'Punk'd': Miley Cyrus, Justin Bieber among official guest hosts (video)",
    "Finding language in the brain: What structures are involved and how do we know?",
    "How to avoid failing from reaching your New Year Resolution goals",
    "Baltimore Ravens hope to avoid Peyton Manning and the Indianapolis Colts",
    "Spend some quality family time this New Year at Manhattan Beach Marriott",
    "Ecclesiastes 1:2",
    "Princess Cruises 'Love Boat' float wows 'em at Rose Parade wins prize(video)",
    "Remaining game schedule set for World Junior Championship",
    "Liberals wish death on Rush Limbaugh",
    "Carnegie Science Center joins forces with Pittsburgh Ballet. 21 and older please",
    "A New Year's resolution, keeping this year's resolution",
    "Letdown Month 2013: an introduction",
    "2012 Mid-Atlantic South All Star: Holden Grudges #63 (Photos)",
    "Iron Man fan film 'Metal Head' with Paul Bettany sounding J.A.R.V.I.S.",
    "KC Chiefs/Denver Broncos NFL Week 17: The NFL wants Tebow in the playoffs",
    "Box Office Report: Audiences Catch Up to Mission: Impossible",
    "Bloody good Marys to be found at Max's Tavern by the Basketball Hall of Fame",
    "Big second half sends Spartans over UTSA Basketball",
    "Can we expect a more happy new year?",
    "Father requested police to supervise him while he spanked 12-year-old daughter",
    "NFL rumors: Andy Reid will be named next Arizona Cardinals coach",
    "Jazzlyn entertains at TGIM New Year's Eve Party in SW Florida",
    "Penn State leads after Day One at 2012 Southern Scuffle with nine semifinalists",
    "Jenni Rivera finally laid to rest almost a month after fatal plane crash",
    "Daniel Radcliffe's Final Week of 'How to Succeed' Performances Breaks Record",
    "Post-holiday cabbage soup is high-fiber, down-to-earth fare",
    "'The Bachelor' 2012: Ben Flajnik appears on 'New Year's Rockin' Eve'",
    "Samuel L. Jackson changes jobs: stage to screen and back in career changes",
    "CES 2010 general info",
    "Sex discrimination in the cabinet industry?",
    "Today in TV: January 1, 2014",
    "Rose Bowl predictions 2014: Experts split on Stanford vs. Michigan St. Rose Bowl",
    "Missouri DUI law may soon allow blood draws without a warrant",
    "Campbell Recalls 300 Cases of Prego Traditional Italian Sauce Due to a Risk",
    "Local area schools post new 2011 calendars for student activities",
    "Lady Gaga releases new mix of 'Do What U Want' featuring Christina Aguilera",
    "Karina Smirnoff and Gerry Kelly team up at the Catalina Hotel and Beach Club",
    "Dogs get cabin fever too",
    "Kathy Griffin strips to underwear on CNN New Year's Eve show - VIDEO",
    "Afghan suicide bomber update: CIA revenge, Afghan National Army, invited on Afghanistan base (video)",
    "2011 Ford Explorer gets two new engines and better fuel economy",
    "Chase Vicaire captures male athlete of the week",
    "Jennifer Lopez steams up Times Square on a cold night in NYC for New Year's Eve (photos, video)",
    "'FlashForward' character pages hub",
    "Best Buy offers best iPad Air price and it's lower than Black Friday deals were",
    "Happy New Year!",
    "This day in Royal History: January 1st",
    "Being a stay-at-home mom",
    "Saturday's LSU men's basketball game moved to 4:30 p.m.",
    "Free Coffee this Thursday, 1/5/12",
    "Nature's Harvest recall of 34.3K lbs. organic ground beef affects Price Chopper",
    "Great days for a Gunstock Getaway",
    "New book on Portland theaters joins illustrated series",
    "Reduce Your Impact On the Environment - Are You Ready to Go Green In 2012?",
    "Mike Leach, fired Texas Tech coach update, offers new story on James controversy",
    "'Chicago' casts reunite for winter premieres",
    "First Arctic blast of the season bringing freeze threats to Tampa Bay",
    "American version of Girl With The Dragon Tattoo is being met with controversy",
    "This weekend, 'The Woman in Black' haunts again in sequel 'The Angel of Death'",
    "2013 A Year to Remember",
    "Laid-back Swedish luxury for L.A. - Acne Studios new downtown flagship",
    "What's in Gabrielle Thompson's closet?",
    "Just go in the studio and make hit records: Jimmie Haskell revisits Rick Nelson",
    "Flu season picks up across the south",
    "Home-made Hearty Chili soup",
    "New Year's Day: A time to look forward and backwards as well",
    "Gay couple weds on top of a cake on a float in Tournament of Roses Parade",
    "Rule number one is to cleanse your skin and remove your makeup properly",
    "An alternative to hot spinach dip",
    "Fashion trends in 2010: Take a fashion cue from the Spring/Summer 2010 fashion week runways",
    "Gruv Gear Supports Career Musicians Through Sweet Relief Musicians Funds",
    "If I had a second chance to homeschool my kids",
    "Marquette edges Connecticut in overtime to begin conference play",
    "Don't make New Year's resolutions today - 60 second success tip",
    "Airport pat-downs not effective",
    "Americans save $530 per year gardening while improving health",
    "Come see what you are missing in Portland, Oregon (Photos)",
    "Organic farm in The Redlands opens to the public",
    "What a December for the Dynamo",
    "The best of beauty in 2011",
    "Bieber's new tattoo shows his love for Jesus and religion",
    "I LOVE NY Bonus Weekends at Gore Mountain",
    "Painkillers found in ice cream: Cones at Tesco recalled over tainting",
    "Reflections on 2013 and the new year",
    "Sayonara 2012",
    "Top Ten 2013 New England Bands, number 7 Conforza",
    "Chick-fil-A investigating possible data breach: Check your credit account",
    "Maine Red Claws win their 10th game by beating the Erie Bayhawks",
    "Bake biscuits for the perfect solution to left-over eggnog",
    "Dominion VA Power to increase rates while Sierra seeks new payment scheme",
    "Recent study suggests lack of support of space exploration by evangelicals",
    "Mary, the herald of the baby Jesus heralds the first day of the year",
    "Relaxing with a mud pack and (a glass)or mug of mulled cider, does wonders",
    "Mecca is out, Karbala is in: Iraq tries to change direction of Muslim prayer",
    "San Francisco Bay area good food heroes of 2012",
    "Bloom's Taxonomy discussion: Roxanne and Courtney jump to the wrong conclusions",
    "Saved by faith",
    "Autism 2010: Keep Your Resolution to Autism",
    "Interview with D.L. Anderson, author of Unlocking the Mystery of You",
    "New Year: New in Christ",
    "Was there ever a female pope known as Pope Joan",
    "ABC Honcho Issues Warning to Incoming House Republicans",
    "The very best floors of 2012, part II",
    "25th Annual Houston Shoes for Kids provides 3,000 pairs of shoes",
    "Miley Cyrus loves very gay fans in London, 'more open than the U.S.'",
    "Crystal Harris goes bridal pink for her New Year's Eve wedding to Hugh Hefner",
    "New Report Ranks Carolinas in Middle Tier of Animal Protection Laws",
    "Confederate raid at dawn: The Battle at Monroe's Crossroads",
    "Vintage Barbie clothing lot sells for $449 on eBay",
    "Belk wedding registry completion event",
    "Review: Skinny Puppy at Best Buy Theater",
    "Dina Manzo's assistant says someone fans know is spreading lies about her",
    "Texas homeowner shoots intruder in self defense",
    "Part 2: Lady Gaga exploits young gays and lesbians",
    "2013-14 NFL Playoffs: Latest odds and news",
    "Get cooking in 2010: Portland ethnic cooking classes",
    "A prayer for the New Year",
    "Ke$ha gets downright messy in new music video for 'Dirty Love'",
    "Michael Phelps and girlfriend split up; relationship wasn't going anywhere",
    "The top green business trends of 2012",
    "Sotomayor Blocks Obamacare Mandate for Little Sisters of the Poor",
    "Help for parents of troubled teens in the bay area",
    "2013 Winter Movies: A complete preview of this season's upcoming releasese",
    "Acting, Healing, and Spirituality - Rediscovering 'Real Life'",
    "Vitamin E shows promise in slowing progression of Alzheimer's in some patients",
    "It's not about me",
    "Gerald Anderson kissed the pop star Sarah Geronimo's forehead at Asap 2012",
    "Book Review: Cleopatra's Daughter",
    "Brian Dawe says Farrah Abraham hired him to be her boyfriend for TV",
    "Replace civility with honesty",
    "Floyd Mayweather's Plan B: Dismantling all Hatttons",
    "NFL coaches fired: Top choices to replace departed coaches",
    "Bombing raises questions of concern",
    "Recognizing and living with Seasonal Affective Disorder (SAD)",
    "Deal or nor, America's headed for the cliff",
    "Bay Area top ten art picks for 2014"
  ],
  "description2taxonomy": {
    "highlights a shocking or tragic event; specifically, the text describes an unexpected or emotionally charged occurrence. For example, '10-year-old hero saves entire family from burning house!'": {
      "node_name": "root_id=8_node=1503543661162300304",
      "description": "highlights a shocking or tragic event; specifically, the text describes an unexpected or emotionally charged occurrence. For example, '10-year-old hero saves entire family from burning house!'",
      "texts": [
        "Man demands job at McDonald's at gun point",
        "Schizophrenic Fla. man decapitates 'chore nagging' mother on New Year's Eve",
        "Child endangerment: Man leaves 3-year-old daughter home alone to buy coke",
        "Baby Dies After Being Removed From Life Support;Family Pushes For The Olivia Law",
        "Police chief shoots wife: Investigation to determine if it was accidental",
        "Baby found starved to death outside Fla. restaurant: Parents charged with murder",
        "NPS ranger shot and killed at Mount Rainier National Park",
        "The mugging of a Presidential candidate",
        "New England Patriots equipment manager Don Brocher loses battle with leukemia",
        "Couple trapped in closet but door was locked from the inside",
        "Deadly New Year stampede: 61 die in Ivory Coast",
        "5 female teachers killed: Gunmen open fire in Pakistan",
        "DWI forklift driver destoys hundreds of cases of booze (video)",
        "8-month-old Arizona boy Gabriel Johnson still missing after mother's arrest in Miami Beach",
        "Jenni Rivera finally laid to rest almost a month after fatal plane crash",
        "Texas homeowner shoots intruder in self defense"
      ],
      "description2taxonomy": {}
    },
    "involves celebrities or entertainment; specifically, the text covers news or commentary related to actors, musicians, movies, or television shows. For example, 'You won't believe how this Hollywood star transformed their body for a role!'": {
      "node_name": "root_id=8_node=-9110959279508980557",
      "description": "involves celebrities or entertainment; specifically, the text covers news or commentary related to actors, musicians, movies, or television shows. For example, 'You won't believe how this Hollywood star transformed their body for a role!'",
      "texts": [
        "The Mega-Fight Edition (Vol.VII): Oscar De La Hoya's Double Take",
        "Ke$ha talks 'Douchebag' on live TV: Ryan Seacrest left talking fast (video)",
        "Michael Buble announces first-ever shows in Dubai",
        "Seven slim-down secrets of superstars, from Jennifer Aniston to Fergie",
        "Hugh Hefner and Crystal Harris finally tie the knot",
        "'Deadpool' other Marvel games license expires, pulled from digital stores",
        "Celebrity trainer unveils his new diet for shorter women on The View and GMA",
        "Kim Kardashian's pre-new year's eve dress: Fashion hit or miss? (view photos and watch video)",
        "Jersey Shore: Deena spends New Year's Eve with boyfriend, parents (PHOTO)",
        "Oprah Winfrey Network begins with 'Kidnapped' show",
        "Actor James Avery dead at 65",
        "The best dressed list of 2012 (Photos)",
        "Kate Gosselin dating: Gosselin reportedly lands millionaire Jeff Prescott",
        "LeAnn Rimes vacations in Cabo showing off side boob",
        "DiCaprio welcomes the New Year on a wild yacht ride with topless beauties",
        "Kaley Cuoco's pink wedding gown become a trend? 'Big Bang Theory' star marries",
        "Most Anticipated Films of 2015",
        "Hailey Glassman's friends reveal Hailey is afraid of Jon Gosselin",
        "Kim Kardashian dishes on biggest pregnancy craving, New Year's resolution",
        "Jon Gosselin's ex dating 'Real Housewives of New Jersey' son: report",
        "'Teen Mom': Gary Shirley says Amber Portwood won't regain custody of daughter",
        "Marvel news: Actress hints that 'S.H.I.E.L.D.' will not pull much from comics",
        "North Korea allows first Western movie to be aired: 'Bend it Like Beckham'",
        "Looney Tunes Super Stars: Pepe Le Pew Collection",
        "Jennifer Lopez in skin tight leotard at Times Square pictures and video",
        "Charlaine Harris squashed rumors of a 'True Blood' collaboration",
        "James Avery of 'The Fresh Prince of Bel-Air' passes away at 68",
        "10 Reasons the 'Wolf of Wall Street' is a Schmuck",
        "New footage from 'Toy Story 3' now online",
        "Kim Kardashian opens up about pregnancy",
        "The Fresh Prince Of Bel-Air actor, James Avery, dead at 65",
        "Kristen Stewart taps experience for 'Still Alice' role",
        "ABC's 'V': Jane Badler talks reprising old role, connection to Anna",
        "'New Year's Rockin' Eve': Justin Bieber joins forces with Carlos Santana (video)",
        "Housewives of Atlanta: Kim Zolciak opens New Year with Ciroc, Tiara",
        "NBC's 'Chuck': ringing in 2011 with spoiler dish",
        "A College Students Guide To Disney World: Hollywood Studios",
        "Ke$ha rides Santa Claus on 'New Year's Rockin' Eve' (photos)",
        "One Direction's Niall Horan wishes fans a good 2013: 'Happy New Year guys'",
        "'Teen Mom' Jenelle Evans posts bare baby bump photo online",
        "Demi Lovato talks drug addiction, bulimia, anorexia and bipolar disorder",
        "Kim Kardashian picks Justin Bieber photo shoot as her favorite from 2010",
        "Kaley Cuoco apology: Actress' feminism comment totally taken out of context",
        "Cage the Elephant New Year Eve's Concert Review",
        "Lady Gaga and 'giant black globe' ring in 2012 (photos)",
        "Demi Lovato performs 'Give Your Heart A Break' on New Year's Eve special (video)",
        "Jay-Z to compose 'The Great Gatsby' score",
        "Bill Maher celebrates 2012 by 'Tebowing' in a tree",
        "Film and television star James Avery dies",
        "2009 Entertainment farewells",
        "'Punk'd': Miley Cyrus, Justin Bieber among official guest hosts (video)",
        "Iron Man fan film 'Metal Head' with Paul Bettany sounding J.A.R.V.I.S.",
        "Box Office Report: Audiences Catch Up to Mission: Impossible",
        "Jazzlyn entertains at TGIM New Year's Eve Party in SW Florida",
        "Jenni Rivera finally laid to rest almost a month after fatal plane crash",
        "Daniel Radcliffe's Final Week of 'How to Succeed' Performances Breaks Record",
        "'The Bachelor' 2012: Ben Flajnik appears on 'New Year's Rockin' Eve'",
        "Samuel L. Jackson changes jobs: stage to screen and back in career changes",
        "Lady Gaga releases new mix of 'Do What U Want' featuring Christina Aguilera",
        "Kathy Griffin strips to underwear on CNN New Year's Eve show - VIDEO",
        "Jennifer Lopez steams up Times Square on a cold night in NYC for New Year's Eve (photos, video)",
        "'Chicago' casts reunite for winter premieres",
        "This weekend, 'The Woman in Black' haunts again in sequel 'The Angel of Death'",
        "What's in Gabrielle Thompson's closet?",
        "Just go in the studio and make hit records: Jimmie Haskell revisits Rick Nelson",
        "Bieber's new tattoo shows his love for Jesus and religion",
        "Miley Cyrus loves very gay fans in London, 'more open than the U.S.'",
        "Crystal Harris goes bridal pink for her New Year's Eve wedding to Hugh Hefner",
        "Dina Manzo's assistant says someone fans know is spreading lies about her",
        "Part 2: Lady Gaga exploits young gays and lesbians",
        "Ke$ha gets downright messy in new music video for 'Dirty Love'",
        "Gerald Anderson kissed the pop star Sarah Geronimo's forehead at Asap 2012",
        "Brian Dawe says Farrah Abraham hired him to be her boyfriend for TV"
      ],
      "description2taxonomy": {
        "explores celebrity health and lifestyle; specifically, the text delves into issues concerning well-being, fitness, diet, or personal choices of well-known personalities. For example, 'This Oscar-winning star reveals their secret to staying in top shape!'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=-1676047407553909580",
          "description": "explores celebrity health and lifestyle; specifically, the text delves into issues concerning well-being, fitness, diet, or personal choices of well-known personalities. For example, 'This Oscar-winning star reveals their secret to staying in top shape!'",
          "texts": [
            "Seven slim-down secrets of superstars, from Jennifer Aniston to Fergie",
            "Celebrity trainer unveils his new diet for shorter women on The View and GMA"
          ],
          "description2taxonomy": {}
        },
        "focuses on celebrity fashion and style; specifically, the text discusses clothing, accessories, or beauty choices of famous individuals at events or in everyday life. For example, 'The most stunning red carpet looks from this year's award season!'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=4373807233336555239",
          "description": "focuses on celebrity fashion and style; specifically, the text discusses clothing, accessories, or beauty choices of famous individuals at events or in everyday life. For example, 'The most stunning red carpet looks from this year's award season!'",
          "texts": [
            "Kim Kardashian's pre-new year's eve dress: Fashion hit or miss? (view photos and watch video)",
            "The best dressed list of 2012 (Photos)",
            "LeAnn Rimes vacations in Cabo showing off side boob",
            "Jennifer Lopez in skin tight leotard at Times Square pictures and video",
            "Kim Kardashian picks Justin Bieber photo shoot as her favorite from 2010",
            "Lady Gaga and 'giant black globe' ring in 2012 (photos)",
            "Jennifer Lopez steams up Times Square on a cold night in NYC for New Year's Eve (photos, video)",
            "What's in Gabrielle Thompson's closet?",
            "Crystal Harris goes bridal pink for her New Year's Eve wedding to Hugh Hefner"
          ],
          "description2taxonomy": {}
        },
        "discusses a celebrity's career change or new project; specifically, the text highlights new roles, albums, or ventures taken on by a celebrity. For example, 'You won't believe what this famous pop star is doing next!'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=-1508598791757758789",
          "description": "discusses a celebrity's career change or new project; specifically, the text highlights new roles, albums, or ventures taken on by a celebrity. For example, 'You won't believe what this famous pop star is doing next!'",
          "texts": [
            "Michael Buble announces first-ever shows in Dubai",
            "Kim Kardashian opens up about pregnancy",
            "Kristen Stewart taps experience for 'Still Alice' role",
            "'New Year's Rockin' Eve': Justin Bieber joins forces with Carlos Santana (video)",
            "Jay-Z to compose 'The Great Gatsby' score",
            "Daniel Radcliffe's Final Week of 'How to Succeed' Performances Breaks Record",
            "Samuel L. Jackson changes jobs: stage to screen and back in career changes",
            "Lady Gaga releases new mix of 'Do What U Want' featuring Christina Aguilera",
            "Bieber's new tattoo shows his love for Jesus and religion",
            "Crystal Harris goes bridal pink for her New Year's Eve wedding to Hugh Hefner",
            "Ke$ha gets downright messy in new music video for 'Dirty Love'"
          ],
          "description2taxonomy": {}
        },
        "involves entertainment industry events or award shows; specifically, the text outlines highlights, gossip, or notable moments from events within the entertainment industry. For example, 'You won't believe the drama that unfolded at last night's awards show!'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=7671003467756683975",
          "description": "involves entertainment industry events or award shows; specifically, the text outlines highlights, gossip, or notable moments from events within the entertainment industry. For example, 'You won't believe the drama that unfolded at last night's awards show!'",
          "texts": [
            "Ke$ha rides Santa Claus on 'New Year's Rockin' Eve' (photos)",
            "Demi Lovato performs 'Give Your Heart A Break' on New Year's Eve special (video)",
            "Gerald Anderson kissed the pop star Sarah Geronimo's forehead at Asap 2012"
          ],
          "description2taxonomy": {}
        },
        "centers on celebrity relationships or marriages; specifically, the text discusses a well-known individual's romantic relationships, breakups, or marriages. For example, 'This famous couple finally ties the knot after years of dating.'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=3833690184446847749",
          "description": "centers on celebrity relationships or marriages; specifically, the text discusses a well-known individual's romantic relationships, breakups, or marriages. For example, 'This famous couple finally ties the knot after years of dating.'",
          "texts": [
            "Hugh Hefner and Crystal Harris finally tie the knot",
            "Jersey Shore: Deena spends New Year's Eve with boyfriend, parents (PHOTO)",
            "Kate Gosselin dating: Gosselin reportedly lands millionaire Jeff Prescott",
            "Kaley Cuoco's pink wedding gown become a trend? 'Big Bang Theory' star marries",
            "Jon Gosselin's ex dating 'Real Housewives of New Jersey' son: report",
            "Crystal Harris goes bridal pink for her New Year's Eve wedding to Hugh Hefner"
          ],
          "description2taxonomy": {}
        },
        "shares celebrity interviews or quotes; specifically, the text contains a conversation with or statements from a famous person. For example, 'You won't believe what this actor just revealed in their candid interview.'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=-6800176569130280682",
          "description": "shares celebrity interviews or quotes; specifically, the text contains a conversation with or statements from a famous person. For example, 'You won't believe what this actor just revealed in their candid interview.'",
          "texts": [
            "The Mega-Fight Edition (Vol.VII): Oscar De La Hoya's Double Take",
            "Ke$ha talks 'Douchebag' on live TV: Ryan Seacrest left talking fast (video)",
            "DiCaprio welcomes the New Year on a wild yacht ride with topless beauties",
            "Hailey Glassman's friends reveal Hailey is afraid of Jon Gosselin",
            "Kim Kardashian dishes on biggest pregnancy craving, New Year's resolution",
            "Kim Kardashian opens up about pregnancy",
            "ABC's 'V': Jane Badler talks reprising old role, connection to Anna",
            "One Direction's Niall Horan wishes fans a good 2013: 'Happy New Year guys'",
            "Demi Lovato talks drug addiction, bulimia, anorexia and bipolar disorder",
            "Kim Kardashian picks Justin Bieber photo shoot as her favorite from 2010",
            "Kaley Cuoco apology: Actress' feminism comment totally taken out of context",
            "Just go in the studio and make hit records: Jimmie Haskell revisits Rick Nelson",
            "Miley Cyrus loves very gay fans in London, 'more open than the U.S.'",
            "Brian Dawe says Farrah Abraham hired him to be her boyfriend for TV"
          ],
          "description2taxonomy": {}
        },
        "concerns the passing or tributes of a celebrity; specifically, the text highlights the death, legacy, or memorials of a well-known individual. For example, 'Entertainment world mourns the loss of this legendary director.'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=-6795014589845065049",
          "description": "concerns the passing or tributes of a celebrity; specifically, the text highlights the death, legacy, or memorials of a well-known individual. For example, 'Entertainment world mourns the loss of this legendary director.'",
          "texts": [
            "Actor James Avery dead at 65",
            "James Avery of 'The Fresh Prince of Bel-Air' passes away at 68",
            "The Fresh Prince Of Bel-Air actor, James Avery, dead at 65",
            "Film and television star James Avery dies",
            "Jenni Rivera finally laid to rest almost a month after fatal plane crash"
          ],
          "description2taxonomy": {}
        },
        "centers around movie or TV news; specifically, the text provides information about new productions, casting, or upcoming events related to movies or television shows. For example, 'The highly anticipated sequel finally gets a release date!'": {
          "node_name": "root_id=8_node=-9110959279508980557_node=71520139564509131",
          "description": "centers around movie or TV news; specifically, the text provides information about new productions, casting, or upcoming events related to movies or television shows. For example, 'The highly anticipated sequel finally gets a release date!'",
          "texts": [
            "Jersey Shore: Deena spends New Year's Eve with boyfriend, parents (PHOTO)",
            "Most Anticipated Films of 2015",
            "'Teen Mom': Gary Shirley says Amber Portwood won't regain custody of daughter",
            "Marvel news: Actress hints that 'S.H.I.E.L.D.' will not pull much from comics",
            "New footage from 'Toy Story 3' now online",
            "ABC's 'V': Jane Badler talks reprising old role, connection to Anna",
            "'New Year's Rockin' Eve': Justin Bieber joins forces with Carlos Santana (video)",
            "Housewives of Atlanta: Kim Zolciak opens New Year with Ciroc, Tiara",
            "NBC's 'Chuck': ringing in 2011 with spoiler dish",
            "'Punk'd': Miley Cyrus, Justin Bieber among official guest hosts (video)",
            "Box Office Report: Audiences Catch Up to Mission: Impossible",
            "'The Bachelor' 2012: Ben Flajnik appears on 'New Year's Rockin' Eve'",
            "'Chicago' casts reunite for winter premieres",
            "This weekend, 'The Woman in Black' haunts again in sequel 'The Angel of Death'"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "regards food or cuisine; specifically, the text features recipes, food-related news, or culinary topics. For example, 'the ultimate 3-ingredient dessert you have to try tonight!'": {
      "node_name": "root_id=8_node=-7181667125248545094",
      "description": "regards food or cuisine; specifically, the text features recipes, food-related news, or culinary topics. For example, 'the ultimate 3-ingredient dessert you have to try tonight!'",
      "texts": [
        "The leap from vegetarian to vegan and a New Year's pot of beans",
        "Diet budget friendly; low fat blueberry bran muffins",
        "Au Bon Pain delights with new holiday menu",
        "Santa Cruz restaurant Kianti's 10th anniversary party with specials and prizes",
        "Delicious soup recipes: Italian sausage soup with pasta",
        "Hopping John: a New Year's Day tradition",
        "Book club food: 5 party appetizer ideas - stuffed mushrooms, deviled eggs, dip",
        "A good-luck dish for New Year's Day",
        "New Year's Day food traditions",
        "Post-holiday cabbage soup is high-fiber, down-to-earth fare",
        "Home-made Hearty Chili soup",
        "An alternative to hot spinach dip",
        "Bake biscuits for the perfect solution to left-over eggnog",
        "San Francisco Bay area good food heroes of 2012",
        "Get cooking in 2010: Portland ethnic cooking classes"
      ],
      "description2taxonomy": {}
    },
    "pertains to politics or social issues; specifically, the text addresses current events, political figures, or controversial subjects. For example, 'this shocking decision by the government sparks outrage among citizens!'": {
      "node_name": "root_id=8_node=4827820591559477715",
      "description": "pertains to politics or social issues; specifically, the text addresses current events, political figures, or controversial subjects. For example, 'this shocking decision by the government sparks outrage among citizens!'",
      "texts": [
        "Open carry handgun flipflop Wendy Davis won't go quietly into that good night",
        "Sarah Palin sparks fury with Facebook pictures of her son and dog",
        "IDF-Jewish-Muslim noise dispute in Hebron in West Bank",
        "Judge cites government missteps: Tosses Blackwater case",
        "Senate passes 'fiscal cliff' bill",
        "Foreclosure mediation act to help homeowners facing foreclosure",
        "Grassroots 2015: Arizona should model their Common Core fight after Oklahoma's",
        "Is Janet Napolitano up to the job? A cartoon!",
        "Freelancers tips as Obamacare hits 2 million",
        "Avigdor Lieberman indicted by Israeli court",
        "Cuccinelli backs down on changing law",
        "A tale of two Presidents",
        "Journalist found in contempt for calling court 'thieves' and 'basket of rotten apples'",
        "People wait in line to purchase marijuana legally in Colorado as stores opened",
        "The mugging of a Presidential candidate",
        "Hickenlooper debates living in Denver governor's mansion: WSJ",
        "2012 Palin panic hits MSNBC: ' I'm just praying that Sarah Palin goes away'",
        "Illinois lawmakers pondering gun ban in defiance of voters' will",
        "Deadly New Year stampede: 61 die in Ivory Coast",
        "Business & unemployment: Forbes says weak Obama & roll-backs key to hiring",
        "5 female teachers killed: Gunmen open fire in Pakistan",
        "Sean Hannity's television ratings plummeted since Obama won",
        "Liberals wish death on Rush Limbaugh",
        "Sex discrimination in the cabinet industry?",
        "Missouri DUI law may soon allow blood draws without a warrant",
        "Afghan suicide bomber update: CIA revenge, Afghan National Army, invited on Afghanistan base (video)",
        "American version of Girl With The Dragon Tattoo is being met with controversy",
        "Gay couple weds on top of a cake on a float in Tournament of Roses Parade",
        "Mecca is out, Karbala is in: Iraq tries to change direction of Muslim prayer",
        "ABC Honcho Issues Warning to Incoming House Republicans",
        "Part 2: Lady Gaga exploits young gays and lesbians",
        "Sotomayor Blocks Obamacare Mandate for Little Sisters of the Poor",
        "Bombing raises questions of concern"
      ],
      "description2taxonomy": {
        "touches on an economic topic; specifically, the text delves into subjects like taxes, the stock market, or other financial matters. For example, 'The dirty secret about the next financial collapse that they're not telling you!'": {
          "node_name": "root_id=8_node=4827820591559477715_node=1070698072634349480",
          "description": "touches on an economic topic; specifically, the text delves into subjects like taxes, the stock market, or other financial matters. For example, 'The dirty secret about the next financial collapse that they're not telling you!'",
          "texts": [
            "Senate passes 'fiscal cliff' bill",
            "Business & unemployment: Forbes says weak Obama & roll-backs key to hiring"
          ],
          "description2taxonomy": {}
        },
        "concerns social justice issues; specifically, the text sheds light on matters of inequality, discrimination, or human rights. For example, 'this viral video exposes a hard truth that everyone needs to see!'": {
          "node_name": "root_id=8_node=4827820591559477715_node=-3781553216547579685",
          "description": "concerns social justice issues; specifically, the text sheds light on matters of inequality, discrimination, or human rights. For example, 'this viral video exposes a hard truth that everyone needs to see!'",
          "texts": [
            "Sex discrimination in the cabinet industry?",
            "Gay couple weds on top of a cake on a float in Tournament of Roses Parade"
          ],
          "description2taxonomy": {}
        },
        "discusses legislation or policy; specifically, the text addresses new laws, regulations, or policy changes. For example, 'what the government just passed will shock you!'": {
          "node_name": "root_id=8_node=4827820591559477715_node=2901316696159405806",
          "description": "discusses legislation or policy; specifically, the text addresses new laws, regulations, or policy changes. For example, 'what the government just passed will shock you!'",
          "texts": [
            "Senate passes 'fiscal cliff' bill",
            "Foreclosure mediation act to help homeowners facing foreclosure",
            "Cuccinelli backs down on changing law",
            "People wait in line to purchase marijuana legally in Colorado as stores opened",
            "Illinois lawmakers pondering gun ban in defiance of voters' will",
            "Missouri DUI law may soon allow blood draws without a warrant",
            "Sotomayor Blocks Obamacare Mandate for Little Sisters of the Poor"
          ],
          "description2taxonomy": {}
        },
        "examines a current event or news story; specifically, the text provides insight or a unique angle on a recent happening. For example, 'what the media isn't telling you about this shocking event that's changing everything.'": {
          "node_name": "root_id=8_node=4827820591559477715_node=-3540099427710421136",
          "description": "examines a current event or news story; specifically, the text provides insight or a unique angle on a recent happening. For example, 'what the media isn't telling you about this shocking event that's changing everything.'",
          "texts": [
            "Gay couple weds on top of a cake on a float in Tournament of Roses Parade",
            "Mecca is out, Karbala is in: Iraq tries to change direction of Muslim prayer"
          ],
          "description2taxonomy": {}
        },
        "involves instances of violence or tragedy; specifically, the text reports on events such as attacks, accidents, or other forms of violence that shock and capture attention. For example, 'The tragic event that has everyone talking!'": {
          "node_name": "root_id=8_node=4827820591559477715_node=7288689243951404683",
          "description": "involves instances of violence or tragedy; specifically, the text reports on events such as attacks, accidents, or other forms of violence that shock and capture attention. For example, 'The tragic event that has everyone talking!'",
          "texts": [
            "The mugging of a Presidential candidate",
            "Deadly New Year stampede: 61 die in Ivory Coast",
            "5 female teachers killed: Gunmen open fire in Pakistan",
            "Afghan suicide bomber update: CIA revenge, Afghan National Army, invited on Afghanistan base (video)",
            "Bombing raises questions of concern"
          ],
          "description2taxonomy": {}
        },
        "pertains to public figures or celebrities; specifically, the text revolves around the actions, opinions, or scandals of prominent individuals. For example, 'famous actor under fire for controversial remarks'": {
          "node_name": "root_id=8_node=4827820591559477715_node=-1634795465916139948",
          "description": "pertains to public figures or celebrities; specifically, the text revolves around the actions, opinions, or scandals of prominent individuals. For example, 'famous actor under fire for controversial remarks'",
          "texts": [
            "Sarah Palin sparks fury with Facebook pictures of her son and dog",
            "Avigdor Lieberman indicted by Israeli court",
            "A tale of two Presidents",
            "The mugging of a Presidential candidate",
            "Hickenlooper debates living in Denver governor's mansion: WSJ",
            "2012 Palin panic hits MSNBC: ' I'm just praying that Sarah Palin goes away'",
            "Sean Hannity's television ratings plummeted since Obama won",
            "Liberals wish death on Rush Limbaugh",
            "American version of Girl With The Dragon Tattoo is being met with controversy",
            "Part 2: Lady Gaga exploits young gays and lesbians"
          ],
          "description2taxonomy": {}
        },
        "concerns education issues; specifically, the text explores subjects like standardized testing, school funding, or curriculum debates. For example, 'The fight to end Common Core in our schools'": {
          "node_name": "root_id=8_node=4827820591559477715_node=2553467163609574869",
          "description": "concerns education issues; specifically, the text explores subjects like standardized testing, school funding, or curriculum debates. For example, 'The fight to end Common Core in our schools'",
          "texts": [
            "Grassroots 2015: Arizona should model their Common Core fight after Oklahoma's"
          ],
          "description2taxonomy": {}
        },
        "touches on legal matters or court cases; specifically, the text concerns lawsuits, legal proceedings, or interpretations of the law. For example, 'landmark Supreme Court decision divides the nation'": {
          "node_name": "root_id=8_node=4827820591559477715_node=6981525065726563957",
          "description": "touches on legal matters or court cases; specifically, the text concerns lawsuits, legal proceedings, or interpretations of the law. For example, 'landmark Supreme Court decision divides the nation'",
          "texts": [
            "Judge cites government missteps: Tosses Blackwater case",
            "Avigdor Lieberman indicted by Israeli court",
            "Journalist found in contempt for calling court 'thieves' and 'basket of rotten apples'",
            "Missouri DUI law may soon allow blood draws without a warrant",
            "Sotomayor Blocks Obamacare Mandate for Little Sisters of the Poor"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "focuses on health or wellness; specifically, the text discusses topics related to physical, mental, or emotional well-being. For example, 'Lose weight fast with this one simple trick!'": {
      "node_name": "root_id=8_node=-4100492848033888541",
      "description": "focuses on health or wellness; specifically, the text discusses topics related to physical, mental, or emotional well-being. For example, 'Lose weight fast with this one simple trick!'",
      "texts": [
        "Eating healthy is rewarding at I Dream of Falafel Chicago",
        "Seven slim-down secrets of superstars, from Jennifer Aniston to Fergie",
        "Celebrity trainer unveils his new diet for shorter women on The View and GMA",
        "Home Hangover Remedies",
        "Make a resolution that works",
        "Energy healing sessions available every Sunday at Unity South Atlanta Church",
        "Encouraging workplace wellness",
        "Finding a yoga teacher",
        "Developing discipline for personal growth",
        "Demi Lovato talks drug addiction, bulimia, anorexia and bipolar disorder",
        "Is your New Year's Day resolution to lose weight? Seven easy tips for weight loss",
        "How to avoid failing from reaching your New Year Resolution goals",
        "Americans save $530 per year gardening while improving health",
        "Relaxing with a mud pack and (a glass)or mug of mulled cider, does wonders",
        "Vitamin E shows promise in slowing progression of Alzheimer's in some patients",
        "Recognizing and living with Seasonal Affective Disorder (SAD)"
      ],
      "description2taxonomy": {}
    },
    "concerns financial matters or wealth; specifically, the text addresses topics such as money, investments, or financial security. For example, 'How to become a millionaire in 5 easy steps'": {
      "node_name": "root_id=8_node=3864057568841546096",
      "description": "concerns financial matters or wealth; specifically, the text addresses topics such as money, investments, or financial security. For example, 'How to become a millionaire in 5 easy steps'",
      "texts": [
        "Ohio's incoming Gov. looking to cash in on Marcellus Shale",
        "Local companies worth investing in: The 2010 year in review",
        "Dad $130 million lawsuit adoption: Alleged fraud over birth father's rights",
        "Kate Gosselin dating: Gosselin reportedly lands millionaire Jeff Prescott",
        "Senate passes 'fiscal cliff' bill",
        "Foreclosure mediation act to help homeowners facing foreclosure",
        "Makeover your marriage and your budget",
        "3 content ideas real estate agents can use to blog and drive traffic",
        "Prized Ferrari collection to be sold at arizona auction",
        "Mega Millions lottery jackpot at $30 million",
        "Dominion VA Power to increase rates while Sierra seeks new payment scheme",
        "Vintage Barbie clothing lot sells for $449 on eBay"
      ],
      "description2taxonomy": {}
    },
    "deals with sports or athletes; specifically, the text contains updates, predictions, or controversies in the world of sports. For example, 'Discover the unbelievable mistake that cost this team the championship!'": {
      "node_name": "root_id=8_node=-7488589552689674585",
      "description": "deals with sports or athletes; specifically, the text contains updates, predictions, or controversies in the world of sports. For example, 'Discover the unbelievable mistake that cost this team the championship!'",
      "texts": [
        "The Mega-Fight Edition (Vol.VII): Oscar De La Hoya's Double Take",
        "Rose Bowl 2015: Oregon vs. Florida State live stream & TV game time",
        "Cross country skiing comes to the Midwest update",
        "2012 NFL Postseason schedule: Early Las Vegas odds",
        "Dayton faces Lobos in The Pit",
        "Bruins upset the Flyers at Fenway",
        "Utah Jazz head coach Quin Snyder gives his players a death stare, they win by 6",
        "New Year's Day 2015 bowl schedule & odds; Cotton, Sugar, Rose Bowl headline day",
        "Fiesta Bowl 2014 TV coverage time, live stream for UFC vs. Baylor",
        "NFL coaches fired: Dallas owner refuses to address assistants",
        "Colts heart too much for Texans (Photos)",
        "Women's 4x100-meter freestyle relay Olympic medal winners",
        "Humphries named Calgary Sports Examiner athlete of the year",
        "Eagles may talk to three Falcons assistants before wooing Kelly",
        "Is Kelly Johnson Arizona's long-term solution at second base?",
        "ACC women's hoops season opens with explosion Monday night",
        "NASCAR: Five 2014 Sprint Cup Series Predictions",
        "Controversial goal sends Mariners over Perth",
        "Ohio State quarterback Braxton Miller could transfer to Florida State",
        "Marquette upends Villanova, 81-77, in Big East opener",
        "Lee's overtime tally gives B-Sens much needed divisional win",
        "Bill Maher celebrates 2012 by 'Tebowing' in a tree",
        "LeBron James sidelined two weeks with pair of injuries",
        "Baltimore Ravens hope to avoid Peyton Manning and the Indianapolis Colts",
        "Remaining game schedule set for World Junior Championship",
        "KC Chiefs/Denver Broncos NFL Week 17: The NFL wants Tebow in the playoffs",
        "Big second half sends Spartans over UTSA Basketball",
        "NFL rumors: Andy Reid will be named next Arizona Cardinals coach",
        "Penn State leads after Day One at 2012 Southern Scuffle with nine semifinalists",
        "Rose Bowl predictions 2014: Experts split on Stanford vs. Michigan St. Rose Bowl",
        "Chase Vicaire captures male athlete of the week",
        "Mike Leach, fired Texas Tech coach update, offers new story on James controversy",
        "Marquette edges Connecticut in overtime to begin conference play",
        "Maine Red Claws win their 10th game by beating the Erie Bayhawks",
        "2013-14 NFL Playoffs: Latest odds and news",
        "Michael Phelps and girlfriend split up; relationship wasn't going anywhere",
        "Floyd Mayweather's Plan B: Dismantling all Hatttons",
        "NFL coaches fired: Top choices to replace departed coaches"
      ],
      "description2taxonomy": {
        "features athlete achievements; specifically, the text showcases individual or team accomplishments, records, or awards. For example, 'This athlete just broke the all-time record - find out who it is!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=3783644691664986286",
          "description": "features athlete achievements; specifically, the text showcases individual or team accomplishments, records, or awards. For example, 'This athlete just broke the all-time record - find out who it is!'",
          "texts": [
            "Women's 4x100-meter freestyle relay Olympic medal winners",
            "Humphries named Calgary Sports Examiner athlete of the year",
            "Chase Vicaire captures male athlete of the week"
          ],
          "description2taxonomy": {}
        },
        "explores coaching decisions; specifically, the text examines choices made by coaches that have significant consequences or generate discussion. For example, 'Why this coach's decision to bench their star player has everyone talking!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=3680225310248541889",
          "description": "explores coaching decisions; specifically, the text examines choices made by coaches that have significant consequences or generate discussion. For example, 'Why this coach's decision to bench their star player has everyone talking!'",
          "texts": [],
          "description2taxonomy": {}
        },
        "emphasizes player performance; specifically, the text discusses individual athletes and their abilities, achievements, or controversies. For example, 'Find out the surprising secret behind this athlete's incredible success!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=-4690023184605557546",
          "description": "emphasizes player performance; specifically, the text discusses individual athletes and their abilities, achievements, or controversies. For example, 'Find out the surprising secret behind this athlete's incredible success!'",
          "texts": [
            "The Mega-Fight Edition (Vol.VII): Oscar De La Hoya's Double Take",
            "Ohio State quarterback Braxton Miller could transfer to Florida State",
            "LeBron James sidelined two weeks with pair of injuries",
            "Chase Vicaire captures male athlete of the week",
            "Floyd Mayweather's Plan B: Dismantling all Hatttons"
          ],
          "description2taxonomy": {}
        },
        "covers sports events and schedules; specifically, the text provides information about upcoming games, tournaments, or sports-related activities. For example, 'Get ready for the most anticipated sports event of the year!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=-1572648164694413728",
          "description": "covers sports events and schedules; specifically, the text provides information about upcoming games, tournaments, or sports-related activities. For example, 'Get ready for the most anticipated sports event of the year!'",
          "texts": [
            "Rose Bowl 2015: Oregon vs. Florida State live stream & TV game time",
            "2012 NFL Postseason schedule: Early Las Vegas odds",
            "Dayton faces Lobos in The Pit",
            "New Year's Day 2015 bowl schedule & odds; Cotton, Sugar, Rose Bowl headline day",
            "Fiesta Bowl 2014 TV coverage time, live stream for UFC vs. Baylor",
            "ACC women's hoops season opens with explosion Monday night",
            "NASCAR: Five 2014 Sprint Cup Series Predictions",
            "Remaining game schedule set for World Junior Championship",
            "Rose Bowl predictions 2014: Experts split on Stanford vs. Michigan St. Rose Bowl",
            "2013-14 NFL Playoffs: Latest odds and news"
          ],
          "description2taxonomy": {}
        },
        "covers athlete personal lives; specifically, the text delves into the relationships, breakups, or off-field activities of sports figures. For example, 'You won't believe this athlete's secret past!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=5596482437018049149",
          "description": "covers athlete personal lives; specifically, the text delves into the relationships, breakups, or off-field activities of sports figures. For example, 'You won't believe this athlete's secret past!'",
          "texts": [
            "Michael Phelps and girlfriend split up; relationship wasn't going anywhere"
          ],
          "description2taxonomy": {}
        },
        "focuses on game results or outcomes; specifically, the text highlights scores, wins, or losses in a specific sporting event. For example, 'You won't believe who took home the trophy in last night's nail-biting match!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=-449255672834503913",
          "description": "focuses on game results or outcomes; specifically, the text highlights scores, wins, or losses in a specific sporting event. For example, 'You won't believe who took home the trophy in last night's nail-biting match!'",
          "texts": [
            "Bruins upset the Flyers at Fenway",
            "Colts heart too much for Texans (Photos)",
            "Controversial goal sends Mariners over Perth",
            "Marquette upends Villanova, 81-77, in Big East opener",
            "Lee's overtime tally gives B-Sens much needed divisional win",
            "Big second half sends Spartans over UTSA Basketball",
            "Penn State leads after Day One at 2012 Southern Scuffle with nine semifinalists",
            "Marquette edges Connecticut in overtime to begin conference play",
            "Maine Red Claws win their 10th game by beating the Erie Bayhawks"
          ],
          "description2taxonomy": {}
        },
        "focuses on coaching changes or staff developments; specifically, the text discusses coaching hires, fires, or rumors affecting a team's leadership. For example, 'This famous coach just got fired - find out who might replace him!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=-6475677842379809626",
          "description": "focuses on coaching changes or staff developments; specifically, the text discusses coaching hires, fires, or rumors affecting a team's leadership. For example, 'This famous coach just got fired - find out who might replace him!'",
          "texts": [
            "NFL coaches fired: Dallas owner refuses to address assistants",
            "NFL rumors: Andy Reid will be named next Arizona Cardinals coach",
            "Mike Leach, fired Texas Tech coach update, offers new story on James controversy",
            "NFL coaches fired: Top choices to replace departed coaches"
          ],
          "description2taxonomy": {}
        },
        "spotlights fan behavior or reactions; specifically, the text highlights the actions, celebrations, or opinions of sports fans. For example, 'Fan outrage over this controversial decision cannot be ignored!'": {
          "node_name": "root_id=8_node=-7488589552689674585_node=-6859104487130381259",
          "description": "spotlights fan behavior or reactions; specifically, the text highlights the actions, celebrations, or opinions of sports fans. For example, 'Fan outrage over this controversial decision cannot be ignored!'",
          "texts": [
            "Bill Maher celebrates 2012 by 'Tebowing' in a tree"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "relates to travel or leisure; specifically, the text provides information on travel destinations, activities, or accommodations. For example, 'Discover the hidden paradise that everyone's talking about!'": {
      "node_name": "root_id=8_node=-23385183621598894",
      "description": "relates to travel or leisure; specifically, the text provides information on travel destinations, activities, or accommodations. For example, 'Discover the hidden paradise that everyone's talking about!'",
      "texts": [
        "Michael Buble announces first-ever shows in Dubai",
        "Fishing on the largest pier in the Gulf of Mexico Gulf Shores Alabama (Photos)",
        "Marion Square: A great place to start for budget friendly fun",
        "10 Ski areas close to Boston",
        "Exploring Northern Napa Valley",
        "A College Students Guide To Disney World: Hollywood Studios",
        "Review: Showboat Branson Belle for amazing dinner and show in Branson",
        "Boca Grande's off-season fishing - Boca Grande, Florida",
        "Spend some quality family time this New Year at Manhattan Beach Marriott",
        "Great days for a Gunstock Getaway",
        "Come see what you are missing in Portland, Oregon (Photos)",
        "I LOVE NY Bonus Weekends at Gore Mountain"
      ],
      "description2taxonomy": {}
    }
  }
}