{
  "node_name": "root_id=0",
  "description": "root",
  "texts": [
    "The summary is concise but could include information about the poster knowing the dogs are just playing and will react if they become aggressive and wants to know how to handle things with Max's dad. ",
    "The summary could include information about the roommate being worried about not having time for him and making uncomfortable comments about hoping to find a man just like him. ",
    "This is an accurate account of what was in the post.",
    "The summary should include information about how her snap score keeps increasing and he is wondering if she is ignoring him as he has recently developed feelings for her. ",
    "The summary is clear and concise and provides enough information for readers to be able to provide feedback or advice. ",
    "The summary should pose the question the user is asking about how to initiate a relationship.",
    "The summary kind of addresses the dilemma but only includes some of the variables in the situation. The man is essentially wondering if her personality is enough to continue dating her. He also feels her attractiveness would increase if she lost a few pounds but knows he can not tell her that. He is seeking advice about what he should no about the situation.",
    "The summary is concise and includes the pertinent information needed for readers to respond. ",
    "The summary should also include how he told her he fell for her body, not someone else’s.",
    "The summary left out details about the girl wanting to be carefree during a Vegas trip.",
    "The summary does a good job of covering the main points made in the post.",
    "The post is concise and to the point and includes the InfoMation necessary to offer feedback or advice. ",
    "The summary should include details about what the boyfriend’s definition of “love” means.",
    "Boyfriend and girlfriend live together and his mother wouldn't allow her to move his things and accused her of stealing money for a car.",
    "The summary is concise and provides enough detail for people to offer the poster feedback or advice. ",
    "The summary does a good job of summing up the main points of the problem.",
    "The summary should also include how she is contemplating getting back with her ex but fears she will get bored of him again as well.",
    "The summary is really short and concise, but could include some background details about being abused by the boyfriend and that he keeps using drugs. ",
    "The summary states that they are already in a long distance relationship but the post says that they are going to try one and are looking for advice on how to prepare for it.",
    "This is an accurate summary of the post.",
    "The summary should include she doesn't know if this is worth bringing up and doesn't want to fish for compliments, but she is feeling lonely and depressed in the relationship. ",
    "The summary should be rewritten so it flows a little better.",
    "She doesn't take his jokes well.",
    "The summary is clear and concise and provides the main points of the post. ",
    "The summary does a good job of covering the main points made in the post.",
    "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
    "The summary is a good representation of the main points made in the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary should also include that he met a new girl after he got over his ex breaking things off.",
    "He thinks the chemistry is undeniable but may have misread the situation.",
    "The summary is clear and concise and provides the information required to offer feedback or advice. ",
    "The summary does a good job of summing up the main points of the post.",
    "The summary could be rewritten to flow a bit better.",
    "He was tired of the drama and she's not sure she wants to be with him long term.",
    "The summary should include she is asking for advice on how she can help him move forward from being cheated on. ",
    "The summary does a good job of covering the main points made in the post.",
    "The summary should include she is worried about getting bad grades because all she can focus on is him, but it's their last year of high school and grades do matter. ",
    "The summary could be written a bit more fluently.",
    "The summary seems to only cover half of the backstory and does not cover the author's current dilemma. Realizing that her parents weren't going to let her date, he decided to move on but he did not his best friend and she found out through a Facebook relationship status update. He has been thinking about her lately but does not know whether to contact her because his old feelings for her might resurface which would jeopardize his current relationship.",
    "The summary should include that the poster is hoping to remain friends with her and show her why she fell in love with him in the first place as he still loves her. ",
    "The summary is not an accurate summation of the post",
    "The summary is concise and to the point and provides enough detail to be able to provide advice or feedback to the poster. ",
    "The summary should include how the user feels like they are not entitled to be upset about the breakup because they were the one who initiated it.",
    "The summary should include that she has a boyfriend, and he is scared of telling her that he likes her and being rejected. ",
    "The summary doesn’t include details about how they are back together but he seems to be interested in looking at other women online.",
    "The summary does not mention that the poster has a crush on the girl.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary should include that he is unsure if she wants to see him or if these are just excuses for not seeing him. ",
    "The summary is strong and covers all the key points from the post. ",
    "The summary should also include how the user is in a long term relationship and it has become very stressful.",
    "The summary should include information about the poster wanting to work on the relationship but has set boundaries and will leave if she doesn't hold up her side of the deal. ",
    "The summary should also include how the boyfriend seemingly ignores her on weekends and she just wants a quick check in text.",
    "The summary is strong and covers all the key points from the post. ",
    "The summary should include that he confessed his feelings but they weren’t reciprocated.",
    "It's cut off",
    "The summary is not accurate as the poster is not leaving their wife. He is leaving his job and fling, but not his wife. ",
    "The summary doesn't point out that M also pressured C into taking advanced courses, and C has also become distant from the author. ",
    "The summary should include how she still has feelings for him but the timing has never been right.",
    "She's got medical issues",
    "Person B would be the author, f22, not m21. ",
    "The summary is lacking in context.",
    "The summary should also include how they haven’t been able to find joy in anything since their wife kicked them out.",
    "The summary should include that the poster thinks he might fall into the polyamory category as he has felt this way with both serious relationships he's been in. ",
    "The summary covers the main question poised in the post.",
    "The summary is strong and covers all the key points from the post.",
    "The summary says that the friends don’t want want them to attend but that is more the author’s assumption. In the post it states that the girls told the user that it was not a requirement to attend meetings.",
    "The summary does not mention that recently they have been getting into a lot of fights over stupid things.",
    "The summary is a good representation of the main points made in the post.",
    "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
    "The summary adequately covers the main points made in the post.",
    "The summary is inaccurate about the amount of the time that the poster and his girlfriend have been fighting in their relationship.",
    "The summary doesn't indicate the the author is split between breaking up now, or waiting and enjoying the time they have together. ",
    "The summary should also mention how he is also starting to neglect spending time with her as well.",
    "The post doesn't mention weeks going by. ",
    "The summary does a good job of covering the main points made in the post.",
    "The summary doesn't indicate that the baby's father will be released from prison soon, and that the author wouldn't trust him with the baby due to his history, and fears him trying to manipulate her. ",
    "The summary could be rewritten with a few extra words that help paint the picture of the situation.",
    "I think this should include they feel like they are holding her back, but don't want to break up.",
    "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
    "The summary is clear and concise and contains the main points of the post. ",
    "The summary does not include details about how they are second guessing their marriage and how they keep thinking about the relationship they had with their ex.",
    "The summary is a good representation of the main points made in the post.",
    "I think this could include that they are living on the west coast, so the readers know how far 'east' is.",
    "The summary adequately covers the main points made in the post.",
    "I think this should include that they found them on Facebook, but didn't know if that was creepy.",
    "The post indicates that the author believes his girlfriend lied but doesn't explicitly state so, as he himself in unsure if she did. ",
    "The summary should mention that she can pay for her own ring but is worried he will feel emasculated by that.",
    "This is a great summary and the only thing I would add is that she's upset he lied before.",
    "The summary doesn't mention that the other girl is the younger sister of one of the authors friends. ",
    "The summary should mention that they have plans to go see a movie together too.",
    "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
    "This could include behavior details - that she was super excited but that faded away.",
    "The summary does a good job of covering the main points made in the post.",
    "This is good but can include that they drink for social anxiety but that's not a good solution.",
    "The summary left out details about he just getting out of a relationship and not being ready for something so committed.",
    "The summary is strong and covers all the key points from the post.",
    "The summary misses some of the main points of the post.",
    "This needs to include more context, like how she started a drunk argument and he isn't talking to her.",
    "The summary should mention that he may think it was her who did something mean.",
    "The summary is a good representation of the main points made in the post.",
    "The summary does a good job of summing up the main points of the post.",
    "This could include that he felt like he texted her too early, and that she hasn't responded.",
    "I think this should include that he ignores her texts and takes their relationship too seriously.",
    "The summary lacks some important details.",
    "This covers all of the points made in the post",
    "This isn't really accurate - both girlfriends broke up with him on both occasions. ",
    "The summary does not mention that the poster is wondering if her boyfriend is sleeping with his ex again",
    "The summary should also mention how the guy took it upon himself to get her phone number.",
    "This is good but can include he's looking for advice on if he should tell her or take it slow.\r\n",
    "This covers all of the main points made in the post.",
    "The summary is partially inaccurate; it is not true that the poster's boyfriend's new career is costing them money they don't have.",
    "This is accurate and it covers all of the main points.",
    "The summary does a good job of summing up the main points of the post.",
    "This is an acccurate account of what was written in the post",
    "This is missing key information, like the fear the author has of damaging their career.",
    "The summary should also include details about how they feel they are regressing in the process of trying to get over their ex.",
    "The summary does a good job of summing up the main points of the post.",
    "This covers the main point in the post",
    "The summary should also include how they will be long distance from each other while attending school.",
    "The summary should include information about him sharing he has anxiety and he was paranoid and that's why he broke up with her. ",
    "The summary is a good representation of the main points made in the post.",
    "The summary is not exactly accurate; the wife is not feeling down at the moment; she states that whenever she is upset about something, her husband is dismissive of her feelings.",
    "The summary adequately covers the main points made in the post.",
    "The summary is not at all accurate.",
    "The summary does a good job of covering the main points made in the post.",
    "We are all currently single and looking for new roommates is false. Also the post is very vague",
    "The summary is strong and covers all the key points from the post. ",
    "The summary could be written more fluently and in a complete sentence.",
    "The summary is too vague.",
    "The summary is inaccurate.",
    "The summary does not mention that they are wondering if they should pay someone to decorate the house because of this.",
    "The summary left out information on how the hookup wanted to be exclusive but she turned him down as she wasn’t ready so he started to distance himself.",
    "The summary does not mention that the partner does not want to have children while the individual does.",
    "Male and female have been on and off again over 10 years and are now friends with benefits.",
    "The summary should include that it’s also a small town so the entire townspeople are giving them mixed advice.",
    "The summary is concise and to the point and contains enough information to be able to provide feedback or advice. ",
    "The summary states that the woman is unsure if the man wants to be just friends or not but it’s the man who’s not sure what the woman wants.",
    "The summary is clear and concise and provides enough detail for the readers to offer advice or feedback. ",
    "The post stated that the friend kissed the girlfriend but she didn’t kiss him back and the summary states that he girlfriend kissed the boy.",
    "The summary is concise and to the point and contains enough info for readers to offer feedback or advice. ",
    "Doesn't state sexually",
    "The sentence structure in the summary feels too simplistic.",
    "The summary states that the user’s parents don’t like their boyfriend but the post never said anything of the sort.",
    "The summary is a good representation of the main points made in the post.",
    "The summary does not mention that the poster is freaking out about the fact that his girlfriend is going to be around his family on a regular basis.",
    "Is constantly thinking of ways to check if he is cheating-this isn't in the post",
    "The second person sentence feels odd in the context of a summary of the post.",
    "The summary should include he was sending out resumes for new jobs but has not stopped due to liking this girl. ",
    "She asked him to a movie but drug friends along.",
    "The summary is a little too vague.",
    "The summary left out details about the girl having a boyfriend and that he is unsure if he should wait for her to break up with him or just move on.",
    "The summary is clear and concise and provides enough detail to be able to offer advice. ",
    "The summary does a good job of summing up the main point of the post.",
    "The summary should also include that they were never exclusive.",
    "The summary is clear and concise and provides enough context for readers to be able to offer support or advice. ",
    "The summary should include that she is paying all the bills while he is saving for their future. ",
    "The summary could include details about how he originally had a crush on her but put aside those feelings and just became close friends.",
    "They agreed to be exclusive.",
    "The summary should include that the father is unsure if he should let things happen or delay a wedding because his son just turned 18 recently.",
    "The summary is a good representation of the main points made in the post.",
    "The summary says that the woman is being separated due to geographical reasons but it’s really more because he is moving to get away from her family.",
    "He never really states that she is great but they had a great time.",
    "The summary doesn’t need to include the ages and genders in the brackets.",
    "She's worried he may change his mind about her.",
    "He made a promise and she has hypoplasia",
    "The summary is strong and covers all the key points from the post. ",
    "The summary is strong but would be better phrased if the question was \"Are these thoughts ok and should I bring them up?\" ",
    "Girl lives over 4 hours away",
    "The summary misses the details (that the author saw herself forced to break up with her boyfriend, but has seen other couples get back together) ",
    "He wants the thrill from meeting  someone in real life.",
    "They're aren't currently in a long distance relationship",
    "He finds it disrespectful.",
    "The summary doesn't mention that the friend broke ties with everyone due to being in an toxic controlling relationship .",
    "Summary left out the incidence that happened and that the author needed advice",
    "The summary doesn't mention that she specifically wants to be able to move out as neither her not the author make enough.",
    "Man said something about her family",
    "The summary is strong but could also mention that the author isn't socially incompetent, just doesn't know where to start. ",
    "Both girls aren't looking for relationships either.",
    "He told her when he was drunk. He's think of a collage of hidden I love you's and wants to know what people think",
    "The post never states that the woman became a \"completely different person\" after they started dating. ",
    "The summary is lacking in detail (the freaks out irrationally whenever he sees the friend text the author). ",
    "Dating for 2 months, doesn't get fuzzy feeling instead of feeling super strongly",
    "The summary doesn't mention that the friends and family think the author would make her happier than her fiancé does. ",
    "She lives far away and can't be there with him.",
    "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
    "I don't have an issue with this summary",
    "The summary doesn't indicate the authors PUA beliefs or that he treats his girlfriend poorly deliberately. ",
    "The summary should mention that the author is looking for advice on what to do. ",
    "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
    "The summary is strong and covers all the key points from the post. ",
    "The summary should mention that the date was with a group of friends. ",
    "The summary doesn't mention that the guys sex offender status comes from a non serious offense at age 18 with a 16 year old. ",
    "The summary should mention that they are compatible. ",
    "The summary is strong and covers all the key points of the post. ",
    "The summary should mention that the boyfriend used to seem extremely responsible. ",
    "The summary should mention that the author wants to know why potential partners keep passing him over.",
    "The summary should include the author's question about bowing out of the wedding. ",
    "Husband has given veto power is a confusing statement. ",
    "The woman is unsure when to wed not so much the man. ",
    "The summary should mention that the GF hooked up with most of her guy friends in the past.",
    "The summary should mention that the author blocked his ex to avoid all contact. ",
    "The summary incorrectly identifies the author as female when it's a male. ",
    "The summary should mention that the author's mental illness has been diagnosed. ",
    "The summary should mention that the author has a whole list of superficial reasons to breakup with his girlfriend",
    "The summary doesn't state anything about their relationship beyond sex.",
    "The summary doesn't mention that the speaker has no respect for the father.",
    "The last sentence is unclear and hard to follow.",
    "This could be rewritten to make it flow a little better.",
    "The summary should also add that he really likes the friend relationship he has with her now too.",
    "This summary adequately covers the main points made in the post.",
    "The summary says that the couple is struggling but in the post it’s just the user that seems to be struggling with the idea of Skype flirting being considered cheating or not.",
    "The summary left out how his sister kept interjecting opinions where they didn’t belong as well.",
    "The summary leaves out details regarding the user’s fears that she will never talk to the guy again.",
    "The summary left out the main complaint in the post which was about how the guys only talk about videogames and they get bored very quickly.",
    "The summary is a good representation of the main points made in the post.",
    "The summary should also include that she always talked to him like a friend and the crush was more of him enjoying her energy.",
    "The summary should mention that the user participated in that particular activity when he was only into his current relationship for a month.",
    "The summary is a good representation of the main points made in the post.",
    "The summary should mention that the young kid wants to play their Xbox since they let him in before.",
    "The summary is not exactly an accurate summation of the post.",
    "The summary adequately covers the main points made in the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is misleading because it says that her boyfriend sent a nude to her boss but the nude was actually sent to the girlfriend, the boss just happened to see it pop up on her phone.",
    "The summary is a little too vague.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary covers the main question that was posed in the post.",
    "The summary misses some of the important points of the post.",
    "The summary is not accurate.",
    "The summary leaves out all the details about financing on a tight budget for the trip which was the main reason for the post.",
    "The summary should include details about how she never wants to text or talk to him and she keeps saying she’ll be by to see him but never shows up.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does not mention that he feels guilty about wanting to break up with her.",
    "The summary should also include how she was treated poorly for many years and they even had a break in the middle of their relationship.",
    "The summary is too vague.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is inaccurate; the poster is not considering breaking up with her partner.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does not touch on some of the main points of the post.",
    "This summary is a good representation of the main points made in the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is too vague.",
    "The summary should also mention how they are worried about spending time at home for Christmas because of it.",
    "The summary is concise and to the point and provides enough detail to be able to offer support or advice.",
    "The tone of the summary feels a little odd.",
    "The summary should include her parents are more easy going than his last girlfriends parents.",
    "It should be mentioned that her husband half jokingly suggests she’s cheating. ",
    "The summary is a little disjointed.",
    "The summary is a good representation of the main points presented in the post.",
    "The summary is not very coherent.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of covering the important points in the post.",
    "The summary should be split into two different sentences so that the main points don’t muddle together.",
    "The post is concise and includes the info necessary to provide feedback or advise.",
    "The summary is disjointed, confusing and incoherent.",
    "The summary is incomplete.",
    "The summary should include he is worried about developing feelings for her again so wants to know if he should cut things off.",
    "The post is concise and provides enough background info for readers to offer advice or feedback.",
    "The summary is somewhat misleading as it leads the reader to believe that the author is worried about how he will emotionally react if things progress with the girl. However, the girl has stated that she has a boyfriend and so the author will not pursue anything further with her. Instead, he refers to his reaction at just holding her hand for minute and that if he cried tears of joy for fifteen minutes at just holding hands how is he going to react if he pursues something with someone who is actually interested?",
    "This is accurate, but it could have mentioned the author believes his friend should try to move on.",
    "The summary does not mention that the poster's fiancee brushes it off when she asks him about it.",
    "The summary is a good representation of the main points made in the post.",
    "The post should include she is considering asking him for an open relationship.",
    "The summary is to the point and provides enough information for readers to offer advice or feedback.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary should include details about the relationship circumstances surrounding the original break up.",
    "The summary should include the friend blows her off often and does not show respect. She is asking if there are other options or if she should drop her.",
    "This summary could be written so it flows a little better.",
    "The summary does not mention that the poster does not know how to tell his girlfriend about it.",
    "The summary could include detail about the girl being vocal about not wanting a relationship and he is worried about driving his friendships away.",
    "The summary should include he’d prefer a relationship but is open to friends too.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary should also include how they were sleeping together and going on dates but the guy thought they were just being friends and not involved in a relationship.",
    "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
    "The post should include she wants to be with him now but he’s worried about if it’s a good idea.",
    "The summary is a good representation of the main point of the post.",
    "This is accurate but it could have mentioned values were questioned.",
    "The post is short but contains enough information to be able to offer advise to the poster.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of covering the main points made in the post.",
    "The summary should include details about how they have different political views and she doesn’t think the relationship will last forever.",
    "The summary should include that she is feeling left out because they have hung out without her and she is upset about it.",
    "The summary could include information about helping her with stress relief in finding the gym and wanting to know if the friendship is forced now.",
    "The post is not accurate. The poster is the one in medical school and is realizing he and his girlfriend are not compatible and do not have the same ambition. He wants to break things off with her until she grows up.",
    "The summary could include information about the poster looking for advice on how to move forward with her boyfriend.",
    "This summary lacks key detail about the author having a crush on her friend.",
    "The summary does not mention that they have been communicating for 3 months.",
    "The summary does not mention that the poster's girlfriend's mother suggested counseling and he agrees with that. He also thinks that he and his girlfriend should have a more in-depth discussion about it.",
    "The summary is concise and to the point and provides enough detail to be able to offer advice.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is too vague.",
    "The summary is clear and to the point and provides the main points necessary to offer feedback and advice.",
    "This leave out a key detail about the girl having a boyfriend.",
    "The summary is clear and to the point. It provides enough detail to be able to offer advice.",
    "The summary should include she realized she does love him and wants to work it out but hopes he will forgive her.",
    "This lacks key details about the boyfriend being picture perfect, except for being clingy and controlling.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is lacking in details (the girlfriend promising to not talk to the ex but continuing to do so). ",
    "The summary is inaccurate.",
    "This leaves out key details about them texting and hanging out.",
    "The summary is clear and includes the most pertinent parts of the post to be able to provide feedback or advice.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is clear and to the point and provides the pertinent info for readers to provide feedback or advice.",
    "The summary is clear and well written but could include some details around their living situation too.",
    "The summary is confusing as the two sentences kind of contradict one another.",
    "The summary is not accurate.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary should include detail about her idea to talk to the landlord.",
    "The summary cuts off so it’s hard to provide feedback on the summary above. The information is good but not sure if the poster is asking about consolidation or income based repayment.",
    "The summary does not mention that this has changed the way the individual sees their father.",
    "The summary left out that she eventually did put the brakes on the relationship to focus on herself.",
    "The summary is concise and includes enough information necessary to offer feedback or advice.",
    "This leaves out the key detail about the author considering quitting their job.",
    "The summary is concise and to the point and contains the pertinent information of the post.",
    "The summary should mention that they think the instructor might have been married which is why they didn’t act on anything previously.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary mislabels the people involved. The author is also female and is dating a female who suffers from social anxiety. Some of this anxiety stems from the author's family not initially accepting their relationship which her girlfriend uses as a reason for not being there during her hospitalizations.",
    "The summary adequately covers the main point made in the post.",
    "The summary is too vague.",
    "This leaves out a key detail about the author planning to buy a studio apartment.",
    "The summary does not mention that the poster finds himself thinking a lot about other women.",
    "The summary tells us nothing about the reader's circumstances other than his mood. Some background on his situation would help guide the reader towards the advice he is seeking.",
    "The summary is written in a confusing way because you cannot tell who is referring to who.",
    "The poster's girlfriend does not think that the poster is changing into someone she does not want him to be.",
    "This summary of the post is unclear because it cuts off at the end.",
    "The summary does a good job of summing up the main points of the post.",
    "This summary adequately covers the main points made in the post.",
    "The summary does a good job of summing up the main points of the post.",
    "This is an accurate post that covers the main points.",
    "The summary is incomplete. While that is one question posed it does not cover why she is considering this option or the other choice she is considering.",
    "The summary does a good job of summing up the main points of the post.",
    "This leaves out key information about the neighbor claiming the author stole her medicine.",
    "This is not written correctly. \"Doesn't affect\" should be \"affects\".",
    "The summary has an error in which it states that the user is paying bills for their mother and herself but should said “myself.”",
    "This covers all of the relevant points.",
    "The second sentence of the summary is not true.",
    "This is an accurate account of the post. The ord \"him\" should be placed at the end. That sentence is incomplete.",
    "The summary does not mention that the poster wants him back.",
    "This leaves out key details about it happening at a private room in a party.",
    "The summary does a good job of covering the main points made in the post.",
    "The summary should also mention how the girlfriend doesn’t stay true to her word when she goes out drinking with friends.",
    "The summary does not mention that the poster's mother wants her to spy on her father.",
    "The summary is a good representation of the main points made in the post.",
    "The summary does a good job of summing up the main points of the post.",
    "This is an accurate summary of the post",
    "The summary is too vague.",
    "This covers all of the points mentioned in the post.",
    "This summary adequately covers the main points made in the post.",
    "This is an accurate summary of what was in the post.",
    "The summary should include specific details about why things in their day went wrong.",
    "The summary does a good job of summing up the main point of the post.",
    "This is inaccurate. The writer never disclosed his sexuality or race.",
    "The summary is very vague and doesn’t talk about how the person only feels attraction to people when they get to know them better.",
    "This is accurate. but missing information. There was a bruise on the leg as well. ",
    "The summary does a good job of summing up the main points of the post.",
    "This is an acccurate account of what was written in the post.",
    "The summary is a good representation of the main points made in the post.",
    "This sums up all of the main points.",
    "This is not accurate because it implies they gained all the weight back and they have only regained 15 lbs.",
    "The summary should clarify that they are thinking they should sue the medical facility for negligence.",
    "This covers the main point of the post",
    "The summary does not mention that the poster is worried about potentially having to deal with a long distance relationship after college.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary is too vague.",
    "This summary is a good representation of the main points made in the post.",
    "The summary is a little vague and should include a couple of details about why their life is falling apart.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary should also state how the puppy would be rehomed with a family member where they could visit occasionally.",
    "The summary states that their dad has been trying to sublease a store for 4 years but in the post the dad has been the one subleasing it for four years and just recently is trying to sublease it out to someone else.",
    "The summary did not mention that the poster switched depression drugs and the new drugs did not make him want to eat like the old one did.",
    "The summary should also include that her boss then went back and said that she will not be getting those funds because the business has closed.",
    "The summary is not an accurate summation of the post.",
    "The summary should also mention that they resigned due to low pay and finding a job more suited to what they wanted.",
    "The summary does not mention that the poster is feeling guilty for having the cheat meal and that even though they are supposed to have a rest day today, they want to exercise.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does a good job of summing up the main points of the post.",
    "The summary does not mention that the poster has been hosting the cats for 9 months and that the poster's 5-year old has become somewhat attached to them.",
    "The user did not get fired for having a medical emergency but they were let go afterwards because they were closing his office’s location.",
    "The summary covers the main question asked in the post.",
    "The summary being written in the second person feels out of place for the post summary.",
    "The summary is a good representation of the points made in the post.",
    "The summary is concise and offers good coverage of what is covered in the post. ",
    "The summary should also include the user’s request for advice on how to go about dating someone.",
    "This summary adequately covers the main points made in the post.",
    "The summary is concise and to the point and offers enough information to be able to offer feedback or advice to the poster. ",
    "The summary should also include details about the current guy they are interested in.",
    "The summary is concise and to the point and offers information to be able to offer support or advice. ",
    "The summary does a good job of capturing the main point of the post.",
    "The summary should include how they got a delivery job and they are borrowing their grandmother’s vehicle.",
    "The summary does not mention that the poster was told they should receive a call by 1pm about it.",
    "The post should include that the girl likes the guy now and wants to date but they are graduating college soon and will be moving to different areas and wonder if they should try it. ",
    "The summary should include details about the “signals” she is sending and how they are sexually related.",
    "The summary does a good job of summing up the main points of the post.",
    "The post is not accurate as the poster is worried about taking things too fast and is asking for advice on how to take things slower with this new man as she is used to things moving quicker. ",
    "The summary should include that they dated a girl for 3 years in high school but it ended badly.",
    "The summary is too vague."
  ],
  "description2taxonomy": {
    "suggests adding specific advice or guidance to the summary; specifically, the feedback recommends including a reference to advice being sought or offered in the original text. For example, 'this is good but can include he's looking for advice on if he should tell her or take it slow.'": {
      "node_name": "root_id=0_node=2052752586477581322",
      "description": "suggests adding specific advice or guidance to the summary; specifically, the feedback recommends including a reference to advice being sought or offered in the original text. For example, 'this is good but can include he's looking for advice on if he should tell her or take it slow.'",
      "texts": [
        "The summary is concise but could include information about the poster knowing the dogs are just playing and will react if they become aggressive and wants to know how to handle things with Max's dad. ",
        "The summary should pose the question the user is asking about how to initiate a relationship.",
        "The summary kind of addresses the dilemma but only includes some of the variables in the situation. The man is essentially wondering if her personality is enough to continue dating her. He also feels her attractiveness would increase if she lost a few pounds but knows he can not tell her that. He is seeking advice about what he should no about the situation.",
        "The summary states that they are already in a long distance relationship but the post says that they are going to try one and are looking for advice on how to prepare for it.",
        "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
        "The summary should include she is asking for advice on how she can help him move forward from being cheated on. ",
        "The summary is concise and to the point and provides enough detail to be able to provide advice or feedback to the poster. ",
        "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
        "This is good but can include he's looking for advice on if he should tell her or take it slow.\r\n",
        "The summary should include that it’s also a small town so the entire townspeople are giving them mixed advice.",
        "The summary is clear and concise and provides enough detail for the readers to offer advice or feedback. ",
        "The summary left out details about the girl having a boyfriend and that he is unsure if he should wait for her to break up with him or just move on.",
        "The summary should include that the father is unsure if he should let things happen or delay a wedding because his son just turned 18 recently.",
        "The summary is strong but would be better phrased if the question was \"Are these thoughts ok and should I bring them up?\" ",
        "Summary left out the incidence that happened and that the author needed advice",
        "The summary should mention that the author is looking for advice on what to do. ",
        "The summary should include he is worried about developing feelings for her again so wants to know if he should cut things off.",
        "The summary could include information about the poster looking for advice on how to move forward with her boyfriend.",
        "The summary should also include the user’s request for advice on how to go about dating someone.",
        "The post is not accurate as the poster is worried about taking things too fast and is asking for advice on how to take things slower with this new man as she is used to things moving quicker. "
      ],
      "description2taxonomy": {
        "focuses on specifying the type of advice needed; specifically, the feedback suggests clarifying the area in which the original text's author seeks advice or guidance. For example, 'The summary should include she is asking for advice on how she can help him move forward from being cheated on.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-8017304630750768470",
          "description": "focuses on specifying the type of advice needed; specifically, the feedback suggests clarifying the area in which the original text's author seeks advice or guidance. For example, 'The summary should include she is asking for advice on how she can help him move forward from being cheated on.'",
          "texts": [
            "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
            "The summary should include she is asking for advice on how she can help him move forward from being cheated on. ",
            "The summary should mention that the author is looking for advice on what to do. ",
            "The summary could include information about the poster looking for advice on how to move forward with her boyfriend."
          ],
          "description2taxonomy": {}
        },
        "addresses advice about decision-making; specifically, the feedback recommends that the summary should include information on the author seeking help in making decisions. For example, 'the summary should include that the father is unsure if he should let things happen or delay a wedding because his son just turned 18 recently.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-3484621701913244216",
          "description": "addresses advice about decision-making; specifically, the feedback recommends that the summary should include information on the author seeking help in making decisions. For example, 'the summary should include that the father is unsure if he should let things happen or delay a wedding because his son just turned 18 recently.'",
          "texts": [
            "The summary should include that the father is unsure if he should let things happen or delay a wedding because his son just turned 18 recently."
          ],
          "description2taxonomy": {}
        },
        "indicates the need for advice on pacing in relationships; specifically, the feedback recommends that the summary should include the author's request for guidance on managing the speed of a relationship. For example, 'the post is not accurate as the poster is worried about taking things too fast and is asking for advice on how to take things slower with this new man as she is used to things moving quicker.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-1915256789008971408",
          "description": "indicates the need for advice on pacing in relationships; specifically, the feedback recommends that the summary should include the author's request for guidance on managing the speed of a relationship. For example, 'the post is not accurate as the poster is worried about taking things too fast and is asking for advice on how to take things slower with this new man as she is used to things moving quicker.'",
          "texts": [
            "The post is not accurate as the poster is worried about taking things too fast and is asking for advice on how to take things slower with this new man as she is used to things moving quicker. "
          ],
          "description2taxonomy": {}
        },
        "emphasizes the importance of advice for personal growth or improvement; specifically, the feedback highlights that the summary should include details about the author seeking advice on self-improvement, self-awareness, or personal development. For example, 'the summary should include the poster is having a hard time accepting this and wonders what they should do.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-1692063215988181386",
          "description": "emphasizes the importance of advice for personal growth or improvement; specifically, the feedback highlights that the summary should include details about the author seeking advice on self-improvement, self-awareness, or personal development. For example, 'the summary should include the poster is having a hard time accepting this and wonders what they should do.'",
          "texts": [
            "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
            "This is good but can include he's looking for advice on if he should tell her or take it slow.\r\n"
          ],
          "description2taxonomy": {}
        },
        "advises clarifying the user's motivation for seeking advice; specifically, the feedback asks for clearer explanations of the reasons behind the author's need for guidance. For example, 'mention that he's asking for advice because he's concerned about the consequences of his actions.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-6214641641175486693",
          "description": "advises clarifying the user's motivation for seeking advice; specifically, the feedback asks for clearer explanations of the reasons behind the author's need for guidance. For example, 'mention that he's asking for advice because he's concerned about the consequences of his actions.'",
          "texts": [
            "The summary should include he is worried about developing feelings for her again so wants to know if he should cut things off."
          ],
          "description2taxonomy": {}
        },
        "recommends adding details about the situation; specifically, the feedback suggests including more context from the original text to help readers understand the issue. For example, 'Include more information about the circumstances that led to the problem.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-2753509717513847904",
          "description": "recommends adding details about the situation; specifically, the feedback suggests including more context from the original text to help readers understand the issue. For example, 'Include more information about the circumstances that led to the problem.'",
          "texts": [
            "The summary is concise but could include information about the poster knowing the dogs are just playing and will react if they become aggressive and wants to know how to handle things with Max's dad. ",
            "The summary should include that it’s also a small town so the entire townspeople are giving them mixed advice.",
            "The summary left out details about the girl having a boyfriend and that he is unsure if he should wait for her to break up with him or just move on.",
            "Summary left out the incidence that happened and that the author needed advice",
            "The summary could include information about the poster looking for advice on how to move forward with her boyfriend."
          ],
          "description2taxonomy": {}
        },
        "emphasizes the inclusion of a question; specifically, the feedback suggests incorporating the main question from the original text. For example, 'Consider adding the exact question the user is asking for clarity.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-1855888576045590998",
          "description": "emphasizes the inclusion of a question; specifically, the feedback suggests incorporating the main question from the original text. For example, 'Consider adding the exact question the user is asking for clarity.'",
          "texts": [
            "The summary should pose the question the user is asking about how to initiate a relationship.",
            "The summary is strong but would be better phrased if the question was \"Are these thoughts ok and should I bring them up?\" ",
            "The summary should also include the user’s request for advice on how to go about dating someone."
          ],
          "description2taxonomy": {}
        },
        "prompts for adding possible consequences; specifically, the feedback proposes highlighting potential negative or positive outcomes of taking a certain course of action. For example, 'include some possible consequences of the user's decision, such as the partner's reaction or relationship dynamics.'": {
          "node_name": "root_id=0_node=2052752586477581322_node=-694796603452282502",
          "description": "prompts for adding possible consequences; specifically, the feedback proposes highlighting potential negative or positive outcomes of taking a certain course of action. For example, 'include some possible consequences of the user's decision, such as the partner's reaction or relationship dynamics.'",
          "texts": [],
          "description2taxonomy": {}
        }
      }
    },
    "suggests a rephrasing for better flow; specifically, the feedback proposes rewording or rearranging the text for improved readability. For example, 'This could be rewritten to make it flow a little better.'": {
      "node_name": "root_id=0_node=2593428671492621347",
      "description": "suggests a rephrasing for better flow; specifically, the feedback proposes rewording or rearranging the text for improved readability. For example, 'This could be rewritten to make it flow a little better.'",
      "texts": [
        "The summary should be rewritten so it flows a little better.",
        "The summary could be rewritten to flow a bit better.",
        "The summary could be written a bit more fluently.",
        "The summary could be rewritten with a few extra words that help paint the picture of the situation.",
        "The summary could be written more fluently and in a complete sentence.",
        "The summary is strong but would be better phrased if the question was \"Are these thoughts ok and should I bring them up?\" ",
        "The summary is strong but could also mention that the author isn't socially incompetent, just doesn't know where to start. ",
        "This could be rewritten to make it flow a little better.",
        "The summary should be split into two different sentences so that the main points don’t muddle together.",
        "This summary could be written so it flows a little better."
      ],
      "description2taxonomy": {}
    },
    "points out an omission in the summary; specifically, the feedback addresses a missing detail from the original post. For example, 'The summary does not mention that the partner does not want to have children while the individual does.'": {
      "node_name": "root_id=0_node=2691464785974939091",
      "description": "points out an omission in the summary; specifically, the feedback addresses a missing detail from the original post. For example, 'The summary does not mention that the partner does not want to have children while the individual does.'",
      "texts": [
        "The summary left out details about the girl wanting to be carefree during a Vegas trip.",
        "The summary should include details about what the boyfriend’s definition of “love” means.",
        "The summary states that they are already in a long distance relationship but the post says that they are going to try one and are looking for advice on how to prepare for it.",
        "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
        "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
        "The summary doesn't indicate the the author is split between breaking up now, or waiting and enjoying the time they have together. ",
        "The summary should also mention how he is also starting to neglect spending time with her as well.",
        "The post doesn't mention weeks going by. ",
        "The summary doesn't indicate that the baby's father will be released from prison soon, and that the author wouldn't trust him with the baby due to his history, and fears him trying to manipulate her. ",
        "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
        "The summary doesn't mention that the other girl is the younger sister of one of the authors friends. ",
        "The summary left out details about he just getting out of a relationship and not being ready for something so committed.",
        "The summary misses some of the main points of the post.",
        "The summary lacks some important details.",
        "The summary does not mention that the poster is wondering if her boyfriend is sleeping with his ex again",
        "The summary is partially inaccurate; it is not true that the poster's boyfriend's new career is costing them money they don't have.",
        "This is missing key information, like the fear the author has of damaging their career.",
        "The summary should also include how they will be long distance from each other while attending school.",
        "The summary does not mention that they are wondering if they should pay someone to decorate the house because of this.",
        "The summary does not mention that the partner does not want to have children while the individual does.",
        "The summary states that the user’s parents don’t like their boyfriend but the post never said anything of the sort.",
        "The summary does not mention that the poster is freaking out about the fact that his girlfriend is going to be around his family on a regular basis.",
        "The summary should include that she is paying all the bills while he is saving for their future. ",
        "The summary doesn't mention that the friend broke ties with everyone due to being in an toxic controlling relationship .",
        "Summary left out the incidence that happened and that the author needed advice",
        "The summary doesn't mention that she specifically wants to be able to move out as neither her not the author make enough.",
        "The post never states that the woman became a \"completely different person\" after they started dating. ",
        "The summary doesn't mention that the friends and family think the author would make her happier than her fiancé does. ",
        "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
        "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
        "The summary doesn't mention that the guys sex offender status comes from a non serious offense at age 18 with a 16 year old. ",
        "The summary should include the author's question about bowing out of the wedding. ",
        "The summary doesn't state anything about their relationship beyond sex.",
        "The summary says that the couple is struggling but in the post it’s just the user that seems to be struggling with the idea of Skype flirting being considered cheating or not.",
        "The summary left out how his sister kept interjecting opinions where they didn’t belong as well.",
        "The summary leaves out details regarding the user’s fears that she will never talk to the guy again.",
        "The summary left out the main complaint in the post which was about how the guys only talk about videogames and they get bored very quickly.",
        "The summary should mention that the user participated in that particular activity when he was only into his current relationship for a month.",
        "The summary is misleading because it says that her boyfriend sent a nude to her boss but the nude was actually sent to the girlfriend, the boss just happened to see it pop up on her phone.",
        "The summary misses some of the important points of the post.",
        "The summary leaves out all the details about financing on a tight budget for the trip which was the main reason for the post.",
        "The summary does not mention that he feels guilty about wanting to break up with her.",
        "The summary does not touch on some of the main points of the post.",
        "The summary should also mention how they are worried about spending time at home for Christmas because of it.",
        "The summary is incomplete.",
        "The summary does not mention that the poster's fiancee brushes it off when she asks him about it.",
        "The summary should include details about the relationship circumstances surrounding the original break up.",
        "The summary does not mention that the poster does not know how to tell his girlfriend about it.",
        "The summary should also include how they were sleeping together and going on dates but the guy thought they were just being friends and not involved in a relationship.",
        "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
        "The summary does not mention that they have been communicating for 3 months.",
        "This leave out a key detail about the girl having a boyfriend.",
        "The summary is lacking in details (the girlfriend promising to not talk to the ex but continuing to do so). ",
        "The summary left out that she eventually did put the brakes on the relationship to focus on herself.",
        "This leaves out the key detail about the author considering quitting their job.",
        "This leaves out a key detail about the author planning to buy a studio apartment.",
        "The summary tells us nothing about the reader's circumstances other than his mood. Some background on his situation would help guide the reader towards the advice he is seeking.",
        "The summary is incomplete. While that is one question posed it does not cover why she is considering this option or the other choice she is considering.",
        "This leaves out key information about the neighbor claiming the author stole her medicine.",
        "This leaves out key details about it happening at a private room in a party.",
        "The summary does not mention that the poster is worried about potentially having to deal with a long distance relationship after college.",
        "The summary states that their dad has been trying to sublease a store for 4 years but in the post the dad has been the one subleasing it for four years and just recently is trying to sublease it out to someone else.",
        "The summary did not mention that the poster switched depression drugs and the new drugs did not make him want to eat like the old one did.",
        "The summary does not mention that the poster is feeling guilty for having the cheat meal and that even though they are supposed to have a rest day today, they want to exercise.",
        "The summary does not mention that the poster has been hosting the cats for 9 months and that the poster's 5-year old has become somewhat attached to them.",
        "The summary should also include the user’s request for advice on how to go about dating someone.",
        "The summary does not mention that the poster was told they should receive a call by 1pm about it."
      ],
      "description2taxonomy": {
        "notes a neglected author's question or request; specifically, the feedback points out that the summary does not include the author's inquiry or call for advice. For example, 'The summary should include the author's question about bowing out of the wedding.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=8099523404301378185",
          "description": "notes a neglected author's question or request; specifically, the feedback points out that the summary does not include the author's inquiry or call for advice. For example, 'The summary should include the author's question about bowing out of the wedding.'",
          "texts": [
            "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
            "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
            "The summary does not mention that the poster is wondering if her boyfriend is sleeping with his ex again",
            "Summary left out the incidence that happened and that the author needed advice",
            "The summary should include the author's question about bowing out of the wedding. ",
            "The summary does not mention that the poster does not know how to tell his girlfriend about it.",
            "The summary tells us nothing about the reader's circumstances other than his mood. Some background on his situation would help guide the reader towards the advice he is seeking.",
            "The summary does not mention that the poster is worried about potentially having to deal with a long distance relationship after college.",
            "The summary should also include the user’s request for advice on how to go about dating someone."
          ],
          "description2taxonomy": {}
        },
        "addresses a missing financial aspect; specifically, the feedback indicates that the summary omits information related to financial matters or concerns. For example, 'The summary should include that she is paying all the bills while he is saving for their future.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=6804644665556855828",
          "description": "addresses a missing financial aspect; specifically, the feedback indicates that the summary omits information related to financial matters or concerns. For example, 'The summary should include that she is paying all the bills while he is saving for their future.'",
          "texts": [
            "The summary should include that she is paying all the bills while he is saving for their future. ",
            "The summary leaves out all the details about financing on a tight budget for the trip which was the main reason for the post.",
            "This leaves out a key detail about the author planning to buy a studio apartment."
          ],
          "description2taxonomy": {}
        },
        "indicates a missing time-related detail; specifically, the feedback addresses the lack of information about time or duration in the summary. For example, 'The summary does not mention that they have been communicating for 3 months.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=-1361888705804517352",
          "description": "indicates a missing time-related detail; specifically, the feedback addresses the lack of information about time or duration in the summary. For example, 'The summary does not mention that they have been communicating for 3 months.'",
          "texts": [
            "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
            "The summary doesn't indicate the the author is split between breaking up now, or waiting and enjoying the time they have together. ",
            "The summary should also mention how he is also starting to neglect spending time with her as well.",
            "The post doesn't mention weeks going by. ",
            "The summary should mention that the user participated in that particular activity when he was only into his current relationship for a month.",
            "The summary should also mention how they are worried about spending time at home for Christmas because of it.",
            "The summary does not mention that they have been communicating for 3 months.",
            "The summary does not mention that the poster has been hosting the cats for 9 months and that the poster's 5-year old has become somewhat attached to them.",
            "The summary does not mention that the poster was told they should receive a call by 1pm about it."
          ],
          "description2taxonomy": {}
        },
        "indicates a missing relationship detail; specifically, the feedback points out that the summary omits information about the relationship dynamics between the individuals involved. For example, 'The summary doesn't state anything about their relationship beyond sex.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=-8150080570904080978",
          "description": "indicates a missing relationship detail; specifically, the feedback points out that the summary omits information about the relationship dynamics between the individuals involved. For example, 'The summary doesn't state anything about their relationship beyond sex.'",
          "texts": [
            "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
            "The summary doesn't indicate that the baby's father will be released from prison soon, and that the author wouldn't trust him with the baby due to his history, and fears him trying to manipulate her. ",
            "The summary doesn't mention that the other girl is the younger sister of one of the authors friends. ",
            "The summary does not mention that the poster is wondering if her boyfriend is sleeping with his ex again",
            "The summary does not mention that the poster is freaking out about the fact that his girlfriend is going to be around his family on a regular basis.",
            "The summary doesn't mention that the friend broke ties with everyone due to being in an toxic controlling relationship .",
            "The summary doesn't state anything about their relationship beyond sex.",
            "The summary does not mention that the poster's fiancee brushes it off when she asks him about it.",
            "The summary should include details about the relationship circumstances surrounding the original break up.",
            "The summary should also include how they were sleeping together and going on dates but the guy thought they were just being friends and not involved in a relationship.",
            "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
            "This leave out a key detail about the girl having a boyfriend.",
            "The summary is lacking in details (the girlfriend promising to not talk to the ex but continuing to do so). "
          ],
          "description2taxonomy": {}
        },
        "signals an inaccuracy or contradiction in the summary; specifically, the feedback points out a detail that is either incorrect or contradicting the original post. For example, 'The summary is partially inaccurate; it is not true that the poster's boyfriend's new career is costing them money they don't have.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=3603566805786576483",
          "description": "signals an inaccuracy or contradiction in the summary; specifically, the feedback points out a detail that is either incorrect or contradicting the original post. For example, 'The summary is partially inaccurate; it is not true that the poster's boyfriend's new career is costing them money they don't have.'",
          "texts": [
            "The summary states that they are already in a long distance relationship but the post says that they are going to try one and are looking for advice on how to prepare for it.",
            "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
            "The summary doesn't indicate that the baby's father will be released from prison soon, and that the author wouldn't trust him with the baby due to his history, and fears him trying to manipulate her. ",
            "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
            "The summary is partially inaccurate; it is not true that the poster's boyfriend's new career is costing them money they don't have.",
            "This is missing key information, like the fear the author has of damaging their career.",
            "The summary does not mention that the partner does not want to have children while the individual does.",
            "The summary states that the user’s parents don’t like their boyfriend but the post never said anything of the sort.",
            "The summary doesn't mention that the friend broke ties with everyone due to being in an toxic controlling relationship .",
            "The post never states that the woman became a \"completely different person\" after they started dating. ",
            "The summary doesn't mention that the friends and family think the author would make her happier than her fiancé does. ",
            "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
            "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
            "The summary doesn't mention that the guys sex offender status comes from a non serious offense at age 18 with a 16 year old. ",
            "The summary says that the couple is struggling but in the post it’s just the user that seems to be struggling with the idea of Skype flirting being considered cheating or not.",
            "The summary is misleading because it says that her boyfriend sent a nude to her boss but the nude was actually sent to the girlfriend, the boss just happened to see it pop up on her phone.",
            "The summary leaves out all the details about financing on a tight budget for the trip which was the main reason for the post.",
            "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
            "The summary is lacking in details (the girlfriend promising to not talk to the ex but continuing to do so). ",
            "This leaves out the key detail about the author considering quitting their job.",
            "The summary states that their dad has been trying to sublease a store for 4 years but in the post the dad has been the one subleasing it for four years and just recently is trying to sublease it out to someone else.",
            "The summary did not mention that the poster switched depression drugs and the new drugs did not make him want to eat like the old one did.",
            "The summary does not mention that the poster has been hosting the cats for 9 months and that the poster's 5-year old has become somewhat attached to them."
          ],
          "description2taxonomy": {}
        },
        "misses an emotional aspect; specifically, the feedback points out the lack of emotions or feelings expressed by the user in the original post. For example, 'the summary does not include the user's feelings of guilt or regret over their decision.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=7138713243502376466",
          "description": "misses an emotional aspect; specifically, the feedback points out the lack of emotions or feelings expressed by the user in the original post. For example, 'the summary does not include the user's feelings of guilt or regret over their decision.'",
          "texts": [
            "This is missing key information, like the fear the author has of damaging their career.",
            "The summary does not mention that the poster is freaking out about the fact that his girlfriend is going to be around his family on a regular basis.",
            "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
            "The summary leaves out details regarding the user’s fears that she will never talk to the guy again.",
            "The summary does not mention that he feels guilty about wanting to break up with her.",
            "The summary should also mention how they are worried about spending time at home for Christmas because of it.",
            "The summary does not mention that the poster is feeling guilty for having the cheat meal and that even though they are supposed to have a rest day today, they want to exercise."
          ],
          "description2taxonomy": {}
        },
        "underrepresents the problem, issue, or complaint; specifically, the feedback asserts that the summary did not capture the main grievance or concern in the original post. For example, 'The summary left out the main complaint in the post which was about how the guys only talk about videogames and they get bored very quickly.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=2521282514008893092",
          "description": "underrepresents the problem, issue, or complaint; specifically, the feedback asserts that the summary did not capture the main grievance or concern in the original post. For example, 'The summary left out the main complaint in the post which was about how the guys only talk about videogames and they get bored very quickly.'",
          "texts": [
            "The summary misses some of the main points of the post.",
            "The summary doesn't state anything about their relationship beyond sex.",
            "The summary left out the main complaint in the post which was about how the guys only talk about videogames and they get bored very quickly.",
            "The summary misses some of the important points of the post.",
            "The summary leaves out all the details about financing on a tight budget for the trip which was the main reason for the post.",
            "The summary does not touch on some of the main points of the post."
          ],
          "description2taxonomy": {}
        },
        "neglects personal opinions or feelings; specifically, the feedback indicates that the summary failed to capture the emotions or viewpoints expressed in the original post. For example, 'The summary left out how his sister kept interjecting opinions where they didn't belong as well.'": {
          "node_name": "root_id=0_node=2691464785974939091_node=5129048851628262745",
          "description": "neglects personal opinions or feelings; specifically, the feedback indicates that the summary failed to capture the emotions or viewpoints expressed in the original post. For example, 'The summary left out how his sister kept interjecting opinions where they didn't belong as well.'",
          "texts": [
            "The summary left out how his sister kept interjecting opinions where they didn’t belong as well."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "identifies inaccuracies or errors; specifically, the feedback highlights a mistake or discrepancy between the summary and the original text. For example, 'the summary incorrectly identifies the author as female when it's a male.'": {
      "node_name": "root_id=0_node=2315334008344953815",
      "description": "identifies inaccuracies or errors; specifically, the feedback highlights a mistake or discrepancy between the summary and the original text. For example, 'the summary incorrectly identifies the author as female when it's a male.'",
      "texts": [
        "The summary states that they are already in a long distance relationship but the post says that they are going to try one and are looking for advice on how to prepare for it.",
        "The summary is not an accurate summation of the post",
        "The summary is not accurate as the poster is not leaving their wife. He is leaving his job and fling, but not his wife. ",
        "Person B would be the author, f22, not m21. ",
        "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
        "The summary is inaccurate about the amount of the time that the poster and his girlfriend have been fighting in their relationship.",
        "The summary doesn't indicate that the baby's father will be released from prison soon, and that the author wouldn't trust him with the baby due to his history, and fears him trying to manipulate her. ",
        "This isn't really accurate - both girlfriends broke up with him on both occasions. ",
        "The summary is partially inaccurate; it is not true that the poster's boyfriend's new career is costing them money they don't have.",
        "This is missing key information, like the fear the author has of damaging their career.",
        "The summary is not at all accurate.",
        "The summary is inaccurate.",
        "The summary does not mention that the partner does not want to have children while the individual does.",
        "The post stated that the friend kissed the girlfriend but she didn’t kiss him back and the summary states that he girlfriend kissed the boy.",
        "The summary states that the user’s parents don’t like their boyfriend but the post never said anything of the sort.",
        "The summary says that the woman is being separated due to geographical reasons but it’s really more because he is moving to get away from her family.",
        "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
        "The summary doesn't mention that the guys sex offender status comes from a non serious offense at age 18 with a 16 year old. ",
        "The summary should mention that the author wants to know why potential partners keep passing him over.",
        "The summary should mention that the author blocked his ex to avoid all contact. ",
        "The summary incorrectly identifies the author as female when it's a male. ",
        "The summary should mention that the user participated in that particular activity when he was only into his current relationship for a month.",
        "The summary is not exactly an accurate summation of the post.",
        "The summary is misleading because it says that her boyfriend sent a nude to her boss but the nude was actually sent to the girlfriend, the boss just happened to see it pop up on her phone.",
        "The summary is not accurate.",
        "The summary is inaccurate; the poster is not considering breaking up with her partner.",
        "The summary is inaccurate.",
        "The summary is not accurate.",
        "The summary mislabels the people involved. The author is also female and is dating a female who suffers from social anxiety. Some of this anxiety stems from the author's family not initially accepting their relationship which her girlfriend uses as a reason for not being there during her hospitalizations.",
        "This is not written correctly. \"Doesn't affect\" should be \"affects\".",
        "The summary has an error in which it states that the user is paying bills for their mother and herself but should said “myself.”",
        "The second sentence of the summary is not true.",
        "This is inaccurate. The writer never disclosed his sexuality or race.",
        "This is not accurate because it implies they gained all the weight back and they have only regained 15 lbs.",
        "The summary states that their dad has been trying to sublease a store for 4 years but in the post the dad has been the one subleasing it for four years and just recently is trying to sublease it out to someone else.",
        "The summary is not an accurate summation of the post."
      ],
      "description2taxonomy": {
        "points out wrong character identification; specifically, the feedback indicates incorrect gender, age, or relationship status of the individuals mentioned in the summary. For example, 'the summary incorrectly identifies the author as female when it's a male.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=2901612829283976726",
          "description": "points out wrong character identification; specifically, the feedback indicates incorrect gender, age, or relationship status of the individuals mentioned in the summary. For example, 'the summary incorrectly identifies the author as female when it's a male.'",
          "texts": [
            "The summary is not accurate as the poster is not leaving their wife. He is leaving his job and fling, but not his wife. ",
            "Person B would be the author, f22, not m21. ",
            "The summary is inaccurate about the amount of the time that the poster and his girlfriend have been fighting in their relationship.",
            "The summary states that the user’s parents don’t like their boyfriend but the post never said anything of the sort.",
            "The summary says that the woman is being separated due to geographical reasons but it’s really more because he is moving to get away from her family.",
            "The summary should mention that the author wants to know why potential partners keep passing him over.",
            "The summary should mention that the author blocked his ex to avoid all contact. ",
            "The summary incorrectly identifies the author as female when it's a male. ",
            "The summary should mention that the user participated in that particular activity when he was only into his current relationship for a month."
          ],
          "description2taxonomy": {}
        },
        "mentions incorrect cause and effect relationships; specifically, the feedback identifies discrepancies in the summary when it comes to the sequence of events or the reasons behind certain actions. For example, 'this is not accurate because it implies they gained all the weight back and they have only regained 15 lbs.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=-8841279989557740222",
          "description": "mentions incorrect cause and effect relationships; specifically, the feedback identifies discrepancies in the summary when it comes to the sequence of events or the reasons behind certain actions. For example, 'this is not accurate because it implies they gained all the weight back and they have only regained 15 lbs.'",
          "texts": [
            "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
            "This is not accurate because it implies they gained all the weight back and they have only regained 15 lbs."
          ],
          "description2taxonomy": {}
        },
        "discloses incorrect grammar or word usage; specifically, the feedback identifies a grammatical error or an improper use of a word in the summary. For example, 'this is not written correctly. \"Doesn't affect\" should be \"affects\".'": {
          "node_name": "root_id=0_node=2315334008344953815_node=-8505231268491845679",
          "description": "discloses incorrect grammar or word usage; specifically, the feedback identifies a grammatical error or an improper use of a word in the summary. For example, 'this is not written correctly. \"Doesn't affect\" should be \"affects\".'",
          "texts": [
            "This is not written correctly. \"Doesn't affect\" should be \"affects\".",
            "The summary has an error in which it states that the user is paying bills for their mother and herself but should said “myself.”"
          ],
          "description2taxonomy": {}
        },
        "addresses incorrect relationships; specifically, the feedback identifies inaccuracies in the relationships between various elements or people in the summary. For example, 'the summary mislabels the people involved. The author is also female and is dating a female who suffers from social anxiety.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=-6927393036112102287",
          "description": "addresses incorrect relationships; specifically, the feedback identifies inaccuracies in the relationships between various elements or people in the summary. For example, 'the summary mislabels the people involved. The author is also female and is dating a female who suffers from social anxiety.'",
          "texts": [
            "Person B would be the author, f22, not m21. ",
            "The summary mislabels the people involved. The author is also female and is dating a female who suffers from social anxiety. Some of this anxiety stems from the author's family not initially accepting their relationship which her girlfriend uses as a reason for not being there during her hospitalizations."
          ],
          "description2taxonomy": {}
        },
        "mentions false implications; specifically, the feedback calls out the summary for suggesting misleading or unsupported conclusions based on the original text. For example, 'the summary implies that the protagonist is responsible for the tragedy, but there's no evidence for that in the story.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=7796029638518528260",
          "description": "mentions false implications; specifically, the feedback calls out the summary for suggesting misleading or unsupported conclusions based on the original text. For example, 'the summary implies that the protagonist is responsible for the tragedy, but there's no evidence for that in the story.'",
          "texts": [],
          "description2taxonomy": {}
        },
        "detects inaccurate quotations or citations; specifically, the feedback identifies incorrect or misattributed quotes or references used in the summary from the original text. For example, 'the summary attributes the quote to the actor when it was actually said by the director.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=813005772058172693",
          "description": "detects inaccurate quotations or citations; specifically, the feedback identifies incorrect or misattributed quotes or references used in the summary from the original text. For example, 'the summary attributes the quote to the actor when it was actually said by the director.'",
          "texts": [],
          "description2taxonomy": {}
        },
        "identifies lack of context or background; specifically, the feedback emphasizes that the summary does not provide necessary context or background information to understand the original text. For example, 'the summary fails to mention the circumstances that led to the conflict.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=-2344180528037955732",
          "description": "identifies lack of context or background; specifically, the feedback emphasizes that the summary does not provide necessary context or background information to understand the original text. For example, 'the summary fails to mention the circumstances that led to the conflict.'",
          "texts": [
            "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
            "The summary doesn't indicate that the baby's father will be released from prison soon, and that the author wouldn't trust him with the baby due to his history, and fears him trying to manipulate her. ",
            "This is missing key information, like the fear the author has of damaging their career.",
            "The summary does not mention that the partner does not want to have children while the individual does.",
            "The summary doesn't mention that the guys sex offender status comes from a non serious offense at age 18 with a 16 year old. ",
            "The summary should mention that the author blocked his ex to avoid all contact. "
          ],
          "description2taxonomy": {}
        },
        "uncovers false assumptions; specifically, the feedback calls attention to the summary inaccurately drawing a conclusion or inference. For example, 'the summary assumes the woman is unhappy with her job, but she's actually seeking a promotion.'": {
          "node_name": "root_id=0_node=2315334008344953815_node=-4082617013366630030",
          "description": "uncovers false assumptions; specifically, the feedback calls attention to the summary inaccurately drawing a conclusion or inference. For example, 'the summary assumes the woman is unhappy with her job, but she's actually seeking a promotion.'",
          "texts": [
            "The summary is not an accurate summation of the post",
            "The summary is not at all accurate.",
            "The summary is inaccurate.",
            "The summary states that the user’s parents don’t like their boyfriend but the post never said anything of the sort.",
            "The summary is not exactly an accurate summation of the post.",
            "The summary is misleading because it says that her boyfriend sent a nude to her boss but the nude was actually sent to the girlfriend, the boss just happened to see it pop up on her phone.",
            "The summary is not accurate.",
            "The summary is inaccurate; the poster is not considering breaking up with her partner.",
            "The summary is inaccurate.",
            "The summary is not accurate.",
            "The second sentence of the summary is not true.",
            "The summary states that their dad has been trying to sublease a store for 4 years but in the post the dad has been the one subleasing it for four years and just recently is trying to sublease it out to someone else.",
            "The summary is not an accurate summation of the post."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "comments on overall quality; specifically, the feedback evaluates the general success, accuracy, or coherence of the text. For example, 'this is a good summary of the post, but there are some minor details missing.'": {
      "node_name": "root_id=0_node=-3073219986958380156",
      "description": "comments on overall quality; specifically, the feedback evaluates the general success, accuracy, or coherence of the text. For example, 'this is a good summary of the post, but there are some minor details missing.'",
      "texts": [
        "This is an accurate account of what was in the post.",
        "The summary is clear and concise and provides enough information for readers to be able to provide feedback or advice. ",
        "The summary is concise and includes the pertinent information needed for readers to respond. ",
        "The summary does a good job of covering the main points made in the post.",
        "The post is concise and to the point and includes the InfoMation necessary to offer feedback or advice. ",
        "The summary is concise and provides enough detail for people to offer the poster feedback or advice. ",
        "The summary does a good job of summing up the main points of the problem.",
        "The summary is really short and concise, but could include some background details about being abused by the boyfriend and that he keeps using drugs. ",
        "This is an accurate summary of the post.",
        "The summary is clear and concise and provides the main points of the post. ",
        "The summary does a good job of covering the main points made in the post.",
        "The summary is a good representation of the main points made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary is clear and concise and provides the information required to offer feedback or advice. ",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of covering the main points made in the post.",
        "The summary is concise and to the point and provides enough detail to be able to provide advice or feedback to the poster. ",
        "The summary does a good job of summing up the main points of the post.",
        "The summary is strong and covers all the key points from the post. ",
        "The summary is strong and covers all the key points from the post. ",
        "The summary covers the main question poised in the post.",
        "The summary is strong and covers all the key points from the post.",
        "The summary is a good representation of the main points made in the post.",
        "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
        "The summary adequately covers the main points made in the post.",
        "The summary does a good job of covering the main points made in the post.",
        "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
        "The summary is clear and concise and contains the main points of the post. ",
        "The summary is a good representation of the main points made in the post.",
        "The summary adequately covers the main points made in the post.",
        "This is a great summary and the only thing I would add is that she's upset he lied before.",
        "The summary does a good job of covering the main points made in the post.",
        "This is good but can include that they drink for social anxiety but that's not a good solution.",
        "The summary is strong and covers all the key points from the post.",
        "The summary is a good representation of the main points made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "This covers all of the points made in the post",
        "This covers all of the main points made in the post.",
        "This is accurate and it covers all of the main points.",
        "The summary does a good job of summing up the main points of the post.",
        "This is an acccurate account of what was written in the post",
        "The summary does a good job of summing up the main points of the post.",
        "This covers the main point in the post",
        "The summary is a good representation of the main points made in the post.",
        "The summary adequately covers the main points made in the post.",
        "The summary does a good job of covering the main points made in the post.",
        "The summary is strong and covers all the key points from the post. ",
        "The summary is concise and to the point and contains enough information to be able to provide feedback or advice. ",
        "The summary is clear and concise and provides enough detail for the readers to offer advice or feedback. ",
        "The summary is concise and to the point and contains enough info for readers to offer feedback or advice. ",
        "The summary is a good representation of the main points made in the post.",
        "The summary is clear and concise and provides enough detail to be able to offer advice. ",
        "The summary does a good job of summing up the main point of the post.",
        "The summary is clear and concise and provides enough context for readers to be able to offer support or advice. ",
        "The summary is a good representation of the main points made in the post.",
        "The summary is strong and covers all the key points from the post. ",
        "The summary is strong but would be better phrased if the question was \"Are these thoughts ok and should I bring them up?\" ",
        "The summary misses the details (that the author saw herself forced to break up with her boyfriend, but has seen other couples get back together) ",
        "The summary is strong but could also mention that the author isn't socially incompetent, just doesn't know where to start. ",
        "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
        "I don't have an issue with this summary",
        "The summary should mention that the author is looking for advice on what to do. ",
        "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
        "The summary is strong and covers all the key points from the post. ",
        "The summary is strong and covers all the key points of the post. ",
        "The summary should mention that the author wants to know why potential partners keep passing him over.",
        "This summary adequately covers the main points made in the post.",
        "The summary is a good representation of the main points made in the post.",
        "The summary is a good representation of the main points made in the post.",
        "The summary adequately covers the main points made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary covers the main question that was posed in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "This summary is a good representation of the main points made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary is concise and to the point and provides enough detail to be able to offer support or advice.",
        "The summary is a good representation of the main points presented in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of covering the important points in the post.",
        "The post is concise and includes the info necessary to provide feedback or advise.",
        "The post is concise and provides enough background info for readers to offer advice or feedback.",
        "This is accurate, but it could have mentioned the author believes his friend should try to move on.",
        "The summary is a good representation of the main points made in the post.",
        "The summary is to the point and provides enough information for readers to offer advice or feedback.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
        "The summary is a good representation of the main point of the post.",
        "This is accurate but it could have mentioned values were questioned.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of covering the main points made in the post.",
        "The summary is concise and to the point and provides enough detail to be able to offer advice.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary is clear and to the point and provides the main points necessary to offer feedback and advice.",
        "The summary is clear and to the point. It provides enough detail to be able to offer advice.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary is lacking in details (the girlfriend promising to not talk to the ex but continuing to do so). ",
        "The summary is clear and includes the most pertinent parts of the post to be able to provide feedback or advice.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary is clear and to the point and provides the pertinent info for readers to provide feedback or advice.",
        "The summary is clear and well written but could include some details around their living situation too.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary left out that she eventually did put the brakes on the relationship to focus on herself.",
        "The summary is concise and includes enough information necessary to offer feedback or advice.",
        "The summary is concise and to the point and contains the pertinent information of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary adequately covers the main point made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "This summary adequately covers the main points made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "This is an accurate post that covers the main points.",
        "The summary does a good job of summing up the main points of the post.",
        "This covers all of the relevant points.",
        "The summary does a good job of covering the main points made in the post.",
        "The summary is a good representation of the main points made in the post.",
        "The summary does a good job of summing up the main points of the post.",
        "This is an accurate summary of the post",
        "This covers all of the points mentioned in the post.",
        "This summary adequately covers the main points made in the post.",
        "This is an accurate summary of what was in the post.",
        "The summary does a good job of summing up the main point of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "This is an acccurate account of what was written in the post.",
        "The summary is a good representation of the main points made in the post.",
        "This sums up all of the main points.",
        "This covers the main point of the post",
        "The summary does a good job of summing up the main points of the post.",
        "This summary is a good representation of the main points made in the post.",
        "The summary is a little vague and should include a couple of details about why their life is falling apart.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary does a good job of summing up the main points of the post.",
        "The summary covers the main question asked in the post.",
        "The summary is a good representation of the points made in the post.",
        "The summary is concise and offers good coverage of what is covered in the post. ",
        "This summary adequately covers the main points made in the post.",
        "The summary is concise and to the point and offers enough information to be able to offer feedback or advice to the poster. ",
        "The summary is concise and to the point and offers information to be able to offer support or advice. ",
        "The summary does a good job of capturing the main point of the post.",
        "The summary does a good job of summing up the main points of the post."
      ],
      "description2taxonomy": {
        "praises the summary's clarity; specifically, the feedback highlights the clear and concise nature of the text. For example, 'The summary is clear and to the point, making it easy to understand.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=5283544736022978185",
          "description": "praises the summary's clarity; specifically, the feedback highlights the clear and concise nature of the text. For example, 'The summary is clear and to the point, making it easy to understand.'",
          "texts": [
            "The summary is clear and concise and provides enough information for readers to be able to provide feedback or advice. ",
            "The summary is concise and includes the pertinent information needed for readers to respond. ",
            "The post is concise and to the point and includes the InfoMation necessary to offer feedback or advice. ",
            "The summary is concise and provides enough detail for people to offer the poster feedback or advice. ",
            "The summary is clear and concise and provides the main points of the post. ",
            "The summary is clear and concise and provides the information required to offer feedback or advice. ",
            "The summary is concise and to the point and provides enough detail to be able to provide advice or feedback to the poster. ",
            "The summary is clear and concise and contains the main points of the post. ",
            "The summary is concise and to the point and contains enough information to be able to provide feedback or advice. ",
            "The summary is clear and concise and provides enough detail for the readers to offer advice or feedback. ",
            "The summary is concise and to the point and contains enough info for readers to offer feedback or advice. ",
            "The summary is clear and concise and provides enough detail to be able to offer advice. ",
            "The summary is clear and concise and provides enough context for readers to be able to offer support or advice. ",
            "The summary is concise and to the point and provides enough detail to be able to offer support or advice.",
            "The post is concise and includes the info necessary to provide feedback or advise.",
            "The post is concise and provides enough background info for readers to offer advice or feedback.",
            "The summary is to the point and provides enough information for readers to offer advice or feedback.",
            "The summary is concise and to the point and provides enough detail to be able to offer advice.",
            "The summary is clear and to the point and provides the main points necessary to offer feedback and advice.",
            "The summary is clear and to the point. It provides enough detail to be able to offer advice.",
            "The summary is clear and includes the most pertinent parts of the post to be able to provide feedback or advice.",
            "The summary is clear and to the point and provides the pertinent info for readers to provide feedback or advice.",
            "The summary is concise and includes enough information necessary to offer feedback or advice.",
            "The summary is concise and to the point and contains the pertinent information of the post.",
            "The summary is concise and offers good coverage of what is covered in the post. ",
            "The summary is concise and to the point and offers enough information to be able to offer feedback or advice to the poster. ",
            "The summary is concise and to the point and offers information to be able to offer support or advice. "
          ],
          "description2taxonomy": {}
        },
        "suggests improvements or additions; specifically, the feedback offers recommendations on how to enhance the text, such as adding missing information or clarifying certain points. For example, 'the summary could mention the author's struggle with maintaining boundaries while being supportive.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=-3564765527161701090",
          "description": "suggests improvements or additions; specifically, the feedback offers recommendations on how to enhance the text, such as adding missing information or clarifying certain points. For example, 'the summary could mention the author's struggle with maintaining boundaries while being supportive.'",
          "texts": [
            "The summary is really short and concise, but could include some background details about being abused by the boyfriend and that he keeps using drugs. ",
            "The summary is strong but lacks an important detail (that the author and boyfriend are only in the open relationship due to distance). ",
            "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
            "This is a great summary and the only thing I would add is that she's upset he lied before.",
            "This is good but can include that they drink for social anxiety but that's not a good solution.",
            "The summary is strong but would be better phrased if the question was \"Are these thoughts ok and should I bring them up?\" ",
            "The summary misses the details (that the author saw herself forced to break up with her boyfriend, but has seen other couples get back together) ",
            "The summary is strong but could also mention that the author isn't socially incompetent, just doesn't know where to start. ",
            "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
            "The summary should mention that the author is looking for advice on what to do. ",
            "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
            "This is accurate, but it could have mentioned the author believes his friend should try to move on.",
            "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
            "This is accurate but it could have mentioned values were questioned.",
            "The summary is lacking in details (the girlfriend promising to not talk to the ex but continuing to do so). ",
            "The summary is clear and well written but could include some details around their living situation too.",
            "The summary left out that she eventually did put the brakes on the relationship to focus on herself.",
            "The summary is a little vague and should include a couple of details about why their life is falling apart."
          ],
          "description2taxonomy": {}
        },
        "discusses the summary's representation of the original post's intent; specifically, the feedback comments on how well the text captures the main question or goal of the post. For example, 'The summary covers the main question that was posed in the post.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=-3090265119102481569",
          "description": "discusses the summary's representation of the original post's intent; specifically, the feedback comments on how well the text captures the main question or goal of the post. For example, 'The summary covers the main question that was posed in the post.'",
          "texts": [
            "The summary covers the main question poised in the post.",
            "This is accurate and it covers all of the main points.",
            "This is an acccurate account of what was written in the post",
            "This covers the main point in the post",
            "The summary does a good job of summing up the main point of the post.",
            "The summary should mention that the author is looking for advice on what to do. ",
            "The summary should mention that the author wants to know why potential partners keep passing him over.",
            "The summary covers the main question that was posed in the post.",
            "This summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main point of the post.",
            "The summary adequately covers the main point made in the post.",
            "The summary does a good job of summing up the main point of the post.",
            "This covers the main point of the post",
            "This summary is a good representation of the main points made in the post.",
            "The summary covers the main question asked in the post.",
            "The summary does a good job of capturing the main point of the post."
          ],
          "description2taxonomy": {}
        },
        "praises the summary's accuracy; specifically, the feedback acknowledges the correct and faithful summarization of the original post. For example, 'this is an accurate account of what was written in the post.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=-7473410473195724182",
          "description": "praises the summary's accuracy; specifically, the feedback acknowledges the correct and faithful summarization of the original post. For example, 'this is an accurate account of what was written in the post.'",
          "texts": [
            "This is an accurate account of what was in the post.",
            "This is an accurate summary of the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "This is accurate and it covers all of the main points.",
            "This is an acccurate account of what was written in the post",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points made in the post.",
            "This summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main points presented in the post.",
            "The summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the main point of the post.",
            "This is an accurate post that covers the main points.",
            "The summary is a good representation of the main points made in the post.",
            "This is an accurate summary of the post",
            "This is an accurate summary of what was in the post.",
            "This is an acccurate account of what was written in the post.",
            "The summary is a good representation of the main points made in the post.",
            "This summary is a good representation of the main points made in the post.",
            "The summary is a good representation of the points made in the post.",
            "The summary does a good job of capturing the main point of the post."
          ],
          "description2taxonomy": {}
        },
        "mentions repetition; specifically, the feedback indicates that some content appears more than once or is redundant. For example, 'the summary repeats a few points, which could be consolidated for better flow.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=-1486670096753707826",
          "description": "mentions repetition; specifically, the feedback indicates that some content appears more than once or is redundant. For example, 'the summary repeats a few points, which could be consolidated for better flow.'",
          "texts": [],
          "description2taxonomy": {}
        },
        "focuses on organization; specifically, the feedback points to the structure and logical flow of the text. For example, 'the summary is well-organized, making it easy to understand the main points.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=1165613237877281371",
          "description": "focuses on organization; specifically, the feedback points to the structure and logical flow of the text. For example, 'the summary is well-organized, making it easy to understand the main points.'",
          "texts": [
            "The summary is clear and concise and provides the main points of the post. ",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary is concise and to the point and provides enough detail to be able to provide advice or feedback to the poster. ",
            "The summary does a good job of summing up the main points of the post.",
            "The summary is clear and concise and contains the main points of the post. ",
            "The summary does a good job of summing up the main points of the post.",
            "This is accurate and it covers all of the main points.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "This summary is a good representation of the main points made in the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary is a good representation of the main points presented in the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary is clear and to the point and provides the main points necessary to offer feedback and advice.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "This summary is a good representation of the main points made in the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post.",
            "The summary does a good job of summing up the main points of the post."
          ],
          "description2taxonomy": {}
        },
        "considers comprehensiveness; specifically, the feedback evaluates how thoroughly the text covers the subject or topic. For example, 'the summary provides a complete overview of the post, leaving nothing important out.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=2921621416795491300",
          "description": "considers comprehensiveness; specifically, the feedback evaluates how thoroughly the text covers the subject or topic. For example, 'the summary provides a complete overview of the post, leaving nothing important out.'",
          "texts": [
            "The summary does a good job of covering the main points made in the post.",
            "The summary does a good job of covering the main points made in the post.",
            "The summary does a good job of covering the main points made in the post.",
            "The summary is strong and covers all the key points from the post. ",
            "The summary is strong and covers all the key points from the post. ",
            "The summary is strong and covers all the key points from the post.",
            "The summary adequately covers the main points made in the post.",
            "The summary does a good job of covering the main points made in the post.",
            "The summary adequately covers the main points made in the post.",
            "The summary does a good job of covering the main points made in the post.",
            "The summary is strong and covers all the key points from the post.",
            "This covers all of the points made in the post",
            "This covers all of the main points made in the post.",
            "This is accurate and it covers all of the main points.",
            "This is an acccurate account of what was written in the post",
            "The summary adequately covers the main points made in the post.",
            "The summary does a good job of covering the main points made in the post.",
            "The summary is strong and covers all the key points from the post. ",
            "The summary is strong and covers all the key points from the post. ",
            "The summary is strong and covers all the key points from the post. ",
            "The summary is strong and covers all the key points of the post. ",
            "This summary adequately covers the main points made in the post.",
            "The summary adequately covers the main points made in the post.",
            "The summary does a good job of covering the important points in the post.",
            "The summary does a good job of covering the main points made in the post.",
            "This summary adequately covers the main points made in the post.",
            "This covers all of the relevant points.",
            "The summary does a good job of covering the main points made in the post.",
            "This is an accurate summary of the post",
            "This covers all of the points mentioned in the post.",
            "This summary adequately covers the main points made in the post.",
            "This sums up all of the main points.",
            "This covers the main point of the post",
            "The summary is concise and offers good coverage of what is covered in the post. ",
            "This summary adequately covers the main points made in the post."
          ],
          "description2taxonomy": {}
        },
        "suggests improvements for coherence; specifically, the feedback advises on ways to improve the logical flow and organization of the text. For example, 'The summary would be better if the arguments were presented in a more structured manner.'": {
          "node_name": "root_id=0_node=-3073219986958380156_node=-5496827514449325842",
          "description": "suggests improvements for coherence; specifically, the feedback advises on ways to improve the logical flow and organization of the text. For example, 'The summary would be better if the arguments were presented in a more structured manner.'",
          "texts": [],
          "description2taxonomy": {}
        }
      }
    },
    "comments on the emotional or personal aspect; specifically, the feedback touches on matters related to feelings, relationships, or character traits within the text. For example, 'The summary should include the friend blows her off often and does not show respect. She is asking if there are other options or if she should drop her.'": {
      "node_name": "root_id=0_node=8144624652983235416",
      "description": "comments on the emotional or personal aspect; specifically, the feedback touches on matters related to feelings, relationships, or character traits within the text. For example, 'The summary should include the friend blows her off often and does not show respect. She is asking if there are other options or if she should drop her.'",
      "texts": [
        "The summary could include information about the roommate being worried about not having time for him and making uncomfortable comments about hoping to find a man just like him. ",
        "The summary should include information about how her snap score keeps increasing and he is wondering if she is ignoring him as he has recently developed feelings for her. ",
        "The summary should also include how she is contemplating getting back with her ex but fears she will get bored of him again as well.",
        "The summary is really short and concise, but could include some background details about being abused by the boyfriend and that he keeps using drugs. ",
        "The summary should include she doesn't know if this is worth bringing up and doesn't want to fish for compliments, but she is feeling lonely and depressed in the relationship. ",
        "The summary should include she is worried about getting bad grades because all she can focus on is him, but it's their last year of high school and grades do matter. ",
        "The summary should include that the poster is hoping to remain friends with her and show her why she fell in love with him in the first place as he still loves her. ",
        "The summary should include how the user feels like they are not entitled to be upset about the breakup because they were the one who initiated it.",
        "The summary should include that she has a boyfriend, and he is scared of telling her that he likes her and being rejected. ",
        "The summary should include that he is unsure if she wants to see him or if these are just excuses for not seeing him. ",
        "The summary should also include how the user is in a long term relationship and it has become very stressful.",
        "The summary should include information about the poster wanting to work on the relationship but has set boundaries and will leave if she doesn't hold up her side of the deal. ",
        "The summary should also include how the boyfriend seemingly ignores her on weekends and she just wants a quick check in text.",
        "The summary should include that he confessed his feelings but they weren’t reciprocated.",
        "The summary doesn't point out that M also pressured C into taking advanced courses, and C has also become distant from the author. ",
        "The summary should include how she still has feelings for him but the timing has never been right.",
        "The summary should also include how they haven’t been able to find joy in anything since their wife kicked them out.",
        "The summary should include that the poster thinks he might fall into the polyamory category as he has felt this way with both serious relationships he's been in. ",
        "The summary does not mention that recently they have been getting into a lot of fights over stupid things.",
        "The summary should also mention how he is also starting to neglect spending time with her as well.",
        "I think this should include they feel like they are holding her back, but don't want to break up.",
        "The summary should mention that she can pay for her own ring but is worried he will feel emasculated by that.",
        "This is a great summary and the only thing I would add is that she's upset he lied before.",
        "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
        "The summary left out details about he just getting out of a relationship and not being ready for something so committed.",
        "I think this should include that he ignores her texts and takes their relationship too seriously.",
        "The summary should also include details about how they feel they are regressing in the process of trying to get over their ex.",
        "The summary should include information about him sharing he has anxiety and he was paranoid and that's why he broke up with her. ",
        "The summary is not exactly accurate; the wife is not feeling down at the moment; she states that whenever she is upset about something, her husband is dismissive of her feelings.",
        "The summary doesn't mention that the friends and family think the author would make her happier than her fiancé does. ",
        "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
        "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
        "The summary leaves out details regarding the user’s fears that she will never talk to the guy again.",
        "The summary should include details about how she never wants to text or talk to him and she keeps saying she’ll be by to see him but never shows up.",
        "The summary should also include how she was treated poorly for many years and they even had a break in the middle of their relationship.",
        "The summary should include he is worried about developing feelings for her again so wants to know if he should cut things off.",
        "The summary is somewhat misleading as it leads the reader to believe that the author is worried about how he will emotionally react if things progress with the girl. However, the girl has stated that she has a boyfriend and so the author will not pursue anything further with her. Instead, he refers to his reaction at just holding her hand for minute and that if he cried tears of joy for fifteen minutes at just holding hands how is he going to react if he pursues something with someone who is actually interested?",
        "This is accurate, but it could have mentioned the author believes his friend should try to move on.",
        "The summary does not mention that the poster's fiancee brushes it off when she asks him about it.",
        "The summary should include the friend blows her off often and does not show respect. She is asking if there are other options or if she should drop her.",
        "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with.",
        "The summary should include that she is feeling left out because they have hung out without her and she is upset about it.",
        "The summary could include information about helping her with stress relief in finding the gym and wanting to know if the friendship is forced now.",
        "The summary could include information about the poster looking for advice on how to move forward with her boyfriend.",
        "The summary should include she realized she does love him and wants to work it out but hopes he will forgive her.",
        "The summary left out that she eventually did put the brakes on the relationship to focus on herself.",
        "The summary should also mention how the girlfriend doesn’t stay true to her word when she goes out drinking with friends.",
        "The post should include that the girl likes the guy now and wants to date but they are graduating college soon and will be moving to different areas and wonder if they should try it. "
      ],
      "description2taxonomy": {
        "suggests addressing emotional conflicts or dilemmas; specifically, the feedback highlights the significance of outlining the emotional struggles and difficult choices faced by characters within the text. For example, 'The summary should present the protagonist's inner conflict between love and loyalty.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=-3098881345988841122",
          "description": "suggests addressing emotional conflicts or dilemmas; specifically, the feedback highlights the significance of outlining the emotional struggles and difficult choices faced by characters within the text. For example, 'The summary should present the protagonist's inner conflict between love and loyalty.'",
          "texts": [
            "The summary should also include how she is contemplating getting back with her ex but fears she will get bored of him again as well.",
            "The summary should include she doesn't know if this is worth bringing up and doesn't want to fish for compliments, but she is feeling lonely and depressed in the relationship. ",
            "The summary should include she is worried about getting bad grades because all she can focus on is him, but it's their last year of high school and grades do matter. ",
            "The summary should include that he is unsure if she wants to see him or if these are just excuses for not seeing him. ",
            "The summary should include how she still has feelings for him but the timing has never been right.",
            "I think this should include they feel like they are holding her back, but don't want to break up.",
            "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
            "The summary should also include details about how they feel they are regressing in the process of trying to get over their ex.",
            "The summary should include he is worried about developing feelings for her again so wants to know if he should cut things off.",
            "The summary should include she realized she does love him and wants to work it out but hopes he will forgive her."
          ],
          "description2taxonomy": {}
        },
        "emphasizes character traits or personal qualities; specifically, the feedback requests the addition or clarification of details about an individual's personality or behavior. For example, 'the summary should mention that the protagonist is known for being stubborn and unwilling to ask for help.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=6026806358413973747",
          "description": "emphasizes character traits or personal qualities; specifically, the feedback requests the addition or clarification of details about an individual's personality or behavior. For example, 'the summary should mention that the protagonist is known for being stubborn and unwilling to ask for help.'",
          "texts": [
            "The summary should include information about him sharing he has anxiety and he was paranoid and that's why he broke up with her. ",
            "The summary should include details about how she never wants to text or talk to him and she keeps saying she’ll be by to see him but never shows up."
          ],
          "description2taxonomy": {}
        },
        "mentions unreciprocated feelings; specifically, the feedback discusses situations where one individual expresses their feelings or interest and the other does not reciprocate. For example, 'The summary should include that he confessed his feelings but they weren't reciprocated.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=1190362003115300999",
          "description": "mentions unreciprocated feelings; specifically, the feedback discusses situations where one individual expresses their feelings or interest and the other does not reciprocate. For example, 'The summary should include that he confessed his feelings but they weren't reciprocated.'",
          "texts": [
            "The summary should include that the poster is hoping to remain friends with her and show her why she fell in love with him in the first place as he still loves her. ",
            "The summary should include that she has a boyfriend, and he is scared of telling her that he likes her and being rejected. ",
            "The summary should include that he confessed his feelings but they weren’t reciprocated.",
            "The summary should make it clearer that the author confessed her feeling first, not the other way around. "
          ],
          "description2taxonomy": {}
        },
        "notes seriousness of relationship; specifically, the feedback comments on the commitment level or intensity within a relationship described in the text. For example, 'the summary should include that he ignores her texts and takes their relationship too seriously.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=-823730515111226480",
          "description": "notes seriousness of relationship; specifically, the feedback comments on the commitment level or intensity within a relationship described in the text. For example, 'the summary should include that he ignores her texts and takes their relationship too seriously.'",
          "texts": [
            "The summary should also include how the user is in a long term relationship and it has become very stressful.",
            "I think this should include that he ignores her texts and takes their relationship too seriously."
          ],
          "description2taxonomy": {}
        },
        "highlights relationship dynamics; specifically, the feedback focuses on interactions and power imbalances between individuals within a relationship context. For example, 'the summary should include that the poster's fiancee brushes it off when she asks him about it.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=-2370500910321842277",
          "description": "highlights relationship dynamics; specifically, the feedback focuses on interactions and power imbalances between individuals within a relationship context. For example, 'the summary should include that the poster's fiancee brushes it off when she asks him about it.'",
          "texts": [
            "The summary should include she doesn't know if this is worth bringing up and doesn't want to fish for compliments, but she is feeling lonely and depressed in the relationship. ",
            "The summary should include how the user feels like they are not entitled to be upset about the breakup because they were the one who initiated it.",
            "The summary should also include how the boyfriend seemingly ignores her on weekends and she just wants a quick check in text.",
            "The summary should also mention how he is also starting to neglect spending time with her as well.",
            "The summary should mention that she can pay for her own ring but is worried he will feel emasculated by that.",
            "The summary is not exactly accurate; the wife is not feeling down at the moment; she states that whenever she is upset about something, her husband is dismissive of her feelings.",
            "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with."
          ],
          "description2taxonomy": {}
        },
        "suggests potential actions or decisions; specifically, the feedback offers alternatives or discusses the consequences of potential choices in the situation. For example, 'the summary could include information about the poster looking for advice on how to move forward with her boyfriend.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=-8821990230630925669",
          "description": "suggests potential actions or decisions; specifically, the feedback offers alternatives or discusses the consequences of potential choices in the situation. For example, 'the summary could include information about the poster looking for advice on how to move forward with her boyfriend.'",
          "texts": [
            "The summary should include information about the poster wanting to work on the relationship but has set boundaries and will leave if she doesn't hold up her side of the deal. ",
            "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
            "This is accurate, but it could have mentioned the author believes his friend should try to move on.",
            "The summary should include the friend blows her off often and does not show respect. She is asking if there are other options or if she should drop her.",
            "The summary could include information about the poster looking for advice on how to move forward with her boyfriend.",
            "The post should include that the girl likes the guy now and wants to date but they are graduating college soon and will be moving to different areas and wonder if they should try it. "
          ],
          "description2taxonomy": {}
        },
        "addresses personal growth; specifically, the feedback pertains to an individual's personal development or journey, as related to the situation described. For example, 'the summary should mention that the poster is exploring the possibility of being polyamorous.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=-8657137654006992822",
          "description": "addresses personal growth; specifically, the feedback pertains to an individual's personal development or journey, as related to the situation described. For example, 'the summary should mention that the poster is exploring the possibility of being polyamorous.'",
          "texts": [
            "The summary should include that the poster thinks he might fall into the polyamory category as he has felt this way with both serious relationships he's been in. ",
            "The summary should include the poster is having a hard time accepting this and wonders what they should do.",
            "The summary left out that she eventually did put the brakes on the relationship to focus on herself."
          ],
          "description2taxonomy": {}
        },
        "requests additional backstory or context; specifically, the feedback asks for more information to help readers better understand the emotions and motivations of characters. For example, 'Providing more context about the main character's past would help to explain their emotional reactions throughout the story.'": {
          "node_name": "root_id=0_node=8144624652983235416_node=-6849415459990350274",
          "description": "requests additional backstory or context; specifically, the feedback asks for more information to help readers better understand the emotions and motivations of characters. For example, 'Providing more context about the main character's past would help to explain their emotional reactions throughout the story.'",
          "texts": [
            "The summary could include information about the roommate being worried about not having time for him and making uncomfortable comments about hoping to find a man just like him. ",
            "The summary is really short and concise, but could include some background details about being abused by the boyfriend and that he keeps using drugs. ",
            "The summary doesn't point out that M also pressured C into taking advanced courses, and C has also become distant from the author. ",
            "The summary should also include how they haven’t been able to find joy in anything since their wife kicked them out.",
            "The summary does not mention that recently they have been getting into a lot of fights over stupid things.",
            "The summary left out details about he just getting out of a relationship and not being ready for something so committed.",
            "The summary doesn't mention that the relationship was going well for the author, and that they had plans together. ",
            "The summary leaves out details regarding the user’s fears that she will never talk to the guy again.",
            "The summary should also include how she was treated poorly for many years and they even had a break in the middle of their relationship.",
            "The summary captures most of what the author is trying to convey but misses the aspect that he is not the only one competing for her affection. It is important to note that she states that she can see herself with several of her guy friends and he points out one in particular that she flirts with in front of him. This rounds out the picture of her behavior and can give the reader a better understanding of what the author is contending with."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "indicates distance or travel; specifically, the feedback notes the relevance of physical distance or travel time in the text. For example, 'Girl lives over 4 hours away.'": {
      "node_name": "root_id=0_node=4900596208419403343",
      "description": "indicates distance or travel; specifically, the feedback notes the relevance of physical distance or travel time in the text. For example, 'Girl lives over 4 hours away.'",
      "texts": [
        "I think this could include that they are living on the west coast, so the readers know how far 'east' is.",
        "The summary should also include how they will be long distance from each other while attending school.",
        "Girl lives over 4 hours away",
        "She lives far away and can't be there with him."
      ],
      "description2taxonomy": {}
    },
    "highlights ambiguity or vagueness; specifically, the feedback points out that the text is unclear, confusing, or not specific enough. For example, 'The sentence about their relationship could be clearer, as it's not obvious what the fuzzy feeling means.'": {
      "node_name": "root_id=0_node=1914262251695763814",
      "description": "highlights ambiguity or vagueness; specifically, the feedback points out that the text is unclear, confusing, or not specific enough. For example, 'The sentence about their relationship could be clearer, as it's not obvious what the fuzzy feeling means.'",
      "texts": [
        "The summary should include she doesn't know if this is worth bringing up and doesn't want to fish for compliments, but she is feeling lonely and depressed in the relationship. ",
        "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
        "The summary seems to only cover half of the backstory and does not cover the author's current dilemma. Realizing that her parents weren't going to let her date, he decided to move on but he did not his best friend and she found out through a Facebook relationship status update. He has been thinking about her lately but does not know whether to contact her because his old feelings for her might resurface which would jeopardize his current relationship.",
        "The summary should include that he is unsure if she wants to see him or if these are just excuses for not seeing him. ",
        "The summary doesn't indicate the the author is split between breaking up now, or waiting and enjoying the time they have together. ",
        "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
        "The post indicates that the author believes his girlfriend lied but doesn't explicitly state so, as he himself in unsure if she did. ",
        "This is missing key information, like the fear the author has of damaging their career.",
        "We are all currently single and looking for new roommates is false. Also the post is very vague",
        "The summary is too vague.",
        "The summary is a little too vague.",
        "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
        "Husband has given veto power is a confusing statement. ",
        "The last sentence is unclear and hard to follow.",
        "The summary is a little too vague.",
        "The summary is too vague.",
        "The summary is too vague.",
        "The summary is not very coherent.",
        "The summary is disjointed, confusing and incoherent.",
        "The summary is too vague.",
        "The summary is confusing as the two sentences kind of contradict one another.",
        "The summary is too vague.",
        "The summary is written in a confusing way because you cannot tell who is referring to who.",
        "This summary of the post is unclear because it cuts off at the end.",
        "The summary is too vague.",
        "The summary is very vague and doesn’t talk about how the person only feels attraction to people when they get to know them better.",
        "The summary is too vague.",
        "The summary is a little vague and should include a couple of details about why their life is falling apart.",
        "The summary is too vague."
      ],
      "description2taxonomy": {
        "highlights incomplete or cut-off sentences; specifically, the feedback notes instances where the text appears to end abruptly or without a proper conclusion. For example, 'This sentence seems to cut off before the point is made, making it impossible to understand the author's intention.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=-5609414102622787177",
          "description": "highlights incomplete or cut-off sentences; specifically, the feedback notes instances where the text appears to end abruptly or without a proper conclusion. For example, 'This sentence seems to cut off before the point is made, making it impossible to understand the author's intention.'",
          "texts": [
            "This summary of the post is unclear because it cuts off at the end."
          ],
          "description2taxonomy": {}
        },
        "highlights uncertainty in the text; specifically, the feedback identifies instances where the text seems unsure or uncertain, thus creating confusion. For example, 'the post indicates the author believes their girlfriend lied, but it doesn't explicitly state so, making it ambiguous.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=1434834168671872929",
          "description": "highlights uncertainty in the text; specifically, the feedback identifies instances where the text seems unsure or uncertain, thus creating confusion. For example, 'the post indicates the author believes their girlfriend lied, but it doesn't explicitly state so, making it ambiguous.'",
          "texts": [
            "The summary should include she doesn't know if this is worth bringing up and doesn't want to fish for compliments, but she is feeling lonely and depressed in the relationship. ",
            "Given that there is not a date for reference I am not sure that the word recently applies. This is an update and he has been with this girl for at least some period of time but the ambiguity of the timeline does make it confusing as to the exact specified period of time. That being said, the summary seems to be on point but does miss the part where the author is seeking advice and comments on the situation.",
            "The summary should include that he is unsure if she wants to see him or if these are just excuses for not seeing him. ",
            "The post indicates that the author believes his girlfriend lied but doesn't explicitly state so, as he himself in unsure if she did. ",
            "The summary is confusing as the two sentences kind of contradict one another."
          ],
          "description2taxonomy": {}
        },
        "points out insufficient detail; specifically, the feedback suggests that the text lacks necessary information to fully understand the topic. for example, 'the summary could include information about the main character's background to provide context.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=7397513772747110528",
          "description": "points out insufficient detail; specifically, the feedback suggests that the text lacks necessary information to fully understand the topic. for example, 'the summary could include information about the main character's background to provide context.'",
          "texts": [
            "The summary seems to only cover half of the backstory and does not cover the author's current dilemma. Realizing that her parents weren't going to let her date, he decided to move on but he did not his best friend and she found out through a Facebook relationship status update. He has been thinking about her lately but does not know whether to contact her because his old feelings for her might resurface which would jeopardize his current relationship.",
            "The summary doesn't mention that the author is specifically asking about maintaining good boundaries while being supportive. ",
            "This is missing key information, like the fear the author has of damaging their career.",
            "The summary is a little too vague.",
            "The summary is a little too vague.",
            "The summary is a little vague and should include a couple of details about why their life is falling apart."
          ],
          "description2taxonomy": {}
        },
        "comments on lacking examples; specifically, the feedback suggests that the text would benefit from relevant examples or case studies to better illustrate the points. For example, 'The text could provide real-life instances of how this policy has been implemented.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=6172113615819904288",
          "description": "comments on lacking examples; specifically, the feedback suggests that the text would benefit from relevant examples or case studies to better illustrate the points. For example, 'The text could provide real-life instances of how this policy has been implemented.'",
          "texts": [],
          "description2taxonomy": {}
        },
        "highlights lack of context or background; specifically, the feedback points out that the text omits necessary contextual information that would help the reader comprehend the subject matter. For example, 'A brief background on the historical events leading up to the story's time period would be helpful for better understanding the context.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=647590295873161650",
          "description": "highlights lack of context or background; specifically, the feedback points out that the text omits necessary contextual information that would help the reader comprehend the subject matter. For example, 'A brief background on the historical events leading up to the story's time period would be helpful for better understanding the context.'",
          "texts": [],
          "description2taxonomy": {}
        },
        "identifies unclear pronoun usage; specifically, the feedback points out ambiguous or confusing pronoun references within the text. For example, 'it's unclear who 'they' refers to in the summary.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=-3785603647692044125",
          "description": "identifies unclear pronoun usage; specifically, the feedback points out ambiguous or confusing pronoun references within the text. For example, 'it's unclear who 'they' refers to in the summary.'",
          "texts": [
            "The summary doesn't indicate the the author is split between breaking up now, or waiting and enjoying the time they have together. ",
            "The summary is written in a confusing way because you cannot tell who is referring to who."
          ],
          "description2taxonomy": {}
        },
        "signals confusion in the text; specifically, the feedback reflects that the reader is having difficulty understanding or interpreting the text's meaning. For example, 'I'm not sure what you're trying to convey in this sentence – can you clarify it?'": {
          "node_name": "root_id=0_node=1914262251695763814_node=-2711031942770880844",
          "description": "signals confusion in the text; specifically, the feedback reflects that the reader is having difficulty understanding or interpreting the text's meaning. For example, 'I'm not sure what you're trying to convey in this sentence – can you clarify it?'",
          "texts": [
            "The summary seems to only cover half of the backstory and does not cover the author's current dilemma. Realizing that her parents weren't going to let her date, he decided to move on but he did not his best friend and she found out through a Facebook relationship status update. He has been thinking about her lately but does not know whether to contact her because his old feelings for her might resurface which would jeopardize his current relationship.",
            "We are all currently single and looking for new roommates is false. Also the post is very vague",
            "Husband has given veto power is a confusing statement. ",
            "The last sentence is unclear and hard to follow.",
            "The summary is not very coherent.",
            "The summary is disjointed, confusing and incoherent.",
            "The summary is confusing as the two sentences kind of contradict one another.",
            "The summary is written in a confusing way because you cannot tell who is referring to who."
          ],
          "description2taxonomy": {}
        },
        "suggests rephrasing for clarity; specifically, the feedback suggests rewording a part of the text to make it more precise or easier to understand. For example, 'the summary should be rephrased to emphasize the importance of emotional connection in the attraction.'": {
          "node_name": "root_id=0_node=1914262251695763814_node=2877438721192152631",
          "description": "suggests rephrasing for clarity; specifically, the feedback suggests rewording a part of the text to make it more precise or easier to understand. For example, 'the summary should be rephrased to emphasize the importance of emotional connection in the attraction.'",
          "texts": [
            "The summary should make it clearer that the author confessed her feeling first, not the other way around. ",
            "The summary is very vague and doesn’t talk about how the person only feels attraction to people when they get to know them better."
          ],
          "description2taxonomy": {}
        }
      }
    }
  }
}