{
  "node_name": "root_id=11",
  "description": "root",
  "texts": [
    "I got to play some xbox!",
    "Finally settling on a permanent home to raise my family.",
    "i brought a new mobile to day morning",
    "I received an old painting that my grandmother did.",
    "Reading my daughter her bed time story and then putting her to bed",
    "I was able to accomplish all the tasks that I was assigned this week at my work, with the last day of completion being today.",
    "I haven't spent anytime with my wife during the past week due to her being a nurse and working 18 hour shifts. I finally got a chance to see her and we got to have breakfast this morning. Even though it wasn't that long, we got the chance to talk and see how each of us were doing.",
    "I enjoyed playing badminton event yesterday with many participants across the city and i was very happy to have got second place ion that event",
    "My daughter came home from school today without any negative remarks from the teacher written in her folder.",
    "My husband got a sizable raise at work.",
    "My dog had a litter of puppies.",
    "Yesterday, I met my college freinds and we had party in a pub.",
    "When I made a special dinner for my wife last night to make her feel better after a rough day at work. Her saying thank you really made my day.",
    "My daughter woke up from her nap, and after making eye contact with me let out the biggest sigh of happiness paired with a smile.",
    "Watching cricket in the cricket stadium full of huge crowd for the first and team that I'm supporting wins the match.",
    "So long network error of our institution got rectified and we enjoyed the full speed internet connection",
    "I went to see the parade for the local high school basketball team champions in our town.",
    "I rode my bike to the park with my other son.",
    "Seeing my daughter excited about going to her school's Father-Daughter dance was really nice. We have had custody issues the last year and seeing their bond these days is just wonderful. It warms my heart to know she has the father she truly deserves.",
    "My husband made delicious chocolates again.",
    "I was making jewelry for almost a year now and recently I opened a page and started selling it.",
    "I visited Kennedy Space Center for the first time ever.",
    "I was able to repair my irrigation sprinkler system by myself which made me feel great and save a bunch of money.",
    "I visited a friend who I hadn't seen in many years.",
    "Getting to play a new board game and winning",
    "My dog is pregnant.",
    "After work, I ordered some take-out online and it got to my apartment within 20 minutes, far faster than expected.",
    "I got a check from massSave for a rebate on my new furnace.",
    "I played with my daughter before her bedtime.",
    "My husband bought me delicious coffee, dark, but not upsetting to my stomach.",
    "I took a trip to Indianapolis with some very good friends and had an amazing time. Just getting away from everyday life and enjoying it with your buddies makes trips like this worth it.",
    "I managed to master twenty yards on the range as an instinctive re-curve archer.",
    "Watching an ASMR Youtube video after getting home from work.",
    "It made me happy when I was able to surprise my boyfriend on his birthday. It made me happy seeing him happy.",
    "We live on a small island and away from my extended family. My brother comes down to visit us quite often and what made me happy was when he came down to visit us in April and the kids jumped into his arms at the airport, almost knocking him down. To see the joy on their face during his visit and how happy they were in turn made me very happy. I was also happy because I was spending time with one of my best friends.",
    "I won a contest at my job for top sales.",
    "Watching a sign painter paint today.",
    "I was happy when my sister stayed with me over spring break.",
    "Yesterday, I woke up to a phone call from an HR employee at a company I just applied for. They were calling me for a second interview. It's for a job that I really want, so it's super exciting.",
    "I had a really nice hug with my roommate.",
    "Relaxing, watching videos and smoking a cigar",
    "My Dungeons and Dragons character, Lyssandra the Rogue, hit level five!",
    "Starting to play Hearthstone again made me happy.",
    "I got paid today from a new job",
    "Thunderstorms have been going on for part of the day. I find the sound of distant thunder and the fall of rain very peaceful. Even though its been dark and dreary most of the day. I've felt happy and calm due to the sounds.",
    "My grandmother visited me after work and we spent time together laughing and telling stories.",
    "We had a week off for spring break. My kids both had the same week off and I did from my school job as well so we were all together.",
    "I received a promotion at work about a month ago.",
    "I was happy when I found out my nephew is coming to visit me for a week for Spring Break.",
    "in last three months my daughter win in running competition.i am very happy that day.",
    "My brother fixed my air conditioner and saved me money.",
    "My daughter started saying my baby daughters name.",
    "I was accepted into a Masters program that I applied to.",
    "DELUDED TO CHANGE MY LIFE STYLE",
    "Do you seek moments in life to be happy? We all do. We all are finding the reasons to celebrate and enjoy. Some of us find happiness while watching TV after a day off. Some of us have weekend plans to enjoy. However, with the time we are forgetting enjoying in daily life. We are scheduling our happiness on certain conditions. Until we catch a big event or achievement, we keep waiting to enjoy. We just let time pass until then. Therefore, we all live waiting for some happy moments in life. We forget that there could be life in each moment.",
    "Went on a great date with this amazing girl I met.",
    "I decided to play a video game with a friend online; I had a lot of fun and that made me really happy.",
    "I had a delicious dinner with my girlfriend last night.",
    "My wife came home with Schwarma Express for Supper, I was happy to have my favorite food on a day where I am already happy for not having to go to work.",
    "I bought a new summer dress.",
    "My cats lounging around with me made me pretty happy.",
    "I got to spent the first part of my day working in a coffee shop since the train delays were so bad.",
    "I received new shoes from my nephew as a gift.",
    "I went out with my family to eat pizza.",
    "Had a delicious dinner.",
    "I got to work with kids at a day camp.",
    "my best friend last month gone to singapore",
    "I started saying \"No\" to people so I don't feel as stressed.",
    "Got holiday from job and spend quality of time with family",
    "We went to look at cars today and found the perfect fit.",
    "I went to a pre-summer retreat last week, I was glad to get out and socialize with others. This really made me happy because I meet new people and did not feel lonely for the next couple of days, I am still in contact with people from the camp.",
    "I could finally eat at my favourite restaurant after a long time.",
    "My daughter had a signing performance last week. She's 11 and had to dress up for this performance. She was the most beautiful one on stage and did great. Seeing her perform made me happy.",
    "My family is finally helping me pack for the move. I've been getting the house ready to move for what seems like a month now and no one was helping me but now that it sold - they are all helping me and doing what I tell them to.",
    "I finished my workout this morning and felt energized.",
    "I moved to a new home!",
    "My daughter got accepted in a preschool program we wanted to put her in.",
    "An old patient of mine sent me a little note for Nurses Week on Facebook and that is what made me happy.",
    "Yesterday night i talked with my girlfriend Keerthana up to more than 5 hours i was spoke with her. Both of us understood everything very well. We made for each other. I was so happy. Moving forward surely i will speak with her daily. I'm very happy about this.",
    "I surpassed a level in a video game that I hadn't previously reached.",
    "I was excited and happy when I found out my daughter got engaged.",
    "We found out that our very sick cat was going to be okay, after we thought for sure he wasn't going to make it.",
    "I finally started back into my lifting routine after I took a month off. 6 days a week now and feel so great to stay healthy.",
    "I took my son to a doctor's appointment last week regarding his ADHD treatment. The doctor prescribed a new medication and we are already having great results. I'm happy to see my son behaving better and I know he's happier too.",
    "I met my adopted brother who left the country long ago just last week.",
    "Going to an indoor water park with my kids.",
    "I finished MTurking earlier and realized I had accrued $70 total.",
    "I ate some sushi at my favorite restaurant on half-off sushi rolls day.",
    "i went to celebrate birthday party of my friend",
    "After a long work week, I finally relaxed at home with my wife with dinner and a movie (Office Christmas Party).",
    "My son's board exam results came last week and was happy to see that he has scored very good marks.",
    "my sister located in bangalore. we are going that state .we are fully enjoyed.",
    "Completing a migration to the Slim microframework of a PHP-based web app.",
    "I finished an important legal matter that took months to complete",
    "I had a nice midnight bike ride with the whole road to myself.",
    "After having a nice meal for dinner when I was very hungry because I did not get the chance to have a full lunch today.",
    "I was able to self evaluate myself and received a substantial cost of living adjustment from my supervisor at work.",
    "I went jogging and felt great!",
    "I spent a simple evening with my husband watching a TV show and caressing his hair while doing so.",
    "Just bought a brand new double stroller! I've been needing one for a while! So now I can go on walks with my kids",
    "Saw the night sky full of stars",
    "I only worked a half day today so I had time to relax at home.",
    "Last week I bought some new comic books and read them.",
    "I lost twenty pounds.",
    "My husband wrote a sweet note to me on our refrigerator that I found when I got home from work one day.",
    "The day my cousins came to visit made me happy.",
    "My wife's car wasn't badly broke down!",
    "Talking to a girl I like made me happy.",
    "Golfing the best round of my life.",
    "Going out for drinks with some old friends and catching up on life.",
    "I finally got to catch up on an old TV show that I had wanted to watch for a few months or so.",
    "I called my debt collection agency and they confirmed they received my payment.",
    "Winning money through the lottery and being able to afford my first vacation in almost 3 years! Very happy and grateful!",
    "My husband let me sleep while he took care of the baby, gave him his bottle and put him to bed.",
    "When I took the trash out this morning I noticed the beautiful spring flowers in bloom in our backyard as well as the neighbor's cherry tree in bloom.",
    "I was able to complete a huge HIT this morning.",
    "My husband surprised me with some really yummy doughnuts from a local bakery.",
    "I started playing a new vide game.",
    "I read some manga.",
    "I finally got my first equity-stake in a private company's revenue that I had invested in today.",
    "I went on a nice hike this weekend.",
    "It was a bit chilly last night going to that soccer game, so I had to grab a jacket I hadn't worn in a while and I found $5 in the pocket! Score!",
    "I recently purchased a house. We closed on it a week ago. It was very stressful during the process, but I have just been so happy since.",
    "My fiancA(c) stayed over from his shift at work so that I could see him.",
    "I went for a long walk up a mountain in a beautiful forested neighborhood near my home.",
    "I found out one of my best friends is moving back to the area where I live.",
    "Cleaning up the outside of the house and making it look really beautiful.",
    "My best friend asked me if I could be in charge of planning her baby's gender reveal party.",
    "I cooked a nice steak dinner that turned out perfectly.",
    "I won a construction contract after a long and determined struggle.",
    "I went hiking in Yosemite National Park and I got to see waterfalls, mountains, and snow. It mad me extremely happy.",
    "I was able to finally diagnose and fix my tractor's leaking transmission seal after 2 years of agony.",
    "My boss took me out for lunch today and paid for it.",
    "Cooking with parents, singing (to piano or records) with parents, watching tv with them and making fun of stupid things, playing cards, playing Frisbee, taking care of animals... There's no way to tell what will stick, so there's no way to orchestrate one thing to stick. Just enjoying each other's company doing the normal business of life is enough.",
    "I pulled myself out of my depression and decided to make the most of my day off by being productive and committing to it.",
    "My jewelry making supplies arrived!",
    "I made an offer on a house that I am ready to do flip and flop.",
    "I went to see my niece's choir concert and it was so great to hear music live again, it really made me feel amazing.",
    "first beautiful event happen in yesterday i come on my office as regularly.duty is running suddenly my hubby give me surprise to come there.he take me for lunch we both spend time together after long time.this was very beautiful happiness time.",
    "Drinking and playing scrabble with my boyfriend a few weeks ago.",
    "i went to see sunset yesterday",
    "I bought tickets to see Elton John live in concert - one of my favorite singers and piano players.",
    "Spending the day with my grandson.",
    "I learned to play a new part of a song on my piano I've been struggling with.",
    "I caught my biggest muskie yet on a fly rod just recently.",
    "My order for six pounds of coffee beans arrived today!",
    "I had one of my favorite italian subs from a local sub shop.",
    "Getting praised for how i do my job from my boss",
    "I watched one of my favorite shows after a hiatus.",
    "I meet my crush after a very long time, and we had a very good and long talk and she agreed for a date. i was so happy.",
    "I got my period which meant I'm not pregnant.",
    "My best friend texted me to tell me about a book he is reading.",
    "Today is my parent's wedding anniversary we celebrate it.",
    "My husband took us to a surprise holiday trip for 5 days",
    "This morning, I was able to work for about 4 hours straight on a project I have been participating in and was able to complete it.",
    "On Thursday nights my boyfriend and I get together with a group of friends at different restaurants to have dinner and drinks and to catch up with each other. It is always a fun night on Thursdays and I look forward to it all week long.",
    "I bought a new house with my fiancee!",
    "I went and worked out at the gym.",
    "I received big hugs and kisses from my children when they got up in the morning.",
    "I was having a bad moment with a tool I recently purchased and was getting frustrated. My youngest daughter came over and softly grabbed my ear from the back. I turned around and she smiled at me. It made me forget about what I was doing and gave me a sense of happiness that I cannot explain.",
    "Yesterday I got the good news that I am gonna be a father again, my wife is pregnant 2nd time. This is very big and good news for me. I am so happy.",
    "My cat was sleeping on me and it made me happy.",
    "I paid off some bills.",
    "I decided to go to a fitness class in the mornings. I went this morning and it's been making me feel amazing all day so far.",
    "I went to Valencia, Spain for four days with my boyfriend.",
    "Watching my boyfriend do the Easter Egg hunt that I set up for him.",
    "Today was such a lovely day. I awoke and made a loaf of cinnamon apple bread for my mother in law. Then a got to run three miles. This was particularly joyous. Then I taught at a third grade classroom, which was really wonderful. I heard from my daughter that she did very well on her interview. Also, I went to a yoga class this afternoon, and it was so relaxing and peaceful. I made sure to give thanks during my meditation time. It has been a glorious day, and I am so happy and grateful.",
    "I got a gift from my friend without any reason.",
    "I found $20 in the pocket of my jeans.",
    "I walked my dog in the woods for twenty minutes.",
    "MY BROTHER BIRTHDAY CELEBRATED IN MY HOUSE",
    "I lost four more pounds.",
    "I was able to find a book I was really wanting to read at the library.",
    "I was very happy when my whole family members attended the get together function in my native place",
    "Won my first chess tournament.",
    "I went to the gym and ran for 20 minutes.",
    "The first day that I took my daughter to Gymnastics made me incredibly happy! I felt like she was making new friends and getting out more than she use to.",
    "I found my aunt that I haven't talked to in over 25 years.",
    "Started a new job as a firefighter",
    "I was able to get a new client for my small business.",
    "I completed training so I can process blood on my own.",
    "My mother quit smoking.",
    "I have been rather sick lately and unable to eat, I was able to eat my favorite meal at my favorite restaurant with my kids and parents.",
    "My sister's fiancee asked me to be one of his groomsmen.",
    "I met a woman with whom I had a long conversation about punk bands in Minneapolis. We talked for hours, reminiscing over the music we loved as young people.",
    "I got an extremely high score on a word video game with one of my friends.",
    "I defeated a boss in a video game I've been playing.",
    "I went for a run in the neighborhood. I enjoyed the perfect weather.",
    "I took a break from work today and feel refreshed.",
    "LAST MONTH MY DAUGHTER FIRST MARK IN THE CLASS AND I WAS VERY HAPPY AND I PRESENTED HER WITH A TEDDY BEAR AND SHE WAS ALSO VERY HAPPY BECAUSE I HAD PROMISED HER IF SHE GOT FIRST MARK IN THE CLASS I WILL GET HER TEDDY BEAR.",
    "I did our budget today, we're going to be okay.",
    "I watched a video of my favorite musical artist on YouTube, and I learned things about them I did not know before.",
    "I arrived home after a 4 hour car trip.",
    "I had a dream about something hilarious and laughed so hard in my dream that when I woke up, I still felt happy and it got my day off to a good start.",
    "I went to my uncle's birthday party.",
    "My wife kiss me today morning that make me sooo happy",
    "I got Korean barbecue from a nearby food cart.",
    "Our mortgage company admitted they made a mistake and sent us a check refund, the check arrived last week.",
    "Last month, I Went out for dinner with my family to a big restaurant and it was a happy moment",
    "I watched a movie with my daughters.",
    "On Valentine's day I got a first date with an absolutely beautiful and intelligent woman. We've been together since. I'm crazy about her. We have a great time and we're fantastic as a couple.",
    "got into a phd program",
    "I got to watch the season finale of Survivor and it was a good episode.",
    "I heard my friend would be coming to visit in a couple of weeks.",
    "I took my mother out to eat for Mother's day.",
    "I got news about a few new work assignments that have me very excited!",
    "I went to a concert last week as a guest on the band's guest list and got to hang out with them before and after the show.",
    "I hit a higher rank in a video game.",
    "My last day of work for the summer was yesterday at my public school job.",
    "I thought my dishwasher was broken, but taking it apart and cleaning it fixed it so I don't have to buy a new one!",
    "Cooking and drinking a wine while I do it",
    "My oldest daughter got a new wheelchair.",
    "I got to reconnect to a good friend with whom I had lost communication because a misunderstood we had.",
    "playing video games with my roommate",
    "My sister came into town and stayed the night.",
    "I finished a book that I've been reading for 2 months.",
    "I got to take my daughter over to my mother in law's house and let her play with her cousins who are visiting this week. I loved seeing her play with them and interact with other kids. They all had a good time.",
    "We watched the movie Guardians of the Galaxy vol 2 together as a family, having a great time at the movie theater.",
    "We watched a dog's purpose",
    "My best friend texted me that she is coming to visit me this weekend! I am super excited for her to arrive today.",
    "The neighbors cat came to visit us again.",
    "I got to grab a drink with coworkers after work.",
    "I was able to get my son everything he wanted for Easter. Easter in our family is like a mini Christmas.",
    "I received a beautiful card from my aunt and her only purpose was to tell me how much she loved me.",
    "I was riding my bike and looking on the ground and I found a $5.00 bill. There is a thrill to find money on the ground.",
    "I felt happy when my daughter won in a state level championship.",
    "My daughter said a new word.",
    "I went out to dinner with my entire family and ate the most delicious peach cobbler for dessert.",
    "I was able to finish a painting I have been working on for many weeks. It is extremely satisfying to see the end result of all my efforts.",
    "I reached level 50 with my girlfriend in Black Desert.",
    "Abby (one of our two doggies) was making noises sounding like a kid complaining and grumbling for being told to be quiet and it sounded really funny.",
    "Recently My sister came to India to Visit us. But For a quite while even before she visiting us, she has been suffering with few pains in her wrist. Initially she thought it was just due to workload. So When She came to India, she consulted our family Doctor . He reported after few scanning that she has Giant Bone Tumor in her hand and Some Organisms have already eaten some part of her bone. So we quickly without any further delay Planned for Operation in which some part of Necessary Bone from leg will be taken and that part will be fixed in hand after removing the tumor she had. Later they thought fixing it with artificial Bone. On the day of Operation,We all family members were waiting outside while her operation was going on. Then Came Doctor and Said they needed Blood ( B+) because of the blood loss she had during operation it was making her hard to breath. I and along with My sister's Brother-in-law Rushed to Blood Bank, I decided to be the Donor , But they initially needed to check my Blood group and all that safety measures which took around 20 Minutes and They Needed Blood Soon and I Quickly Started pumping my Blood Out and Finally Reached the hospital and handed over it to them and the Operation took Place Successfully. Don't Know why but that feeling which I Experienced while Traveling to hospital with my Blood in my Hands to my sister in need of it and",
    "I thought my window fan had broken but I was wrong and it's fine.",
    "Enjoyed a visit at work with some friends that I have not seen in almost a year.",
    "I ran into a friend who offered me career advice once at the end of a long work day",
    "When we returned from the beach,we went to a restaurant for having the dinner.",
    "Me and my husband was finally able to afford a car after going 3 months without transportation.",
    "The weather was great last night.",
    "I and my family went to beach and place some funny game.",
    "Digivolving in a game, I've been working towards that for an hour!",
    "yesterday morning i wrote a mail to my company to get my vacation leave they permitted to leave for 2 days i enjoyed my holidays",
    "I finished my very exhausting research project and satisfactorily presented results.",
    "I had been worried that my fiance hadn't answered my calls all day today when he was at work, so I was ecstatic when I saw him through the door and we realized his phone hadn't been working.",
    "I started planning a vacation for my birthday this year.",
    "MY SISTER-IN-LAW BOUGHT A NEW LAPTOP AND AFTER SHE PRESENTED FOR ME. THAT TIME I FEEL VERY HAPPY.",
    "Completing these HITs. It really makes me reflect back on the positive things that happened in my life and focusing on those rather than the negatives. :)",
    "Some of my relatives come home and we go to beach.",
    "I saw my bike gleaming with drops of rain on it.",
    "My parents came up to my college to attend a choir concert I was performing in. They don't come up to see me very often so it was really nice to have them come.",
    "last month my wife told to me she become pregnant. so i am really happy to heart that all day.",
    "My soon has been extremely constipated, and he finally took a poop.",
    "When I visited my parents and they were happy and healthy.",
    "I watched a great episode of Black Sails. I think it was the series finale and it ended great. There was a decent sense of closure to the whole show.",
    "I was with my whole immediate family while we were doing yard work together, having drinks and talking, it was very enjoyable.",
    "The feral kittens outside were jumping around.",
    "A client that had been looking for a job for several months came into my salon and told me that she found the job of a lifetime.",
    "Found a new series to watch on Netflix.",
    "My son was eating in his high chair last night and was laughing his head off as he kept reaching down to feed the dog.",
    "Me and some friends were playing World of Warships and it was kinda fun.",
    "My little sister and her family came for a two week visit. I got to hold my baby niece for the first time! I am still happy over this event, as they have just left for their new home, so the joy has not left yet.",
    "I figured out a solution to a problem that I was working on at work and saved myself quite a bit of time.",
    "I took my daughters to the store for a little girl time and let the pick out a couple of new outfits for summer.",
    "I went to an Amusement park, and it was a really good time. That made me very happy, because I enjoy having fun, just like anyone else.",
    "I took a drive to the beach for the day because the weather was very nice.",
    "Going home to see my parents for Mother's Day.",
    "I found out the solution to a problem.",
    "My family tour after long time",
    "I celebrate my close friend birthday",
    "My infant daughter smiled at me.",
    "I had an easy commute to work with no traffic, that allowed me to arrive early.",
    "I bought myself a really pretty new scarf.",
    "My girlfriend came over and cuddled with me until we fell asleep.",
    "Finding out I would be graduating a semester earlier than I thought",
    "My co-workers and I were able to finish a work project.",
    "I was happy when I finished taking a test for a job because I think I did well.",
    "I am happy because I got to sleep in, but still woke up early enough to get things done around the house.",
    "When I was in Vancouver, it made me really happy to drink authentic milk tea with the smoothest grass jelly I've ever tasted.",
    "I was experiencing some vehicle malfunctions and I was able to raise enough funds for the repairs.",
    "I have enough leftovers that i dont have to cook dinner tonight",
    "I donated some old games, comic books, and clothes to a charity and helped lessen the amount of junk I have in my apartment while hopefully helping to make some people happy.",
    "This afternoon, I had a conversation with an old friend from high school.",
    "I paid all of the bills for the month so I don't have to worry about them any more.",
    "What made me happy recently was surpassing $300,000 of net worth! It was a normal day, then I got an alert by mobile, and became elated when I saw the message!",
    "I got a free drink at Wawa.",
    "I bought a plane ticket home to see my family.",
    "I went to a music festival with friends.",
    "My dog had been sick and she started feeling better.",
    "I felt happy when I ate dinner and gained a burst of energy.",
    "Got the salary",
    "I was hired for the job I wanted.",
    "Go to eat sushi with my friends",
    "Going out with a group of friends for dinner and drinks.",
    "I hung out with my co-workers and took a break",
    "I attended a birthday party where the magician chose me as the main host in showing all the magic",
    "my life is very beautifull and i am very happy",
    "I finished reading a good book.",
    "Today I feel very happy because I won a soccer game very important for me personally",
    "I won a contest where I received a free television, which I put in my basement.",
    "A new supermarket opened up extremely close to my house, after 8 years of the original building sitting abandoned.",
    "Within the past the months, my life has changed for the better. It has made me happy completely. My husband has been without a job for years now, and having to do things on my own really took a toll on me. Recently he has started working two jobs, and everything is being taken care of at home with his help. This has taken so much stress away that i am able to breath and be happy again.",
    "I had a half of a free day today where I got to be lazy and make money casually.",
    "I went out with some friends to get some food. We originally planned to go to Starbucks but we changed plans at the last minute to go to a local coffee shop. I bought a wrap there and it was surprisingly good! I was happy we changed our destination.",
    "I had a fun chat with my friend on FaceBook.",
    "My wife and I were able to enjoy an evening out eating dinner and shopping for a new vanity at Lowes.",
    "I bought a new computer for a great price that I use to make money and play games on.",
    "During flagging for the March for Science event in my small town of 55,000, I got to watch a steady stream of marchers for 25 minutes...close to 4000 people!",
    "I did well enough at work to get monthly bonus.",
    "I got to watch the Tigers beat the Boston Red Sox in the home opener and they came from behind to do it.",
    "I went to the cherry blossom festival with my girlfriend.",
    "I saw a cardinal (my favorite bird) on my walk yesterday afternoon.",
    "My cat was diagnosed with kidney failure, but through lots of treatment and care, she is recovering. Her vet said it was a miracle!",
    "My happiest moment in my life s......for my 20th birthday my dad presented me a new smart phone surprisingly that day i was so exited....i cant forget that day in my life,that was my first surprise given by my dad..",
    "I drank a bottle of wine with my significant other and watched a movie that we could laugh at.",
    "I finally got accepted to be an Amazon Mechanical Turk worker.",
    "During my grocery shopping trip, I found that my Kroger store was now carrying New York Seltzer water.",
    "A happy moment was when I won a small prize of the lottery. It was not much but it really made me happy.",
    "I saw my dad after not seeing him for a few months.",
    "I ate a home-cooked burrito with a variety of toppings.",
    "my dog name is lakshi. today is my pet birthday. lakshi is so cute our hair is so nice and soft. today, i and my lakshi is so happy.....",
    "i felt happy yesterday when my son gave me a draw.",
    "MY BIRTHDAY APRIL 28",
    "My son got into his choice college and that is super cool",
    "I got a new idea for a book that I'm working on.",
    "I found more episodes to a TV show that I started watching on Netflix.",
    "I thought that I was going to run out of gas in my car but I made it to the gas station just in time.",
    "Got re-hydrated after being very dizzy and tired over the weekend.",
    "I made a coffee table for my new apartment. I took wood crates and varnished them and drilled them together. It came out beautiful.",
    "My daughter took my Christmas tree down so it wouldn't be up on April Fools Day.",
    "I was given a 5-star rating from a customer on a transcribing job.",
    "A close friend who has been looking for a job for a long while just got called for an interview for a job of interest to her.",
    "MY UNCLE LIVED IN MUMBAI WHEN I RECEIVE A CALL FROM MY UNCLE I REALLY FELT HAPPY.....",
    "Our ducks at the pond had nine babies yesterday and they are swimming around the pond.",
    "when i found some errand money in my pocket",
    "Regulating my sleep schedule",
    "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
    "I talked to a new friend on the internet and he donated to my girlfriend's stream so we could go to a restaurant.",
    "I was riding my bike to college while a gust of wind blew over the trees and rained dew.",
    "Last month we reach to ooty its too good place to enjoy with family we enjoyed a lot there",
    "I played in a basketball tournament today and my team won both of our games.",
    "I felt that I would not get better marks in that because, from 10th I studied in urdu medium but BA was in kananda medium. But I didn't get nervous I studied harder I struggle more and practice more at the end I got highest marks in that. so it is the most happiest moment in my life according to me.",
    "An event that made me happy was spending time with my cat who was purring on my chest.",
    "Picking out things for the new baby",
    "Getting to go on a month vacation to a different state.",
    "My son learned new animal noises from my dad.",
    "I got a good deal on some phones I plan to gift.",
    "Another event that made me happy was making cookies for dessert.",
    "I cooked a recipe I've tried before but it didn't come out well, and I significantly improved how it tasted this time",
    "Realizing that we live in the best place for this season of our lives because there are so many things to see and do with our kids.",
    "My family took a vacation to Florida.",
    "We finally were able to repair our barn with new roofing and doors.",
    "My son made his first his first communion. I was happy to see him being able to more fully participate in Mass.",
    "My son was born",
    "Having a contented and purring cat on my lap.",
    "My son and I went to see an animatronic bugs exhibit at the Clinton Presidential Library.",
    "I was really happy when we started a new minecraft server. I really hated the old one.",
    "I planned a day trip for a friend and I.",
    "Me and my friend went to beach resort and enjoyed the beach walk. Later we ordered lunch and chat among us. For sometime we took oil massage and enjoyed the day.",
    "I had a song in my head that I like",
    "I got a new board game based on a friend's recommendation and liked it so much I played it 3 times in a row.",
    "I ate a really good burrito for lunch last week.",
    "today i met with my primary school friend, and we have decided that this Sunday we are going to forest tours.",
    "I went to a wine tasting event and was able to try out a few samples of red and white wines. I have never been to such an event and was enlightened greatly. I particularly enjoyed a specific white wine and after inquiring, I purchased one to enjoy for the evening.",
    "Playing with my dog and rubbing his belly made me happy yesterday.",
    "This past Friday my boss closed the office early so we could go home.",
    "I had a girl's day out with my mom and had a really great bonding experience with her.",
    "IN MY WORK PLACE I CONFIRMED A TRAVELS BOOKING. EVEN THOUGH IT WAS A SMALL AMOUNT I WAS HAPPY.",
    "I let my dogs run in the big yard.",
    "my love success so i am very happy",
    "A TV show came back on TV after not being on for over a year.",
    "My wife and I recently received the video from our wedding and were happy to relive the memories.",
    "Getting the kitchen clean, finishing the dishes and vacuuming.",
    "My cat woke me up this morning by lying on my chest and meowing in my face until I gave him attention.",
    "I ordered a new laptop from Amazon and I should have it soon.",
    "I staked the perimeter of the flower beds with solar lights.",
    "A student who recently transferred to the school I work at is having a good time and getting along well with the other students.",
    "I got to go to my house after being away for 6 months, going back made me feel happy.",
    "I pet my cats while they were curled up napping. It made me happy to be close to them.",
    "schedule to meet again with her",
    "My spouse and I shared a funny conversation while making dinner.",
    "i went to hospital to see the boy ....he has operation today at 12.00 pm after the operation i meat that boy he is now safe and he is happy now .............that feels me happy",
    "I repaired a relationship with a family member that I had tension with.",
    "I watched a couple episodes of one of my favorite comedy shows.",
    "Hiking by myself.",
    "Seeing the physical results of my weight cut; the confidence boost is a strong plus.",
    "I took my dog to the park to run around.",
    "I was happy when I learned that my child was recognized with an award for her accomplishments at school.",
    "I went on a hike yesterday afternoon to a new area that I have never explored before. I climbed an intense mountain with a moderate increase. I got lost on the way back but eventually found my way out. I t was just me and nature.",
    "I stopped at starbucks and got a frappuccino, it was really good.",
    "I went to the salon and got a hair cut and new color. it was a huge change from what i had before.",
    "I fell down",
    "I spent some quality time with my kids.",
    "My relatives gave a grand dinner in my home town and gifted me with a shirt.",
    "My husband bought us season tickets to a local attraction.",
    "I purchased a product I wanted for fifty percent off the retail price.",
    "My grandfather told me he loved me. He's not very emotional and hides his feelings, so this meant a lot to me.",
    "I got some important emails done and actually sent them.",
    "last night i went to dance bar with my lover.",
    "I took my son to the transit museum and he had a great time.",
    "I babysat my neice and she convinced me to jump on the trampoline, which I had not done in years--it was so fun!",
    "First time you are with your dog, take a moment to think about their point of view. When they cock their head at you, what could they possibly be thinking? Feeling? Capture that moment and share it with us. Every moment is special."
  ],
  "description2taxonomy": {
    "involves online interactions; specifically, the text recounts a happy moment that occurred through virtual communication or social media, such as making a new friend or achieving a goal in an online game. For example, 'I met some great people in a chat room who share my passion for knitting, and we exchange patterns and advice.'": {
      "node_name": "root_id=11_node=-8301828942046011495",
      "description": "involves online interactions; specifically, the text recounts a happy moment that occurred through virtual communication or social media, such as making a new friend or achieving a goal in an online game. For example, 'I met some great people in a chat room who share my passion for knitting, and we exchange patterns and advice.'",
      "texts": [
        "I decided to play a video game with a friend online; I had a lot of fun and that made me really happy.",
        "I surpassed a level in a video game that I hadn't previously reached.",
        "I got an extremely high score on a word video game with one of my friends.",
        "I defeated a boss in a video game I've been playing.",
        "I hit a higher rank in a video game.",
        "I reached level 50 with my girlfriend in Black Desert.",
        "Digivolving in a game, I've been working towards that for an hour!",
        "I had a fun chat with my friend on FaceBook.",
        "I talked to a new friend on the internet and he donated to my girlfriend's stream so we could go to a restaurant.",
        "I was really happy when we started a new minecraft server. I really hated the old one."
      ],
      "description2taxonomy": {}
    },
    "involves coworkers or bosses; specifically, the text refers to an interaction or event that took place with colleagues or supervisors. For example, 'My boss took me out for lunch today and paid for it.'": {
      "node_name": "root_id=11_node=6703284231759015599",
      "description": "involves coworkers or bosses; specifically, the text refers to an interaction or event that took place with colleagues or supervisors. For example, 'My boss took me out for lunch today and paid for it.'",
      "texts": [
        "I was able to self evaluate myself and received a substantial cost of living adjustment from my supervisor at work.",
        "My boss took me out for lunch today and paid for it.",
        "Getting praised for how i do my job from my boss",
        "I got to grab a drink with coworkers after work.",
        "My co-workers and I were able to finish a work project.",
        "I hung out with my co-workers and took a break",
        "This past Friday my boss closed the office early so we could go home."
      ],
      "description2taxonomy": {}
    },
    "involves only the speaker; specifically, the text describes a situation in which the person experienced happiness without the direct involvement of others. For example, 'I spent the day relaxing and reading a good book by myself.'": {
      "node_name": "root_id=11_node=1726082929805072310",
      "description": "involves only the speaker; specifically, the text describes a situation in which the person experienced happiness without the direct involvement of others. For example, 'I spent the day relaxing and reading a good book by myself.'",
      "texts": [
        "I was able to repair my irrigation sprinkler system by myself which made me feel great and save a bunch of money.",
        "Thunderstorms have been going on for part of the day. I find the sound of distant thunder and the fall of rain very peaceful. Even though its been dark and dreary most of the day. I've felt happy and calm due to the sounds.",
        "I had a nice midnight bike ride with the whole road to myself.",
        "Last week I bought some new comic books and read them.",
        "I had a dream about something hilarious and laughed so hard in my dream that when I woke up, I still felt happy and it got my day off to a good start.",
        "I was able to finish a painting I have been working on for many weeks. It is extremely satisfying to see the end result of all my efforts.",
        "I figured out a solution to a problem that I was working on at work and saved myself quite a bit of time.",
        "I bought myself a really pretty new scarf.",
        "I finished reading a good book.",
        "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
        "Having a contented and purring cat on my lap.",
        "Hiking by myself.",
        "I went on a hike yesterday afternoon to a new area that I have never explored before. I climbed an intense mountain with a moderate increase. I got lost on the way back but eventually found my way out. I t was just me and nature."
      ],
      "description2taxonomy": {}
    },
    "involves strangers or community members; specifically, the text shares a happy moment involving interaction with people outside one's immediate social circle or community. For example, 'I volunteered at a local food drive and met some wonderful people.'": {
      "node_name": "root_id=11_node=5831619569994012597",
      "description": "involves strangers or community members; specifically, the text shares a happy moment involving interaction with people outside one's immediate social circle or community. For example, 'I volunteered at a local food drive and met some wonderful people.'",
      "texts": [
        "I enjoyed playing badminton event yesterday with many participants across the city and i was very happy to have got second place ion that event",
        "Watching cricket in the cricket stadium full of huge crowd for the first and team that I'm supporting wins the match.",
        "I went to see the parade for the local high school basketball team champions in our town.",
        "I got to work with kids at a day camp.",
        "I went to a pre-summer retreat last week, I was glad to get out and socialize with others. This really made me happy because I meet new people and did not feel lonely for the next couple of days, I am still in contact with people from the camp.",
        "I met a woman with whom I had a long conversation about punk bands in Minneapolis. We talked for hours, reminiscing over the music we loved as young people.",
        "I went to a concert last week as a guest on the band's guest list and got to hang out with them before and after the show.",
        "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they"
      ],
      "description2taxonomy": {}
    },
    "involves family members; specifically, the text mentions spending time with or having a positive experience involving relatives. For example, 'I had a great dinner with my parents and siblings.'": {
      "node_name": "root_id=11_node=7019244778053943634",
      "description": "involves family members; specifically, the text mentions spending time with or having a positive experience involving relatives. For example, 'I had a great dinner with my parents and siblings.'",
      "texts": [
        "I received an old painting that my grandmother did.",
        "Reading my daughter her bed time story and then putting her to bed",
        "I haven't spent anytime with my wife during the past week due to her being a nurse and working 18 hour shifts. I finally got a chance to see her and we got to have breakfast this morning. Even though it wasn't that long, we got the chance to talk and see how each of us were doing.",
        "My daughter woke up from her nap, and after making eye contact with me let out the biggest sigh of happiness paired with a smile.",
        "I rode my bike to the park with my other son.",
        "Seeing my daughter excited about going to her school's Father-Daughter dance was really nice. We have had custody issues the last year and seeing their bond these days is just wonderful. It warms my heart to know she has the father she truly deserves.",
        "I played with my daughter before her bedtime.",
        "We live on a small island and away from my extended family. My brother comes down to visit us quite often and what made me happy was when he came down to visit us in April and the kids jumped into his arms at the airport, almost knocking him down. To see the joy on their face during his visit and how happy they were in turn made me very happy. I was also happy because I was spending time with one of my best friends.",
        "I was happy when my sister stayed with me over spring break.",
        "My grandmother visited me after work and we spent time together laughing and telling stories.",
        "We had a week off for spring break. My kids both had the same week off and I did from my school job as well so we were all together.",
        "I was happy when I found out my nephew is coming to visit me for a week for Spring Break.",
        "in last three months my daughter win in running competition.i am very happy that day.",
        "My brother fixed my air conditioner and saved me money.",
        "I received new shoes from my nephew as a gift.",
        "I went out with my family to eat pizza.",
        "Got holiday from job and spend quality of time with family",
        "My daughter had a signing performance last week. She's 11 and had to dress up for this performance. She was the most beautiful one on stage and did great. Seeing her perform made me happy.",
        "My family is finally helping me pack for the move. I've been getting the house ready to move for what seems like a month now and no one was helping me but now that it sold - they are all helping me and doing what I tell them to.",
        "My daughter got accepted in a preschool program we wanted to put her in.",
        "I was excited and happy when I found out my daughter got engaged.",
        "I took my son to a doctor's appointment last week regarding his ADHD treatment. The doctor prescribed a new medication and we are already having great results. I'm happy to see my son behaving better and I know he's happier too.",
        "I met my adopted brother who left the country long ago just last week.",
        "The day my cousins came to visit made me happy.",
        "Cooking with parents, singing (to piano or records) with parents, watching tv with them and making fun of stupid things, playing cards, playing Frisbee, taking care of animals... There's no way to tell what will stick, so there's no way to orchestrate one thing to stick. Just enjoying each other's company doing the normal business of life is enough.",
        "I went to see my niece's choir concert and it was so great to hear music live again, it really made me feel amazing.",
        "Spending the day with my grandson.",
        "Today is my parent's wedding anniversary we celebrate it.",
        "I received big hugs and kisses from my children when they got up in the morning.",
        "MY BROTHER BIRTHDAY CELEBRATED IN MY HOUSE",
        "I was very happy when my whole family members attended the get together function in my native place",
        "The first day that I took my daughter to Gymnastics made me incredibly happy! I felt like she was making new friends and getting out more than she use to.",
        "I found my aunt that I haven't talked to in over 25 years.",
        "I have been rather sick lately and unable to eat, I was able to eat my favorite meal at my favorite restaurant with my kids and parents.",
        "My sister's fiancee asked me to be one of his groomsmen.",
        "LAST MONTH MY DAUGHTER FIRST MARK IN THE CLASS AND I WAS VERY HAPPY AND I PRESENTED HER WITH A TEDDY BEAR AND SHE WAS ALSO VERY HAPPY BECAUSE I HAD PROMISED HER IF SHE GOT FIRST MARK IN THE CLASS I WILL GET HER TEDDY BEAR.",
        "I went to my uncle's birthday party.",
        "Last month, I Went out for dinner with my family to a big restaurant and it was a happy moment",
        "I watched a movie with my daughters.",
        "I took my mother out to eat for Mother's day.",
        "My sister came into town and stayed the night.",
        "I got to take my daughter over to my mother in law's house and let her play with her cousins who are visiting this week. I loved seeing her play with them and interact with other kids. They all had a good time.",
        "We watched the movie Guardians of the Galaxy vol 2 together as a family, having a great time at the movie theater.",
        "I was able to get my son everything he wanted for Easter. Easter in our family is like a mini Christmas.",
        "I received a beautiful card from my aunt and her only purpose was to tell me how much she loved me.",
        "I felt happy when my daughter won in a state level championship.",
        "I went out to dinner with my entire family and ate the most delicious peach cobbler for dessert.",
        "Recently My sister came to India to Visit us. But For a quite while even before she visiting us, she has been suffering with few pains in her wrist. Initially she thought it was just due to workload. So When She came to India, she consulted our family Doctor . He reported after few scanning that she has Giant Bone Tumor in her hand and Some Organisms have already eaten some part of her bone. So we quickly without any further delay Planned for Operation in which some part of Necessary Bone from leg will be taken and that part will be fixed in hand after removing the tumor she had. Later they thought fixing it with artificial Bone. On the day of Operation,We all family members were waiting outside while her operation was going on. Then Came Doctor and Said they needed Blood ( B+) because of the blood loss she had during operation it was making her hard to breath. I and along with My sister's Brother-in-law Rushed to Blood Bank, I decided to be the Donor , But they initially needed to check my Blood group and all that safety measures which took around 20 Minutes and They Needed Blood Soon and I Quickly Started pumping my Blood Out and Finally Reached the hospital and handed over it to them and the Operation took Place Successfully. Don't Know why but that feeling which I Experienced while Traveling to hospital with my Blood in my Hands to my sister in need of it and",
        "I and my family went to beach and place some funny game.",
        "MY SISTER-IN-LAW BOUGHT A NEW LAPTOP AND AFTER SHE PRESENTED FOR ME. THAT TIME I FEEL VERY HAPPY.",
        "Some of my relatives come home and we go to beach.",
        "My parents came up to my college to attend a choir concert I was performing in. They don't come up to see me very often so it was really nice to have them come.",
        "When I visited my parents and they were happy and healthy.",
        "I was with my whole immediate family while we were doing yard work together, having drinks and talking, it was very enjoyable.",
        "My son was eating in his high chair last night and was laughing his head off as he kept reaching down to feed the dog.",
        "My little sister and her family came for a two week visit. I got to hold my baby niece for the first time! I am still happy over this event, as they have just left for their new home, so the joy has not left yet.",
        "I took my daughters to the store for a little girl time and let the pick out a couple of new outfits for summer.",
        "Going home to see my parents for Mother's Day.",
        "My family tour after long time",
        "My infant daughter smiled at me.",
        "I bought a plane ticket home to see my family.",
        "My happiest moment in my life s......for my 20th birthday my dad presented me a new smart phone surprisingly that day i was so exited....i cant forget that day in my life,that was my first surprise given by my dad..",
        "I saw my dad after not seeing him for a few months.",
        "i felt happy yesterday when my son gave me a draw.",
        "MY UNCLE LIVED IN MUMBAI WHEN I RECEIVE A CALL FROM MY UNCLE I REALLY FELT HAPPY.....",
        "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
        "Last month we reach to ooty its too good place to enjoy with family we enjoyed a lot there",
        "My son learned new animal noises from my dad.",
        "My family took a vacation to Florida.",
        "My son made his first his first communion. I was happy to see him being able to more fully participate in Mass.",
        "I had a girl's day out with my mom and had a really great bonding experience with her.",
        "I repaired a relationship with a family member that I had tension with.",
        "I was happy when I learned that my child was recognized with an award for her accomplishments at school.",
        "I spent some quality time with my kids.",
        "My relatives gave a grand dinner in my home town and gifted me with a shirt.",
        "My grandfather told me he loved me. He's not very emotional and hides his feelings, so this meant a lot to me.",
        "I took my son to the transit museum and he had a great time.",
        "I babysat my neice and she convinced me to jump on the trampoline, which I had not done in years--it was so fun!"
      ],
      "description2taxonomy": {
        "involves grandparents; specifically, the text describes a happy moment with one's grandparents, such as bonding, reminiscing, or creating new memories. For example, 'My grandmother taught me her secret family recipe for apple pie.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-5032159576888056004",
          "description": "involves grandparents; specifically, the text describes a happy moment with one's grandparents, such as bonding, reminiscing, or creating new memories. For example, 'My grandmother taught me her secret family recipe for apple pie.'",
          "texts": [
            "My grandmother visited me after work and we spent time together laughing and telling stories.",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
            "My grandfather told me he loved me. He's not very emotional and hides his feelings, so this meant a lot to me."
          ],
          "description2taxonomy": {}
        },
        "involves spouse or partner; specifically, the text talks about a positive experience with one's significant other. For example, 'My husband and I celebrated our anniversary with a romantic dinner.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-5241695080257852603",
          "description": "involves spouse or partner; specifically, the text talks about a positive experience with one's significant other. For example, 'My husband and I celebrated our anniversary with a romantic dinner.'",
          "texts": [
            "I haven't spent anytime with my wife during the past week due to her being a nurse and working 18 hour shifts. I finally got a chance to see her and we got to have breakfast this morning. Even though it wasn't that long, we got the chance to talk and see how each of us were doing.",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they"
          ],
          "description2taxonomy": {}
        },
        "involves extended family; specifically, the text discusses a positive interaction or event involving aunts, uncles, cousins, or other relatives. For example, 'My cousin and I went to a concert together and had a blast.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-5321437106555441717",
          "description": "involves extended family; specifically, the text discusses a positive interaction or event involving aunts, uncles, cousins, or other relatives. For example, 'My cousin and I went to a concert together and had a blast.'",
          "texts": [
            "I was happy when I found out my nephew is coming to visit me for a week for Spring Break.",
            "I received new shoes from my nephew as a gift.",
            "The day my cousins came to visit made me happy.",
            "I went to see my niece's choir concert and it was so great to hear music live again, it really made me feel amazing.",
            "I was very happy when my whole family members attended the get together function in my native place",
            "I found my aunt that I haven't talked to in over 25 years.",
            "I went to my uncle's birthday party.",
            "I got to take my daughter over to my mother in law's house and let her play with her cousins who are visiting this week. I loved seeing her play with them and interact with other kids. They all had a good time.",
            "I received a beautiful card from my aunt and her only purpose was to tell me how much she loved me.",
            "MY UNCLE LIVED IN MUMBAI WHEN I RECEIVE A CALL FROM MY UNCLE I REALLY FELT HAPPY.....",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
            "My relatives gave a grand dinner in my home town and gifted me with a shirt.",
            "I babysat my neice and she convinced me to jump on the trampoline, which I had not done in years--it was so fun!"
          ],
          "description2taxonomy": {}
        },
        "involves family assistance; specifically, the text highlights a positive moment when family members helped or supported each other during difficult times, such as moving or packing. For example, 'My family finally helped me pack for the move, and it made me really happy.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-7521719158695203577",
          "description": "involves family assistance; specifically, the text highlights a positive moment when family members helped or supported each other during difficult times, such as moving or packing. For example, 'My family finally helped me pack for the move, and it made me really happy.'",
          "texts": [
            "We live on a small island and away from my extended family. My brother comes down to visit us quite often and what made me happy was when he came down to visit us in April and the kids jumped into his arms at the airport, almost knocking him down. To see the joy on their face during his visit and how happy they were in turn made me very happy. I was also happy because I was spending time with one of my best friends.",
            "I was happy when my sister stayed with me over spring break.",
            "My family is finally helping me pack for the move. I've been getting the house ready to move for what seems like a month now and no one was helping me but now that it sold - they are all helping me and doing what I tell them to.",
            "I have been rather sick lately and unable to eat, I was able to eat my favorite meal at my favorite restaurant with my kids and parents.",
            "Recently My sister came to India to Visit us. But For a quite while even before she visiting us, she has been suffering with few pains in her wrist. Initially she thought it was just due to workload. So When She came to India, she consulted our family Doctor . He reported after few scanning that she has Giant Bone Tumor in her hand and Some Organisms have already eaten some part of her bone. So we quickly without any further delay Planned for Operation in which some part of Necessary Bone from leg will be taken and that part will be fixed in hand after removing the tumor she had. Later they thought fixing it with artificial Bone. On the day of Operation,We all family members were waiting outside while her operation was going on. Then Came Doctor and Said they needed Blood ( B+) because of the blood loss she had during operation it was making her hard to breath. I and along with My sister's Brother-in-law Rushed to Blood Bank, I decided to be the Donor , But they initially needed to check my Blood group and all that safety measures which took around 20 Minutes and They Needed Blood Soon and I Quickly Started pumping my Blood Out and Finally Reached the hospital and handed over it to them and the Operation took Place Successfully. Don't Know why but that feeling which I Experienced while Traveling to hospital with my Blood in my Hands to my sister in need of it and",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they"
          ],
          "description2taxonomy": {}
        },
        "involves spending time with parents; specifically, the text describes a happy moment shared with one's mother or father. For example, 'I went out with my family to eat pizza.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-8844213576289972076",
          "description": "involves spending time with parents; specifically, the text describes a happy moment shared with one's mother or father. For example, 'I went out with my family to eat pizza.'",
          "texts": [
            "Reading my daughter her bed time story and then putting her to bed",
            "My daughter woke up from her nap, and after making eye contact with me let out the biggest sigh of happiness paired with a smile.",
            "Seeing my daughter excited about going to her school's Father-Daughter dance was really nice. We have had custody issues the last year and seeing their bond these days is just wonderful. It warms my heart to know she has the father she truly deserves.",
            "I went out with my family to eat pizza.",
            "Got holiday from job and spend quality of time with family",
            "Cooking with parents, singing (to piano or records) with parents, watching tv with them and making fun of stupid things, playing cards, playing Frisbee, taking care of animals... There's no way to tell what will stick, so there's no way to orchestrate one thing to stick. Just enjoying each other's company doing the normal business of life is enough.",
            "Today is my parent's wedding anniversary we celebrate it.",
            "I was very happy when my whole family members attended the get together function in my native place",
            "I have been rather sick lately and unable to eat, I was able to eat my favorite meal at my favorite restaurant with my kids and parents.",
            "LAST MONTH MY DAUGHTER FIRST MARK IN THE CLASS AND I WAS VERY HAPPY AND I PRESENTED HER WITH A TEDDY BEAR AND SHE WAS ALSO VERY HAPPY BECAUSE I HAD PROMISED HER IF SHE GOT FIRST MARK IN THE CLASS I WILL GET HER TEDDY BEAR.",
            "Last month, I Went out for dinner with my family to a big restaurant and it was a happy moment",
            "I took my mother out to eat for Mother's day.",
            "I got to take my daughter over to my mother in law's house and let her play with her cousins who are visiting this week. I loved seeing her play with them and interact with other kids. They all had a good time.",
            "We watched the movie Guardians of the Galaxy vol 2 together as a family, having a great time at the movie theater.",
            "I went out to dinner with my entire family and ate the most delicious peach cobbler for dessert.",
            "My parents came up to my college to attend a choir concert I was performing in. They don't come up to see me very often so it was really nice to have them come.",
            "When I visited my parents and they were happy and healthy.",
            "I was with my whole immediate family while we were doing yard work together, having drinks and talking, it was very enjoyable.",
            "Going home to see my parents for Mother's Day.",
            "I bought a plane ticket home to see my family.",
            "My happiest moment in my life s......for my 20th birthday my dad presented me a new smart phone surprisingly that day i was so exited....i cant forget that day in my life,that was my first surprise given by my dad..",
            "I saw my dad after not seeing him for a few months.",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
            "My son learned new animal noises from my dad.",
            "I had a girl's day out with my mom and had a really great bonding experience with her."
          ],
          "description2taxonomy": {}
        },
        "involves spending time with children; specifically, the text describes a happy moment shared with a son or daughter. For example, 'I took my son to the transit museum and he had a great time.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-9070189024466056299",
          "description": "involves spending time with children; specifically, the text describes a happy moment shared with a son or daughter. For example, 'I took my son to the transit museum and he had a great time.'",
          "texts": [
            "Reading my daughter her bed time story and then putting her to bed",
            "My daughter woke up from her nap, and after making eye contact with me let out the biggest sigh of happiness paired with a smile.",
            "I rode my bike to the park with my other son.",
            "Seeing my daughter excited about going to her school's Father-Daughter dance was really nice. We have had custody issues the last year and seeing their bond these days is just wonderful. It warms my heart to know she has the father she truly deserves.",
            "I played with my daughter before her bedtime.",
            "We had a week off for spring break. My kids both had the same week off and I did from my school job as well so we were all together.",
            "in last three months my daughter win in running competition.i am very happy that day.",
            "My daughter had a signing performance last week. She's 11 and had to dress up for this performance. She was the most beautiful one on stage and did great. Seeing her perform made me happy.",
            "My daughter got accepted in a preschool program we wanted to put her in.",
            "I took my son to a doctor's appointment last week regarding his ADHD treatment. The doctor prescribed a new medication and we are already having great results. I'm happy to see my son behaving better and I know he's happier too.",
            "Spending the day with my grandson.",
            "I received big hugs and kisses from my children when they got up in the morning.",
            "The first day that I took my daughter to Gymnastics made me incredibly happy! I felt like she was making new friends and getting out more than she use to.",
            "LAST MONTH MY DAUGHTER FIRST MARK IN THE CLASS AND I WAS VERY HAPPY AND I PRESENTED HER WITH A TEDDY BEAR AND SHE WAS ALSO VERY HAPPY BECAUSE I HAD PROMISED HER IF SHE GOT FIRST MARK IN THE CLASS I WILL GET HER TEDDY BEAR.",
            "I watched a movie with my daughters.",
            "I got to take my daughter over to my mother in law's house and let her play with her cousins who are visiting this week. I loved seeing her play with them and interact with other kids. They all had a good time.",
            "We watched the movie Guardians of the Galaxy vol 2 together as a family, having a great time at the movie theater.",
            "I was able to get my son everything he wanted for Easter. Easter in our family is like a mini Christmas.",
            "I felt happy when my daughter won in a state level championship.",
            "My son was eating in his high chair last night and was laughing his head off as he kept reaching down to feed the dog.",
            "I took my daughters to the store for a little girl time and let the pick out a couple of new outfits for summer.",
            "My infant daughter smiled at me.",
            "i felt happy yesterday when my son gave me a draw.",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they",
            "My son learned new animal noises from my dad.",
            "My son made his first his first communion. I was happy to see him being able to more fully participate in Mass.",
            "I was happy when I learned that my child was recognized with an award for her accomplishments at school.",
            "I spent some quality time with my kids.",
            "I took my son to the transit museum and he had a great time.",
            "I babysat my neice and she convinced me to jump on the trampoline, which I had not done in years--it was so fun!"
          ],
          "description2taxonomy": {}
        },
        "involves family vacations or trips; specifically, the text describes a happy moment experienced during a family vacation or outing. For example, 'My family took a vacation to Florida.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=6565863277516182707",
          "description": "involves family vacations or trips; specifically, the text describes a happy moment experienced during a family vacation or outing. For example, 'My family took a vacation to Florida.'",
          "texts": [
            "We had a week off for spring break. My kids both had the same week off and I did from my school job as well so we were all together.",
            "I and my family went to beach and place some funny game.",
            "Some of my relatives come home and we go to beach.",
            "My family took a vacation to Florida."
          ],
          "description2taxonomy": {}
        },
        "involves siblings; specifically, the text describes a happy moment shared with the speaker's sibling or siblings. For example, 'My sister came into town and stayed the night.'": {
          "node_name": "root_id=11_node=7019244778053943634_node=-163554775031481522",
          "description": "involves siblings; specifically, the text describes a happy moment shared with the speaker's sibling or siblings. For example, 'My sister came into town and stayed the night.'",
          "texts": [
            "We live on a small island and away from my extended family. My brother comes down to visit us quite often and what made me happy was when he came down to visit us in April and the kids jumped into his arms at the airport, almost knocking him down. To see the joy on their face during his visit and how happy they were in turn made me very happy. I was also happy because I was spending time with one of my best friends.",
            "I was happy when my sister stayed with me over spring break.",
            "I met my adopted brother who left the country long ago just last week.",
            "My sister came into town and stayed the night.",
            "My little sister and her family came for a two week visit. I got to hold my baby niece for the first time! I am still happy over this event, as they have just left for their new home, so the joy has not left yet.",
            "This happened this Diwali. As I entered my native at Night after quite a long journey , crackers were everywhere, everyone busy with lighting crackers, having sweets etc. But only a Man n Woman, busy with their regular work, woman is busy cleaning the home, man sitting outside quiet. Once I entered that home, She ran to me, Hugging me tight, With tears she Said \"You made my day my son, I never expected you would come \". Yes, She was my grand ma, Looking at her eyes , I said \" I am there for you ma, Don't worry \". I wiped off the tears and fed sweets which I brought to both of them with my hand. While going I had brought some Fruits, Sweets and Juice for them . Along with them I had also purchased a cell phone, which is capable of playing songs and videos along with memory card . I had downloaded few Hari Kathe ( Kannada mythological stories ) and old Songs ( My grand pa loves Hari Kathe so much ). I showed them how to play them also. I set my number to speed dial. We had food together with conversation about many things including my marriage. They had a big smile on their face. At that moment I have experienced \" True Happiness \". I just realise how to spread happiness . Even I am having billions also, I am sure I can't feel that Happiness. Why they were sorry is not needed now, but they"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves pets or animals; specifically, the text shares a positive experience with a pet or an animal encounter. For example, 'I had a great time walking my dog in the park today.'": {
      "node_name": "root_id=11_node=8655576850712760800",
      "description": "involves pets or animals; specifically, the text shares a positive experience with a pet or an animal encounter. For example, 'I had a great time walking my dog in the park today.'",
      "texts": [
        "My dog had a litter of puppies.",
        "My cats lounging around with me made me pretty happy.",
        "We found out that our very sick cat was going to be okay, after we thought for sure he wasn't going to make it.",
        "My cat was sleeping on me and it made me happy.",
        "I walked my dog in the woods for twenty minutes.",
        "The neighbors cat came to visit us again.",
        "Abby (one of our two doggies) was making noises sounding like a kid complaining and grumbling for being told to be quiet and it sounded really funny.",
        "The feral kittens outside were jumping around.",
        "My son was eating in his high chair last night and was laughing his head off as he kept reaching down to feed the dog.",
        "My dog had been sick and she started feeling better.",
        "I saw a cardinal (my favorite bird) on my walk yesterday afternoon.",
        "My cat was diagnosed with kidney failure, but through lots of treatment and care, she is recovering. Her vet said it was a miracle!",
        "my dog name is lakshi. today is my pet birthday. lakshi is so cute our hair is so nice and soft. today, i and my lakshi is so happy.....",
        "Our ducks at the pond had nine babies yesterday and they are swimming around the pond.",
        "An event that made me happy was spending time with my cat who was purring on my chest.",
        "Having a contented and purring cat on my lap.",
        "Playing with my dog and rubbing his belly made me happy yesterday.",
        "I let my dogs run in the big yard.",
        "My cat woke me up this morning by lying on my chest and meowing in my face until I gave him attention.",
        "I pet my cats while they were curled up napping. It made me happy to be close to them.",
        "I took my dog to the park to run around.",
        "First time you are with your dog, take a moment to think about their point of view. When they cock their head at you, what could they possibly be thinking? Feeling? Capture that moment and share it with us. Every moment is special."
      ],
      "description2taxonomy": {
        "involves animal births or offspring; specifically, the text describes happiness experienced from the birth or presence of newborn animals. For example, 'Our ducks at the pond had nine babies yesterday and they are swimming around the pond.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=6479239504988856081",
          "description": "involves animal births or offspring; specifically, the text describes happiness experienced from the birth or presence of newborn animals. For example, 'Our ducks at the pond had nine babies yesterday and they are swimming around the pond.'",
          "texts": [
            "My dog had a litter of puppies.",
            "Our ducks at the pond had nine babies yesterday and they are swimming around the pond."
          ],
          "description2taxonomy": {}
        },
        "involves wild or feral animals; specifically, the text shares a positive experience with an encounter or observation of wild or feral animals. For example, 'The feral kittens outside were jumping around.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=7724941534417779236",
          "description": "involves wild or feral animals; specifically, the text shares a positive experience with an encounter or observation of wild or feral animals. For example, 'The feral kittens outside were jumping around.'",
          "texts": [
            "The feral kittens outside were jumping around.",
            "Our ducks at the pond had nine babies yesterday and they are swimming around the pond."
          ],
          "description2taxonomy": {}
        },
        "involves pet birthdays or celebrations; specifically, the text describes a happy moment related to celebrating a pet's birthday or other special occasion. For example, 'Today is my pet's birthday and we are both so happy.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=4842659929524354995",
          "description": "involves pet birthdays or celebrations; specifically, the text describes a happy moment related to celebrating a pet's birthday or other special occasion. For example, 'Today is my pet's birthday and we are both so happy.'",
          "texts": [
            "my dog name is lakshi. today is my pet birthday. lakshi is so cute our hair is so nice and soft. today, i and my lakshi is so happy....."
          ],
          "description2taxonomy": {}
        },
        "involves pets in a humorous or playful situation; specifically, the text describes a happy moment that happened due to the pet's amusing or playful behavior. For example, 'Abby (one of our two doggies) was making noises sounding like a kid complaining and grumbling for being told to be quiet and it sounded really funny.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=-7187022095689964099",
          "description": "involves pets in a humorous or playful situation; specifically, the text describes a happy moment that happened due to the pet's amusing or playful behavior. For example, 'Abby (one of our two doggies) was making noises sounding like a kid complaining and grumbling for being told to be quiet and it sounded really funny.'",
          "texts": [
            "Abby (one of our two doggies) was making noises sounding like a kid complaining and grumbling for being told to be quiet and it sounded really funny.",
            "My son was eating in his high chair last night and was laughing his head off as he kept reaching down to feed the dog."
          ],
          "description2taxonomy": {}
        },
        "involves pets' health or recovery; specifically, the text shares a positive experience related to a pet's health improvement or recovery from an illness. For example, 'We found out that our very sick cat was going to be okay, after we thought for sure he wasn't going to make it.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=2677712553453024476",
          "description": "involves pets' health or recovery; specifically, the text shares a positive experience related to a pet's health improvement or recovery from an illness. For example, 'We found out that our very sick cat was going to be okay, after we thought for sure he wasn't going to make it.'",
          "texts": [
            "We found out that our very sick cat was going to be okay, after we thought for sure he wasn't going to make it.",
            "My dog had been sick and she started feeling better.",
            "My cat was diagnosed with kidney failure, but through lots of treatment and care, she is recovering. Her vet said it was a miracle!"
          ],
          "description2taxonomy": {}
        },
        "involves outdoor activities with pets; specifically, the text describes happiness derived from engaging in outdoor activities with a pet or pets. For example, 'I took my dog to the park to run around.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=3640377263515642217",
          "description": "involves outdoor activities with pets; specifically, the text describes happiness derived from engaging in outdoor activities with a pet or pets. For example, 'I took my dog to the park to run around.'",
          "texts": [
            "I walked my dog in the woods for twenty minutes.",
            "Playing with my dog and rubbing his belly made me happy yesterday.",
            "I let my dogs run in the big yard.",
            "I took my dog to the park to run around."
          ],
          "description2taxonomy": {}
        },
        "involves cats; specifically, the text recounts a positive experience with a cat, showcasing the affection and interaction between the speaker and the cat. For example, 'The neighbor's cat came over, and we played with a toy for hours.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=7274819340246095183",
          "description": "involves cats; specifically, the text recounts a positive experience with a cat, showcasing the affection and interaction between the speaker and the cat. For example, 'The neighbor's cat came over, and we played with a toy for hours.'",
          "texts": [
            "My cats lounging around with me made me pretty happy.",
            "My cat was sleeping on me and it made me happy.",
            "The neighbors cat came to visit us again.",
            "An event that made me happy was spending time with my cat who was purring on my chest.",
            "Having a contented and purring cat on my lap.",
            "My cat woke me up this morning by lying on my chest and meowing in my face until I gave him attention.",
            "I pet my cats while they were curled up napping. It made me happy to be close to them."
          ],
          "description2taxonomy": {}
        },
        "involves birds; specifically, the text captures a joyful interaction with a bird, demonstrating the speaker's appreciation for the avian species. For example, 'Feeding the colorful parrots at the zoo was such a delightful experience.'": {
          "node_name": "root_id=11_node=8655576850712760800_node=8851501868124393300",
          "description": "involves birds; specifically, the text captures a joyful interaction with a bird, demonstrating the speaker's appreciation for the avian species. For example, 'Feeding the colorful parrots at the zoo was such a delightful experience.'",
          "texts": [
            "I saw a cardinal (my favorite bird) on my walk yesterday afternoon."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves friends; specifically, the text describes a happy moment shared with friends or mentions a positive event involving friends. For example, 'I had an awesome time catching up with my best friends over coffee.'": {
      "node_name": "root_id=11_node=9166340305448568805",
      "description": "involves friends; specifically, the text describes a happy moment shared with friends or mentions a positive event involving friends. For example, 'I had an awesome time catching up with my best friends over coffee.'",
      "texts": [
        "Yesterday, I met my college freinds and we had party in a pub.",
        "I visited a friend who I hadn't seen in many years.",
        "I took a trip to Indianapolis with some very good friends and had an amazing time. Just getting away from everyday life and enjoying it with your buddies makes trips like this worth it.",
        "I decided to play a video game with a friend online; I had a lot of fun and that made me really happy.",
        "i went to celebrate birthday party of my friend",
        "Going out for drinks with some old friends and catching up on life.",
        "I found out one of my best friends is moving back to the area where I live.",
        "On Thursday nights my boyfriend and I get together with a group of friends at different restaurants to have dinner and drinks and to catch up with each other. It is always a fun night on Thursdays and I look forward to it all week long.",
        "I got a gift from my friend without any reason.",
        "I got an extremely high score on a word video game with one of my friends.",
        "I got to reconnect to a good friend with whom I had lost communication because a misunderstood we had.",
        "My best friend texted me that she is coming to visit me this weekend! I am super excited for her to arrive today.",
        "Enjoyed a visit at work with some friends that I have not seen in almost a year.",
        "Me and some friends were playing World of Warships and it was kinda fun.",
        "I celebrate my close friend birthday",
        "This afternoon, I had a conversation with an old friend from high school.",
        "I went to a music festival with friends.",
        "Go to eat sushi with my friends",
        "Going out with a group of friends for dinner and drinks.",
        "I went out with some friends to get some food. We originally planned to go to Starbucks but we changed plans at the last minute to go to a local coffee shop. I bought a wrap there and it was surprisingly good! I was happy we changed our destination.",
        "I had a fun chat with my friend on FaceBook.",
        "A close friend who has been looking for a job for a long while just got called for an interview for a job of interest to her.",
        "Me and my friend went to beach resort and enjoyed the beach walk. Later we ordered lunch and chat among us. For sometime we took oil massage and enjoyed the day.",
        "today i met with my primary school friend, and we have decided that this Sunday we are going to forest tours."
      ],
      "description2taxonomy": {
        "focuses on forming new connections; specifically, the text describes a happy moment where a misunderstanding is resolved or a new friendship is established. For example, 'I reconnected with a good friend whom I had lost communication with due to a misunderstanding.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=8479295586852702365",
          "description": "focuses on forming new connections; specifically, the text describes a happy moment where a misunderstanding is resolved or a new friendship is established. For example, 'I reconnected with a good friend whom I had lost communication with due to a misunderstanding.'",
          "texts": [
            "I found out one of my best friends is moving back to the area where I live.",
            "I got to reconnect to a good friend with whom I had lost communication because a misunderstood we had."
          ],
          "description2taxonomy": {}
        },
        "centers on visiting or hosting friends; specifically, the text describes a happy moment where friends visit each other's homes or workplaces, indicating close relationships. For example, 'I enjoyed a visit at work from some friends whom I hadn't seen in almost a year; it made my day brighter.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=-5480312114606922463",
          "description": "centers on visiting or hosting friends; specifically, the text describes a happy moment where friends visit each other's homes or workplaces, indicating close relationships. For example, 'I enjoyed a visit at work from some friends whom I hadn't seen in almost a year; it made my day brighter.'",
          "texts": [
            "I visited a friend who I hadn't seen in many years.",
            "My best friend texted me that she is coming to visit me this weekend! I am super excited for her to arrive today.",
            "Enjoyed a visit at work with some friends that I have not seen in almost a year."
          ],
          "description2taxonomy": {}
        },
        "features traveling or exploring together; specifically, the text describes a happy moment where the speaker and their friends go on a trip, vacation, or explore a new place together. For example, 'I went on a forest tour with my best friend and had an amazing adventure.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=-8444225645683611732",
          "description": "features traveling or exploring together; specifically, the text describes a happy moment where the speaker and their friends go on a trip, vacation, or explore a new place together. For example, 'I went on a forest tour with my best friend and had an amazing adventure.'",
          "texts": [
            "I took a trip to Indianapolis with some very good friends and had an amazing time. Just getting away from everyday life and enjoying it with your buddies makes trips like this worth it.",
            "I went to a music festival with friends.",
            "Me and my friend went to beach resort and enjoyed the beach walk. Later we ordered lunch and chat among us. For sometime we took oil massage and enjoyed the day.",
            "today i met with my primary school friend, and we have decided that this Sunday we are going to forest tours."
          ],
          "description2taxonomy": {}
        },
        "discusses a surprise or an unexpected gesture; specifically, the text describes a happy moment where a friend does something unexpected or pleasant like giving a spontaneous gift. For example, 'I was happily surprised when my friend gave me a gift for no reason.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=2187818826330159302",
          "description": "discusses a surprise or an unexpected gesture; specifically, the text describes a happy moment where a friend does something unexpected or pleasant like giving a spontaneous gift. For example, 'I was happily surprised when my friend gave me a gift for no reason.'",
          "texts": [
            "I got a gift from my friend without any reason."
          ],
          "description2taxonomy": {}
        },
        "involves friends in an online interaction; specifically, the text highlights a happy moment experienced during an online conversation or interaction with friends. For example, 'Playing video games online with my friends was the highlight of my week.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=60207078256599812",
          "description": "involves friends in an online interaction; specifically, the text highlights a happy moment experienced during an online conversation or interaction with friends. For example, 'Playing video games online with my friends was the highlight of my week.'",
          "texts": [
            "I decided to play a video game with a friend online; I had a lot of fun and that made me really happy.",
            "I got an extremely high score on a word video game with one of my friends.",
            "Me and some friends were playing World of Warships and it was kinda fun.",
            "I had a fun chat with my friend on FaceBook."
          ],
          "description2taxonomy": {}
        },
        "acknowledges a friend's achievement or celebration; specifically, the text describes a happy moment related to a friend's success or special occasion. For example, 'I felt so happy when attending my friend's graduation ceremony.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=8902154409369502221",
          "description": "acknowledges a friend's achievement or celebration; specifically, the text describes a happy moment related to a friend's success or special occasion. For example, 'I felt so happy when attending my friend's graduation ceremony.'",
          "texts": [
            "i went to celebrate birthday party of my friend",
            "I celebrate my close friend birthday",
            "A close friend who has been looking for a job for a long while just got called for an interview for a job of interest to her."
          ],
          "description2taxonomy": {}
        },
        "involves friends from college or school; specifically, the text mentions a happy moment spent with friends from an educational context. For example, 'Reuniting with my college buddies made my weekend amazing.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=-3130337384048305741",
          "description": "involves friends from college or school; specifically, the text mentions a happy moment spent with friends from an educational context. For example, 'Reuniting with my college buddies made my weekend amazing.'",
          "texts": [
            "Yesterday, I met my college freinds and we had party in a pub.",
            "This afternoon, I had a conversation with an old friend from high school.",
            "today i met with my primary school friend, and we have decided that this Sunday we are going to forest tours."
          ],
          "description2taxonomy": {}
        },
        "involves friends in a casual meetup; specifically, the text highlights a happy moment during an informal gathering with friends, such as a lunch or coffee date. For example, 'Had a great time chatting and laughing with my friends at the local café.'": {
          "node_name": "root_id=11_node=9166340305448568805_node=1242244771235620180",
          "description": "involves friends in a casual meetup; specifically, the text highlights a happy moment during an informal gathering with friends, such as a lunch or coffee date. For example, 'Had a great time chatting and laughing with my friends at the local café.'",
          "texts": [
            "Going out for drinks with some old friends and catching up on life.",
            "On Thursday nights my boyfriend and I get together with a group of friends at different restaurants to have dinner and drinks and to catch up with each other. It is always a fun night on Thursdays and I look forward to it all week long.",
            "Go to eat sushi with my friends",
            "Going out with a group of friends for dinner and drinks.",
            "I went out with some friends to get some food. We originally planned to go to Starbucks but we changed plans at the last minute to go to a local coffee shop. I bought a wrap there and it was surprisingly good! I was happy we changed our destination."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "involves a romantic partner; specifically, the text describes a happy moment where the speaker spent time with their spouse or romantic partner. For example, 'I had a wonderful date night with my partner and we saw a fantastic movie.'": {
      "node_name": "root_id=11_node=-5709081636111590791",
      "description": "involves a romantic partner; specifically, the text describes a happy moment where the speaker spent time with their spouse or romantic partner. For example, 'I had a wonderful date night with my partner and we saw a fantastic movie.'",
      "texts": [
        "I haven't spent anytime with my wife during the past week due to her being a nurse and working 18 hour shifts. I finally got a chance to see her and we got to have breakfast this morning. Even though it wasn't that long, we got the chance to talk and see how each of us were doing.",
        "My husband got a sizable raise at work.",
        "When I made a special dinner for my wife last night to make her feel better after a rough day at work. Her saying thank you really made my day.",
        "My husband made delicious chocolates again.",
        "My husband bought me delicious coffee, dark, but not upsetting to my stomach.",
        "It made me happy when I was able to surprise my boyfriend on his birthday. It made me happy seeing him happy.",
        "Went on a great date with this amazing girl I met.",
        "I had a delicious dinner with my girlfriend last night.",
        "My wife came home with Schwarma Express for Supper, I was happy to have my favorite food on a day where I am already happy for not having to go to work.",
        "Yesterday night i talked with my girlfriend Keerthana up to more than 5 hours i was spoke with her. Both of us understood everything very well. We made for each other. I was so happy. Moving forward surely i will speak with her daily. I'm very happy about this.",
        "After a long work week, I finally relaxed at home with my wife with dinner and a movie (Office Christmas Party).",
        "I spent a simple evening with my husband watching a TV show and caressing his hair while doing so.",
        "My husband wrote a sweet note to me on our refrigerator that I found when I got home from work one day.",
        "My husband let me sleep while he took care of the baby, gave him his bottle and put him to bed.",
        "My husband surprised me with some really yummy doughnuts from a local bakery.",
        "My fiancA(c) stayed over from his shift at work so that I could see him.",
        "first beautiful event happen in yesterday i come on my office as regularly.duty is running suddenly my hubby give me surprise to come there.he take me for lunch we both spend time together after long time.this was very beautiful happiness time.",
        "Drinking and playing scrabble with my boyfriend a few weeks ago.",
        "My husband took us to a surprise holiday trip for 5 days",
        "On Thursday nights my boyfriend and I get together with a group of friends at different restaurants to have dinner and drinks and to catch up with each other. It is always a fun night on Thursdays and I look forward to it all week long.",
        "I bought a new house with my fiancee!",
        "Yesterday I got the good news that I am gonna be a father again, my wife is pregnant 2nd time. This is very big and good news for me. I am so happy.",
        "I went to Valencia, Spain for four days with my boyfriend.",
        "Watching my boyfriend do the Easter Egg hunt that I set up for him.",
        "My wife kiss me today morning that make me sooo happy",
        "On Valentine's day I got a first date with an absolutely beautiful and intelligent woman. We've been together since. I'm crazy about her. We have a great time and we're fantastic as a couple.",
        "Me and my husband was finally able to afford a car after going 3 months without transportation.",
        "I had been worried that my fiance hadn't answered my calls all day today when he was at work, so I was ecstatic when I saw him through the door and we realized his phone hadn't been working.",
        "last month my wife told to me she become pregnant. so i am really happy to heart that all day.",
        "My girlfriend came over and cuddled with me until we fell asleep.",
        "Within the past the months, my life has changed for the better. It has made me happy completely. My husband has been without a job for years now, and having to do things on my own really took a toll on me. Recently he has started working two jobs, and everything is being taken care of at home with his help. This has taken so much stress away that i am able to breath and be happy again.",
        "My wife and I were able to enjoy an evening out eating dinner and shopping for a new vanity at Lowes.",
        "I went to the cherry blossom festival with my girlfriend.",
        "I drank a bottle of wine with my significant other and watched a movie that we could laugh at.",
        "My wife and I recently received the video from our wedding and were happy to relive the memories.",
        "My spouse and I shared a funny conversation while making dinner.",
        "My husband bought us season tickets to a local attraction.",
        "last night i went to dance bar with my lover."
      ],
      "description2taxonomy": {
        "features travel or a vacation; specifically, the text describes a happy moment where the speaker and their romantic partner went on a trip or explored a new destination together, creating lasting memories. For example, 'My girlfriend and I took a spontaneous weekend getaway to a charming bed and breakfast.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=5012786884570046012",
          "description": "features travel or a vacation; specifically, the text describes a happy moment where the speaker and their romantic partner went on a trip or explored a new destination together, creating lasting memories. For example, 'My girlfriend and I took a spontaneous weekend getaway to a charming bed and breakfast.'",
          "texts": [
            "My husband took us to a surprise holiday trip for 5 days",
            "I went to Valencia, Spain for four days with my boyfriend.",
            "I went to the cherry blossom festival with my girlfriend."
          ],
          "description2taxonomy": {}
        },
        "involves a milestone or life event; specifically, the text describes a happy moment where the speaker and their romantic partner experienced a significant moment such as purchasing a home, having a baby, or getting engaged. For example, 'my partner and I closed on our first house together, which was a dream come true.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=6326000995948405458",
          "description": "involves a milestone or life event; specifically, the text describes a happy moment where the speaker and their romantic partner experienced a significant moment such as purchasing a home, having a baby, or getting engaged. For example, 'my partner and I closed on our first house together, which was a dream come true.'",
          "texts": [
            "I bought a new house with my fiancee!",
            "Yesterday I got the good news that I am gonna be a father again, my wife is pregnant 2nd time. This is very big and good news for me. I am so happy.",
            "Me and my husband was finally able to afford a car after going 3 months without transportation.",
            "I had been worried that my fiance hadn't answered my calls all day today when he was at work, so I was ecstatic when I saw him through the door and we realized his phone hadn't been working.",
            "last month my wife told to me she become pregnant. so i am really happy to heart that all day.",
            "My wife and I recently received the video from our wedding and were happy to relive the memories."
          ],
          "description2taxonomy": {}
        },
        "involves a first date or early relationship; specifically, the text describes a happy moment from the beginning stages of a romantic relationship, such as a first date or getting to know each other. For example, 'On Valentine's day, we had our first date, and we have been together ever since.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=-5311062312724480377",
          "description": "involves a first date or early relationship; specifically, the text describes a happy moment from the beginning stages of a romantic relationship, such as a first date or getting to know each other. For example, 'On Valentine's day, we had our first date, and we have been together ever since.'",
          "texts": [
            "It made me happy when I was able to surprise my boyfriend on his birthday. It made me happy seeing him happy.",
            "Went on a great date with this amazing girl I met.",
            "Yesterday night i talked with my girlfriend Keerthana up to more than 5 hours i was spoke with her. Both of us understood everything very well. We made for each other. I was so happy. Moving forward surely i will speak with her daily. I'm very happy about this.",
            "Watching my boyfriend do the Easter Egg hunt that I set up for him.",
            "On Valentine's day I got a first date with an absolutely beautiful and intelligent woman. We've been together since. I'm crazy about her. We have a great time and we're fantastic as a couple.",
            "My girlfriend came over and cuddled with me until we fell asleep.",
            "I went to the cherry blossom festival with my girlfriend."
          ],
          "description2taxonomy": {}
        },
        "enjoys a leisure or recreational activity together; specifically, the text describes a happy moment where the speaker and their romantic partner engaged in a shared hobby, sport, or entertainment, like watching a movie or going to a bar. for example, 'last night, I went to a dance bar with my lover.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=3311735687571402385",
          "description": "enjoys a leisure or recreational activity together; specifically, the text describes a happy moment where the speaker and their romantic partner engaged in a shared hobby, sport, or entertainment, like watching a movie or going to a bar. for example, 'last night, I went to a dance bar with my lover.'",
          "texts": [
            "After a long work week, I finally relaxed at home with my wife with dinner and a movie (Office Christmas Party).",
            "I spent a simple evening with my husband watching a TV show and caressing his hair while doing so.",
            "Drinking and playing scrabble with my boyfriend a few weeks ago.",
            "On Thursday nights my boyfriend and I get together with a group of friends at different restaurants to have dinner and drinks and to catch up with each other. It is always a fun night on Thursdays and I look forward to it all week long.",
            "Watching my boyfriend do the Easter Egg hunt that I set up for him.",
            "I went to the cherry blossom festival with my girlfriend.",
            "I drank a bottle of wine with my significant other and watched a movie that we could laugh at.",
            "My husband bought us season tickets to a local attraction.",
            "last night i went to dance bar with my lover."
          ],
          "description2taxonomy": {}
        },
        "celebrates a professional achievement; specifically, the text describes a happy moment where the speaker or their romantic partner experienced a success at work, such as a raise or promotion. For example, 'My husband got a sizable raise at work, and we celebrated together.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=4241699073140323477",
          "description": "celebrates a professional achievement; specifically, the text describes a happy moment where the speaker or their romantic partner experienced a success at work, such as a raise or promotion. For example, 'My husband got a sizable raise at work, and we celebrated together.'",
          "texts": [
            "My husband got a sizable raise at work."
          ],
          "description2taxonomy": {}
        },
        "shares a meal or treats; specifically, the text describes a happy moment where the speaker and their romantic partner enjoyed food or drinks together. For example, 'my husband made delicious chocolates again, and we savored them together.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=-3434169368521851486",
          "description": "shares a meal or treats; specifically, the text describes a happy moment where the speaker and their romantic partner enjoyed food or drinks together. For example, 'my husband made delicious chocolates again, and we savored them together.'",
          "texts": [
            "I haven't spent anytime with my wife during the past week due to her being a nurse and working 18 hour shifts. I finally got a chance to see her and we got to have breakfast this morning. Even though it wasn't that long, we got the chance to talk and see how each of us were doing.",
            "When I made a special dinner for my wife last night to make her feel better after a rough day at work. Her saying thank you really made my day.",
            "My husband bought me delicious coffee, dark, but not upsetting to my stomach.",
            "I had a delicious dinner with my girlfriend last night.",
            "My wife came home with Schwarma Express for Supper, I was happy to have my favorite food on a day where I am already happy for not having to go to work.",
            "After a long work week, I finally relaxed at home with my wife with dinner and a movie (Office Christmas Party).",
            "My husband surprised me with some really yummy doughnuts from a local bakery.",
            "My wife and I were able to enjoy an evening out eating dinner and shopping for a new vanity at Lowes.",
            "I drank a bottle of wine with my significant other and watched a movie that we could laugh at.",
            "My spouse and I shared a funny conversation while making dinner."
          ],
          "description2taxonomy": {}
        },
        "revolves around spending quality time together; specifically, the text describes a happy moment where the speaker and their romantic partner simply enjoyed each other's company and cherished their time together. for example, 'we went for a lunch and spent some beautiful, quality time together after so long.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=-100540725430242474",
          "description": "revolves around spending quality time together; specifically, the text describes a happy moment where the speaker and their romantic partner simply enjoyed each other's company and cherished their time together. for example, 'we went for a lunch and spent some beautiful, quality time together after so long.'",
          "texts": [
            "first beautiful event happen in yesterday i come on my office as regularly.duty is running suddenly my hubby give me surprise to come there.he take me for lunch we both spend time together after long time.this was very beautiful happiness time."
          ],
          "description2taxonomy": {}
        },
        "describes an act of kindness or support; specifically, the text recounts a happy moment where the speaker's partner helped or supported them in a meaningful way. For example, 'my husband stayed up late helping me prepare for a big presentation at work, and it made me feel so supported and loved.'": {
          "node_name": "root_id=11_node=-5709081636111590791_node=-8951205925381621224",
          "description": "describes an act of kindness or support; specifically, the text recounts a happy moment where the speaker's partner helped or supported them in a meaningful way. For example, 'my husband stayed up late helping me prepare for a big presentation at work, and it made me feel so supported and loved.'",
          "texts": [
            "When I made a special dinner for my wife last night to make her feel better after a rough day at work. Her saying thank you really made my day.",
            "My husband wrote a sweet note to me on our refrigerator that I found when I got home from work one day.",
            "My husband let me sleep while he took care of the baby, gave him his bottle and put him to bed.",
            "Within the past the months, my life has changed for the better. It has made me happy completely. My husband has been without a job for years now, and having to do things on my own really took a toll on me. Recently he has started working two jobs, and everything is being taken care of at home with his help. This has taken so much stress away that i am able to breath and be happy again."
          ],
          "description2taxonomy": {}
        }
      }
    }
  }
}