{
  "node_name": "root_id=4",
  "description": "root",
  "texts": [
    "Fred is nice as a person, but a terrible teacher. His lectures are confusing and top of that he will give you his own notes (looks like he used a typewriter) and expects you to understand them. He is old school, and very forgetful. I don't know anyone who is having it easy in this class. Very stressful and you need to make EXTRA time for this class",
    "Very clear lectures, she is amazing!!!!",
    "Course textbook: Hitchhiker's Guide to the Galaxy. Variable names Ford, Arthur and HHGTG were common. Lots of intel references. On a whole, really liked his teaching style. Wierd, geeky humor.",
    "Dr Terry is a horrible professor and doesn't like to make sure you understand.",
    "Karpinski is definitely a real gem. He gives you extra time to turn in papers. He is a fair grader. He has amazing lectures. He is more interested about you knowing the material than passing, so you most definitely will pass if you just show little effort in the class. I LOVE this man. I'm graduating if not, I'll take him again. ONE OF THE BEST!!!",
    "Wonderful prof. I didn't plan to continue on with spanish after I fulfilled my requirements, but she inspired me to do that. She's very helpful and is always helping plan very cool activities.",
    "Use the workbook to get help on the exercises. Write down anything that he puts on the screen. You can get a B if you ask questions and stay awake.",
    "Awesome teacher... makes class fun... easy to talk to and very carring!!! Come Back!!!!",
    "In a history of math classes I've taken Ive never actually received A's of any of my test. She even gave us candy ,DO the extra credit trust me it helps!",
    "lazy prof, not helpful to tend to students' questions. Not consistent with what she said would be covered on midterm/exam.",
    "She's been teaching for years & she's excellent at it. She cares about her students. You will have to do 3 speeches. If you pick topics that are compelling that no one else in the class would even think about doing then you will pass her class with a good grade. It's not easy A though, you will have to work for it!",
    "A course surveying 1000 years is not going to be easy but she knows her stuff. Take lecture notes, that's what tests are based on and read. Going to classes everyday is not unheard of, this class does require effort but you will be rewarded.",
    "she is probably the easist teacher you can get. She doesnt take attendance and gives study guides that make the test extremely easy, and homework is counted as extra credit. Super nice woman holds study sessions if you are having trouble. Take it",
    "She was one of my best Professors - her classes were memories I will keep for life. Thank you!",
    "By far the best teacher, and course that I have ever taken in my life. This class is a lto fo hard work but you enjoy it. There is a lot of reading but most of the class time is spent on discussions. Every educaiton major should take this course with Dee.",
    "terrible. can't teach. Very confusing. I droppped her class",
    "take music theory with Dr. Roter. He is a great teacher and as long as you pay attention in class you will do fine! He keeps the class interesting and you will learn A LOT.",
    "Great and fun guy. Not very hard to get an A in his class. And you still learn!",
    "I love you! You are the best teacher I have ever had! Thank you for all your effort and enthusiasm!!!!",
    "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
    "The guy is smart but can't teach for his life. The math is EASY and the book is very good. So if your even decent at math then definitly take this course. Subjects include compounding interest, probability, election theory, etc.",
    "He treats his students with respect and likes to push them to think about their beliefs from all angles.",
    "This class was very difficult to me! She went over her notes and just read them...i felt like i didnt get enough explaination for the stuff she was teaching! Only grade she gave during that class was our test grades...so be prepared!",
    "Nice guy, but long lectures. I had him for 3 hours once a week & most of the class was gone halfway through. Class is straight lecture with no powerpoint or visual aid, so easy to zone out. 2 essay tests worth half your grade, so outline and prepare well for those, & go to SI sessions! Extra credit is offered but ya gotta be there",
    "Very helpful in TA sections but not so much in lectures because it's difficult to be specific in philosophy with 300+ people in a room.",
    "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
    "Tabitha is stict and pretty dense on the material. She obviously knows what she's talking about but she moves really fast though her lectures, leaving the class scrambling to jot everything down. Her quote ID's are obscure and difficult to succeed in without memorizing the whole text. But she is a fair marker in other regards.",
    "Loves C's like they proved his teaching skills. Is ill tempered and generally just annoying, avoid if you can, especially for reporting.",
    "Great Professor,very knowledgeable and he is always there for his students.",
    "Prepare to do a lot of outside study to learn anything in this class. All lectures are just PowerPoint slides and frequently have mistakes in them. He takes off points on HW & tests for things like not showing work on basic math and not using the exact format he uses on formulas. He also has a hard time understanding any questions people ask.",
    "His lectures put me to sleep. He needs to be a little bit more exciting ...",
    "Other comments posted are bunk. Although he is conservative, he is very respectful of students who offer opposing views. Since con law is convoluted, inconsistent, and contradictory, Wilkins presents it as \"clearly\" it is.",
    "He is \"quite literally\" the best professor at CCC. You will learn so much from him because he isn't afraid to tell the truth. Lectures are long, but he is absolutely hilarious. Great class",
    "Best and most helpful professor I've had at Millersville. Would not recommend skipping any lectures. But she is very useful at office hours and responds to emails quickly. I think the tests are fair and she prepares you for them in lectures. Plus homeworks are very easy and are good grade boosters",
    "A very good and passionate teacher. He really cares about the material and is very helpful and compassionate toward students. Nicest guy in the world!",
    "Ms. Maguire was great. I took Intro and she explained the material well. She is obviously passionate about the subject and her enthusiasm made it interesting. It is possible to do well if you do all assignments PLUS practice problems.",
    "As long as you participate in class and ask lots of questions, you will do fine. I paid attention during class, followed instructions with regards to writing lab reports and asked a lot of questions and I got a solid A.",
    "Professor Gendron is probably the best professor at Assumption College. He gives you the honest truth and actually talks about stuff that is relevant to today's society. His lectures are extremely interesting and he is more than helpful during his office hours. But don't be on your cellphone during class.",
    "His papers are so hard to write. He is very unclear with what his guidelines are for the paper. He seriouly needs to know that we aren't taking this class because we want to. But other then that he is a very nice guy.",
    "very easy A. hes not to good of a teacher, but if youre looking for an easy A, that is the teacher for you.",
    "very nice man, although the lecture is some what boring however he explains very well; easy to understand his lectures and he's been very helpful; best prof i've seen @ UW",
    "Intelligent. Ahead of the Game. Expects Professionalism. Learning will occur. Take His classes at any cost!",
    "She was very dry and boring. Kindof graded weird. I really don't think she liked that class a lot, she is more of a soc teacher so I never felt her dedication to crimj.",
    "Mr. Howard was a great teacher. Laid back and easy-going. He's the type of guy that you could go to a bar and get a beer with. Learned a lot from him.",
    "Professor Unger was very clear about his expectations and good about communication. The material was laid out in a manner that you could work at your own pace for the most part. The journal was tough but that is because it required a LOT of introspection. Study guide for final was awesome. I enjoyed the class a great deal.",
    "Everyday I left with a migraine. HORRIBLE. Her voice makes me want to cringe. I can't believe I have to take more classes with her for the ECE major.",
    "Hott....very hott...caries a picnic basket a LOT...i dont know why...but not a good teacher...fun to look at, but not a fun teacher.",
    "Good Teacher, you learn lots of info in class but she grades to hard on little****!",
    "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
    "the class is very easy he gives you the answers to the tests on a study guide.",
    "I had Prof. Sussman for Intro. to Media Criticism. Her classes are very interesting and she knows what she's talking about. It's really easy to get a good grade in the class as long as you listen to what she has to say. The tests are a lot of writing, but she prepares you really well.",
    "She was an absolutely amazing professor. I really loved her. She just had so much positive energy and such a great attitude. She made me appreciate Theatre. If you have any chance to have her, do it! You won't regret it. Very easy and fun too, I miss her as a professor.",
    "Very sweet, a little absent minded sometimes but to a minimal degree without too much interference to her teaching. Her critiques were nice because she could usually point out a projects merits but balance it with constructive criticism. You'll enjoy her class if you enjoy a lot creative freedom.",
    "Mr. Tyson is an inspiration. If you plan to use any college degree for any area, you should take his biology course. While his daily tests are annoying & if you don't keep up, you're flunking by the 2nd week. But if you read the daily requirement you will have no problem with the simple tests. It prepares anyone how to study for a college cours",
    "SUPER LAID BACK. pretty simple class; read - take quiz - some papers - a group presentation at the end - the the final paper. Very nice man. I would definately recomend him and this class. Easy GE!",
    "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
    "Hard grader, uninteresting lectures",
    "Often unfair and arbitrary in her grading.",
    "Incredible woman with such a large heart and lots of stories. I loved talking to her and miss presence here a lot. She really helps you understand the texts with all of her background information and makes lectures interesting. Hopefully she'll be back in Spring 06.",
    "I absolutely love Dr. Woolard; she's a kind soul, and she genuinely cares about her students and wants to help them succeed. The class is not difficult, though I did experience some technical difficulties with my computer which she was always willing to work through with me. She doesn't believe in making a subject harder than it needs to be.",
    "Don't do this to yourself!! Seriously. He's a horrible teacher. Absolutely horrible. He gets mad when students ask questions and he disgards questions most of the time. He is so lost on what he's teaching... he def will not help at all!!",
    "One of the best Profs here. Outstanding teacher!",
    "He teaches like a kid that is excited for a present on Christmas but it makes a usually dull subject engaging. I had him in the morning and he was almost better than coffee for waking me up.",
    "Took this class in summer. I cannot recommend anyone to submit themselves to the hellish confusion and utter futility that pervade this professor's classroom.",
    "Very intelligent guy but has trouble teaching it to others. He got off topic easily. We used three books that seem to be above what students can comprehend. Students really have to think to connect what the books are saying to web design. Hated the Tufte book. Exams are pretty easy if you have the slightest idea what you're talking about.",
    "I had him for an internship advisor....he made me not want to do ANYTHING in psychology. He shoots down your dreams",
    "Arlan is probably the greates prof ever. Super funny, super enthusiastic, you learn alot while having fun. Super smart guy who wants you to do well. Take his class over anyone!",
    "He refused to put any grades in the grade book. I had no other errors in my papers, except him writing \"confusing\" next to seemingly random sentences in my paper, somehow warranting me with a C grade on most papers. English has always been my strongest subject, and I usually ace papers. Not with this guy. Miss a peer editing day? 0 on that paper.",
    "Very knowledgeable! good pace!",
    "She's a little over the top, to the point where I'd even say she's annoying. She's obnoxious and loud, which can be cool but only in moderation. Sitting through an hour and a half class twice a week was a bit too much of Shelly for me.",
    "I would not recommend her. She rambles incoherently, is unprofessional, disorganized, and condescending on top of all that. She is not motivating or inspiring..she is depressing. Definitely not worth the time or money.",
    "Keeps the classes interesting. Even plays games with the class. Very friendly and likes being a teacher. Too bad most professors at Loyola aren't anywhere near as good.",
    "She was a hard grader but she always explained what was deficient clearly. The homework was not extremely long, except on a few instances. She had trouble with a new book this quarter, but she graded us less harshly where she knew we would have troubles. Her lecture often differed from the book, but her lectures were in-depth and explanatory.",
    "I cannot understand how anyone can say that Dr. Kent does not offer feedback. He is always available after class and during office hours. He will answer any questions you have but you have to ask. Don't expect him to know that you don't get something. ASK HIM. Tests are intense but he practically gives you the test in his reviews! STUDY THEM!",
    "Sometimes unorganized and boring but seems to be passionate about education.",
    "Just took the map test and got 100. One more test and one final. They are not cummutive",
    "Theres really nothing wrong with him. He does teach concepts, not plug-and-chug. You can get an A if you just know 2 of formulas covered going in to the exam. He has a lot of cool demonstrations and relates material to real life situations that he uses his free time researching for us.",
    "Amazing teacher! Had her for my online College Alg class, and she is so helpful with any questions you have. I would take one of her classes anytime!",
    "Very helpful. A terrific instructor!",
    "You have to GIVE UP to not pass.She is very willing to help you unless you are always absent & act like you could care less.She WILL answer your Q's & sometimes right before the tests students could write a problem on the board from the study guide. I got a B b/c I never did word problems.Also,HW isn't too important,it's more about your test grade.",
    "Notes and text contradict one another, takes her forever to get through one slide, don't even bother trying to understand her, notes online which is helpful",
    "This teacher always has something funny to say. He has an interesting bonus mark system. Only complaint I have is that his tests are VERY long.",
    "Sun needs a translator to teach in the US. He should take ESL himself before teaching others. I can still vaguely remember his incessant mumbling that maybe only he thought was actual language being spoken. Impossible to understand. He could have been speaking amazonian or latin for all we know.",
    "4 week online ACC 202. Hmwrk is very time consuming, can use \"check my work.\" Suggest getting a perfect score on HW since the tests are hard. There IS NOT enough time for the tests. Answer questions you know and then figure out what you don't since you WILL run out of time. Available for questions via email. Clear layout of HW and points. No EC",
    "I loved his class! I think Prof Shangraw is amazing, very knowlegeable and concise. Tough grader, but what do you expect? Its a tough field. Very helpful. He knows his stuff, plus a VERY nice guy, with hot daughters.",
    "I have never been so simultaneously entertained and intellectually stimulated by a professor until I took Media Crit taught by Sue Collins. Sure, the class was challenging but never painful; everything we learned was of critical importance to understanding the backbone our society. SUE COLLINS= learning, enlightenment, and great comedy.",
    "He is an awesome prof! I loveee his class. Very interesting stuff and he makes them so easy to understand! Thanks prof. Bartel!",
    "Gendron is the Best! He is SO hot! He is an awesome teacher. His method of teaching is really helpful, in and outside of the classroom.",
    "Great lady but puts a lot of your grade on attendance, the class is super easy and fun",
    "Not a great teacher; pretty impatient if you don't understand",
    "This class is a complete waste of time; the entire class time is spent filling out worksheets with no explanation on how to actually teach the material to children. Her tests are mostly fill in the blank/short answer and are 100% information from the book that has nothing to do with what is gone over in class.",
    "His class is awesome. It is very interesting & you learn alot of stuff you can actually use. There are no real tests in his class, just a lot of assignments. I'd take him for any class, but I think all he teaches is Strategy.",
    "Boring lectures, easy grader.",
    "Alright prof. Classes were rather monotonous since he's a slide reader. All important info is on the slides. Make sure you copy the slides in class as much as possible, since some info is missing or different on the slides he provides online. TA's are useless and have unrealistic expectations, but prof is willing to help with any issues.",
    "This teacher is the bomb, She is easy, you will just have to do a couple papers, and her tests are also easy. If you try really hard, then u wasted ur time, u can barely try and get a B, or try a little bit and get an A. Shes is so easy to understand, and she isnt boring.. TAKE THIS TEACHER",
    "thoroughly enjoyed him as a teacher and as a person...very helpful.",
    "very cool, fun, interesting",
    "The hardest easy A you will ever get. Sitting through this class is absolute torture. I do not understand how someone who does so little can still be a professor. Do NOT take his class. The A is not worth it.2",
    "He's certainly got little patience outside of class and isn't very accessible in general, but if you do the readings and come to class you can get by easily.",
    "Best professor I've ever had. I want to be her when I grow up.",
    "rad dude",
    "People make Peter Bloom sound like the most inhumane pompous person ever to inhabit the planet. But he's really an excellent professor. I have learned more from his classes than any other classes I've taken here. Even his tangents are informative. Take his seminars, they're worth it.",
    "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
    "If you're a student who is horrible at taking exams or actually have a life and have to work in order to pay for college, do not take any course with Professor Kurylo. His class is 96% exams and 4% attendance. No extra credit, no project and no presentation. He does not care if you fail:(",
    "AMAZING. Very clear, easy work. 10/10 would recommend. Very nice, give A LOT of extra credit, take advantage! I would definitely choose her as my professor again. Tests are super easy and you have so much extra credit you'll always pass.",
    "Very pretty.. hard to concentrate.. good teacher",
    "i have been at georgia perimeter for the last 2 and half years and i never had such a horrible teacher than dr. chapman. He made us buy a book but we never opened it. Never gave any specific notes and this exams are hard which he doesnt even cover during class. Test are short answers and essays and no study guides. He only has 2 grades so pretty mu",
    "Weber is a freaking amazing teacher did his Layers of Rome Trip, thought it was going to be a party. You go over there to learn! I learned more in one month with him than any other professor. He's a tough grader, expects a lot from you and is truly one hell of a teacher. If you want to learn, take this class if you want an easy A keep walking.",
    "Non violent warior is so boring",
    "I took this class for an 8 week semester. I'm pretty good with Microsoft Office in general, so this class was pretty easy. Plus, Herbert is very nice and everything is very clear. I even emailed her and asked if she would open a couple tests up early so I wouldn't have to take it finals week, and she totally understood and opened them up!",
    "This Professor is awesome! He's so helpful and he's really interested in helping students learn. He encourages discussion inside and outside the classroom and he teahes you how to look at subjects from a new angle",
    "Currently taking this class. Englander is an excellent professor. The material is hard but if you pay attention its really not that bad. Tests are challenging but you can bring a page of notes and he is generous with points. I definitely recommend taking a class with Irv. He's worked with computers since they were invented and he knows his stuff.",
    "Good professor. Putting aside his monotone inflection, he was an excellent teacher, and I enjoyed the course.",
    "LOVE! She is definitely the best professor I've had at Denison. She is super interested in the material and gets you interested even when the material can be very tedious. Great class I'd suggest her to any and all students. Side note I liked her so much I made her my advisor and she teaches the farthest thing from my major.",
    "Fitch is quite knowledgable. Get on her good side and pay attention to details. Go to section. Write your papers very straight forward. Those are graded by your TA so suck up to them",
    "Amazing teacher overall, there's 6 required assignments throughout the semester. Three in class essays and three home research papers. Overall he was an outstanding teacher, would definitely recommend.",
    "Great teacher - highly recommended. I didn't always go to class, but you can really get behind if you don't. Doing the homework really helps to get in gear for the tests. The tests aren't bad - except the final - which he has no control over and which I felt completely unprepared for. HOWEVER he gives a mighty curve for it.",
    "Good teacher. Helpful, if you are here to learn about stats he can help you understand it by simplifying it. I get his class and it's easy to understand though I worry about his health. Don't listen to people's complain about him because they have no interest in math and does not know any bad teacher. I would recommend him to my friends",
    "One of my favorite profs. Went off on weird tangents but obviously knew and loved the material.",
    "A Kindergarten teacher with a profesor's badge",
    "Interesting but the reading is very dry. Prof. is very particular about grammer and spelling on essay tests. He is a little dry but the material is interesting.",
    "I enjoyed his first year class (HIST1010) so much that I just had to take his third year one, and it was honestly well worth it! He is one of the best lecturer's around and funny as hell.",
    "At first she's intimidating, but once you actually began class she's awesome. Never had a better instructor. She brings in alot of outside content that relates to the work.",
    "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
    "The nicest guy in the world, not the most consice teacher. he curves the class big time.",
    "When you first meet him, he seems a little stiff and uptight but then he kinda loosens up. Hes not the funny guy but he is nice. Dont get the book, your wasting your money. Print out the power points for each class and take notes on them while he is speaking. You have 2 test (not midterm/final) and then the final. and also have to do a presentati",
    "AMAZING PROFESSOR! I wish i can take him again for another class..",
    "his econ 104 class was easy as pie. i never went and got an A. his economics of sports class is pretty easy. i never went and got an A-.",
    "meh",
    "easy A, in fact its so easy I got one even though I thought the class was math 108 ROFL im so smart!",
    "I've just finished his class. It was difficult but very interesting. His personality is fantastic. He seems to love what he is doing.",
    "Although she is very nice and approachable, she mumbles, not talks, VERY fast, and gets off topic easily ... no overhead notes or powerpoint presentations, which make lectures unclear and difficult to follow/understand",
    "Overall this class is easy. Just need to practice for exams or you will not do well.",
    "Although I wasn't really interested in the subject matter itself, Arlan is an amazing prof. He's funny, energetic and really made an otherwise boring night-class bearable. If you're ever interested in anything that has to do with music and technology, Arlan is your man. Highly recommended. (oh, and his assignments are easy as well :P )",
    "So many problems: 1)doesnt know how to \"teach\". 2) Cant hear the student asking questions. 3) Takes whole class to do 1 problem. 4) FORCES us to solve the LONG and HARD way. If not done like how he done it, minus 10. I took Phys soph High school and i have 3.6 GPA, so no im not stupid. His class is just horrible. ACC needs to fire him, IMMEDIATELY.",
    "Most Brilliant mind I have ever met. Went from meeting you at 0 or any other place and took you to 100",
    "He's an excellent teacher, always willing to help. Lecture is very interesting. Be prepared to work hard. He is hottt!!!",
    "Very boring professor, his exams are half essay, half multiple choice. His only classes seem to meet once a week, avoid missing classes. Very poor time management, with holidays, we got to the final week with 10 chapters of material left. Extremely difficult to get in touch with as well. Take Schupp.",
    "I can't believe this guy taught Intro! If you don't get a 'C' average on all 4 tests, you automatically get an 'E' regardless of your lab grade! I went to every lecture (except 2) and come exam time everything was foreign! Not recommended. Lab was great, but lecture destroyed many! Had to retake!",
    "I was excited to learn Anthropology but I should of taken another Professor. He is ok I guess but pretty much the only thing he taught us was the definition of Anthropology, go to youtube and watch random videos. We had only one test and 2 papers. I prefer tests because I hate writing. He is a good professor but I would of wished I learned more.",
    "Muckell is the absolute best. Nyack should be lucky to have him. He is honestly the only reason i ever even stayed at Nyack. The school has so many problems and is so messed up it needs more people like Muckell.",
    "So far he seems like a good guy. Very animated",
    "Show up for class do all your assignments and any extra credit that is offered. Make sure you study the power point presentation and the word definitions that are listed in the chapters. If you do those steps you will pass the class with no problem. Make sure you are on time for class. Once the door is close we will not be allowed in the class",
    "This may be the most repugnant instructor of my entire education.",
    "Her actual class was not bad we had interesting converstaions, and lectures were interesting. Attendance is 10% of your grade, so if you plan on attending class thats a plus. You have 3 TEN page papers in this class, the rubric is not great, she is impossible to get a hold of, and if you do poorly she gives almost no feed back or reasoning.",
    "LOVED this class! I recommend it to EVERYONE with this prof! He teaches things beyond the textbook and has helped me with life skills.",
    "No extra credit. She is pretty cold hearted when it comes to making up work. No true class involvement, although we had a couple of quick \"partner\" projects. Most of the work is busy work that doesn't support the material. Her lectures were dry and uninteresting. If you get a class that uses a remote control for answers, I recommend you drop it.",
    "Oh God! She is aweful and biased. Don't ever take her class unless its the last class on earth and you have no other choice. even then, it would be better without HER class.",
    "Incredibly awesome guy, very helpful, but his expectations for a non-science major are unfair. Not one person in class was a business major and he expected 6 hours per week at least for studying outside the classroom and that we study it everyday. I would not take this class again given the chance. Plus it had a lab... and lab project!",
    "Convince a classmate to take notes for your and then show up for test days. You will do fine. Tedious note-giver, this class is common sense - learn the vocab and you'll do fine.",
    "Never seen such moran professor. He should dismiss from the shool.",
    "Deviant Behavior was the best class I've taken at Assumption. The class is very easy for the most part because you are studying how people defy norms in society. Gendron's lectures are AWESOME. Best I've had. He gives examples with the notes WHICH ARE ESSENTIAL for your in class essays. Overall, amazing professor, and great class.",
    "Not sure how he got the negative ratings, but the Prof was the exact opposite of what was stated on here. Prof was very clear, very good, and the class was really interesting.",
    "Madden is a funny guy and I found his class somewhat interesting/entertaining. The tests were moderate and the only other assignments were to read 3 novels throughout the semester and do a book analysis on each which weren't hard. My TA was good too. Attendance not required.",
    "Very intense history class. A lot of reading, and a huge amount of material on each exam. Only take if you love history; if your filling an elective, you're probably better off in a different class",
    "I had him for business calc and he made everything easy to understand. If you go to class and pay attention there is no way you can fail. He is very nice, cares about his students, and approachable.",
    "Professor Cameron is a really enthusiastic guy, he is so well learned and his lectures are never boring. He really knows his stuff. He is a really tough grader though, I would get a B+ on his exam and he told me I did extremely well.I don't consider a B+ an extremely good grade, but he does. Focus on the topics he emphasized, they'll n on the exam",
    "She is one of the best teachers so far. She is very helpful. When she is grading, she comments what is wrong about the paper so it will become better. Very helpful!!I wish I had taken her for 102 but sadly I didn't :(",
    "dibble is a joke.",
    "LOVED HER. she was my favorite professor EVER",
    "Not the greatest presenter (kind of boring actually) but you do learn good basic computer application skills. He gives 3 exams and a final along with a computer assignment from each software as well as a web page. It was very easy to make an A!",
    "Expects great things from her students. If you give your all, you will succeed--if not, you will not be respected by her. Weird sense of humor, took me awhile to \"get\" her. I bet she's fun when she lets her hair down!",
    "One of the best psych professors at Smith. He is organized and engaged and always willing to meet with students. His lectures and assignments are clear and organized so it is easy to study for his exams. I never wanted to miss a class!",
    "No doubt the worst teacher I had in four years at AU. Petty, mean spirited, unforgiving, rude, difficult, stingy with time and praise, unwilling to deal respectfully with young students.",
    "The lectures were hard to follow but he is a great guy and knows his stuff. Don' have to worry about getting the paper in on the due date, just get it in. He understands the meaning of GRACE. Thank you Jon!",
    "patient and concise",
    "He was not that difficult of a professor. His tests were straight forward and offered extra credit.",
    "Buy a digital recorder!!! YOU WILL NEED IT!!!! Take good notes, re-listen to lecture, re-write your notes, trade notes with someone else and you'll do great! Prof. Rose is straight up, honest and helpful! He's more chill if you get into the PM lab! Easy to talk to. Seems harder than he is! Do the work and you'll get a good grade! You have to earn i",
    "Jay is a great teacher and is very clear in his description of Calculus II concepts. He is extremely funny and always engaging during class. He's the perfect balance of a teacher who actually does an effective job of explaining material and making class enjoyable.",
    "Easy A but you have to suffer through Schneider's boring lectures. Recommended only for a GPA boost.",
    "This class is pretty difficult and he does a LOT of intense mathematical derivation, sometimes without the basics or non-technical explanation of what's going on. He's very helpful outside of class though - and is a really, really nice guy.",
    "He's great!",
    "Very helpful! He really understands students and is willing to work with you. One of the best professors I've ever had! Really funny as well!",
    "Paciocco presented the material in clean fashion. Sometimes he jumped around, especially during the winter term, but his lectures are inspiring and amazingly knowledgeable. If you want to learn criminal law the right way, Paciocco is your man. Just be prepared for rigorous fact pattern exams.",
    "i love this man. he is the best chemistry professor. if u hate and dont understand jack sht then take him. he explains really well, gives alot of examples, and doesnt move on until hes sure everybody gets it. the book isnt needed, but it helps cos u do problems off of it and it helps for the exams. hes funny too. great overall!",
    "Great teacher, I would definitely take him again. He keeps you interested and actually cares about the students not just his job.",
    "This is the best professor ever! If you don't love him, you are a lazy incompetent waste of space!",
    "If you strive to do more than just learn the material you will average out. She is a professor who is passionate, and therefore has high expectations. Prepares you for the real world.",
    "I loved him. He cares about his students. Go to class, do the work, and you'll get a good grade. I went back to school after many years and he helped me more than any other professor. He's fun and interesting. I wish I had more classes with him. A great professor. Easy A if you try.",
    "I am a garbage programmer but this guy is a very good instructor if you have the ability to learn programming. Easy going, helpful, will do half the code for you if you are struggling. Probably the best introductory programming instructor you could get. Show some effort and he will always help you.",
    "She puts too much of a workload on her students, and she doesn't even teach! She has groups present and teach straight from the book. Hello, who is the professor? Not to mention her grading scale is very steep, you have to be a perfectionist to get an A. You have no idea how she grades exams and what she looks for, so good luck.",
    "Even though we are slightly past midterms, I have thoroughly enjoyed his class. When I decided to take his class many people told me not to take it, but he is very personable. The best way to pass his class is to write down what's on the board and then refer back to the book to take more in depth notes. I will definitely be taking his class again.",
    "I like him as a friend but as a director/ teacher he sucks ass and has no tact. But he is a sweet man who thinks of his students as his children when he's not directing them. The YELLOW JACKET IS MINE!!!",
    "Bob.. Is fabulous! He helps people when they need help. If you are worried he will reassure you that everything will all work out in the end! He teaches you not to give up on yourself and to remember that you can do this work-- all you have got to do is try and take BOB!",
    "SO HELPFUL. oh my goodness! He finds ways to help me in between lessons! i was struggling with my tremolos for months and he said like 1 sentence and that fixed the problem. Great teacher!",
    "Study his examples and you won't go wrong with his tests very straightforward. The essays on the tests are not hard. Go to his office if you need him for help. Nice professor take him if you can.",
    "Ellis is the best! His open teaching techniques provide students with a exciting school experience. This class is not another blah, blah, blah...",
    "Hate science, he made me love it. Very interesting class.",
    "Nice guy, however the online course for history is hard to follow.",
    "just-above-so-so designer enforcing his opinions as well as some pretty insightful comments.. always has a kind word for the deserving, but dont bother with anything less",
    "I have had Dr. Bosworth for 3 classes now. This professor has a great personality and really enjoys interacting with the students. His website is full of useful material to help ace test. overall, assignments are easy, but do require effort.",
    "Wonderful teacher! This class is very fun! I would recommend him to anyone!",
    "Excellent teacher!! Always willing to answers your questions. I would recommend her to any students interested in Graphic Design. She is able to relate real world experience to us.",
    "Wallace is a pretty good professor.Her lectures were a bit dull esp at 9:30am,but the material is easy enough and as long as you read most of the txt and attend most of the lectures and RCT you shouldn't have any trouble.The hardest part about the class was finding the motivation to actually attend.",
    "I took his class for an easy A. I have a background in Finance as my family has been in different financial and investment fields for decades. It was an easy class.. if you agree with him. As a licsenced broker with 3 years of experience, I disagreed with some of the things he said. It wasn't a boring class, though.",
    "Easy if you answer all his study guides. One paper required regarding writing about a national park. Open book/note test and if you answer all the questions on the study guide, you should get an \"A\" in the class",
    "What's the point of paying a guy to tell us what to read in the book and then ask us what was in it? That's not education that's plagiate training.",
    "Very passionaite and understanding teacher! Extemely fair!",
    "hes cooler than a fan...a little strange but thats what makes the class fun...gotta keep up on your work or it'll screw you later...lots of essays but he gives you a long time to finish...1 take home test to help you out...because of his style of teaching the whole class ends up pretty close...hes o",
    "I Love Mrs Haynie! She is probably the funniest teacher I have had yet! She is so quirky! Her world lit class was one of my favorite classes.No textbook, just a study packet she has put together herself.Her test expectations are clear and she makes literature very interesting! Take this class!!",
    "got me into math...got me into calc...got me into WPI...best math tacher ever.....and he's a physicist not a mathmatician...I love it",
    "Easy class but the guy is a complete ass.",
    "He is very helpful and is willing to give his time to you. He also lets class decide if they want to be there or not at times",
    "That is a easy class",
    "I took her for an online class. She is a great teacher always helpful! The book work gets alittle hard but its not her making it up!",
    "Read the textbood and don't bother going to class",
    "HE IS THE WORST TEACHER I'VE EVER HAD. Author's notes, author's study guide, HIS TEST...and anything that could be unclear he DOESN'T CLARIFY. He sucks.",
    "You have to be organized to take this class! Not structured by week but by major assignment. Difficult if you don't already know how to write essays. Doesn't give feedback on rough drafts (peers do)only on your essay after its graded. Doesn't lecture - you learn by doing workbook sheets. 4 essays w/ rough draft, various exercises, online research",
    "She talks a lot, and most of the time after classes you will wonder why you even went. Her class is very easy and laid back and I never got anything less than a B. Attendance is not mandatory and she cancels class a lot of the time.",
    "Very up to date with current events. Very current content. Great sense of humour. Highly recommend, (you da' man now dawg!)",
    "Not a course for linear thinkers but the instructor was very good.",
    "View lessons online as needed to learn the material because as previously commented he simply goes through powerpoint, but it does appear that the powerpoint is designed by him to accomplish course objectives. Project is huge so make sure you get a responsible group. After this class I was definitely more interested in Databases.",
    "Lots of assignments. Very thourough when reviewing for test.",
    "really really easy. she's nice",
    "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
    "From what should be the most boring class (SAD), doing flow charts and drawings Dwayne actually manages to keep things interesting. He likes to joke around and pick on people but it's all in good fun. Although he can be tough on you in class at times his class is definitely my favorite.",
    "50% of our grade participation was given by attending class 10% was awarded for doing in-class readings and small projects, in which he would rarely assign! Quizzes are easy, online, and 20% of our grade. Midterm and final are 20% of the grade & are also online tests you take at home. If you can't get an A in this class, you're sad. Lol",
    "I felt penalized for my opinions. The assignments required very little work but were graded harshly. The final exam was ambiguous. In the classroom I felt overworked and undervalued.",
    "Class grade is mostly the projects which require a lot of time but are very useful to the real classroom and for the most part are interesting to do!! Dr. Wall is very helpful and one of the nicest teachers I've had!",
    "This guy's crazy classroom antics and enthusiasm for the subject by themselves make any class with him worth taking. He knows his stuff about mechanisms. He absolutely loves teaching this subject and it shows. He's also really lenient on homework grading. He can throw some curveballs on tests.",
    "I felt I did learn, although like the others, I felt the grading was easy. I was glad I took a music class instead of art!",
    "I feel like Dr. Andy is a love him or hate him kind of professor. Because he talks about things he likes poetry, film, music and gives lots of factoids in class, it could mean amazing or bust depending on what type of student you are. I personally liked him because I learned a lot during class and office hours. He nurtures creativity. A family man.",
    "Fisher seems like an articulate, personable guy and his lectures are interesting and simple to grasp. That being said, he's condescending in office hours and his tests never reflected the concepts he stressed in class. It's definitely not the easy elective people make it out to be, but it's probably the most interesting higher level biology class.",
    "What can I say, loved her and the class!",
    "Grading can be a little tough. He never shows you how to do the same thing the same way two times in a row which can lead to some confusion. Writes things on the board that aren't testable Looses you as you try to decipher what he's written down.",
    "HE IS A GREAT TEACHER I LOVE HIM........",
    "this is the biggest farce of a class that i have ever seen. and how can it even be considered a class if it's always cancelled? nice prof. but not a good one.",
    "Fun class, easy teacher and he's always smiling. Just show up do the assignment for the day and get an A! Joke of the day is the best",
    "Dan took the last two weeks of the semester off when material was taught (by TAs) that would make up 35% of the final exam. Tests were hard. Study at least a week in advance and read the text book. He is not a horrible man or teacher, hes just harder than other professors.. (he covered two more chapters than the other chem 2 class.)",
    "Wonderful teacher. You will learn so much about life and yourself in his courses.",
    "Her passion, extensive knowledge and understanding of children definately shines through each lecture",
    "Great fun teacher, very very funny makes this class fuN!",
    "AMAZING I LOVED MY INTRO TO SOCIAL WELFARE. SHE IS AN AMAZING PROFESSOR!!! : )",
    "People seem to either love or hate her. She knows her psychology, but she tends to lecture/yell at her students, and she didn't know my name until more than half way through the semester. She did bring in some great speakers, though.",
    "Energetic, passionate instructor. He is great to have discussions with, especially if you disagree with his viewpoint. He loves the discussions which is why we always ran behind. Didnt give grades on homework - just credit/no credit which was a nice change.",
    "She was awsome and by far the easiest and best professor ive had at uab!",
    "She was such a sweet instructor! I loved her classes! She was always so happy to see you in class! She brought out better writing skills from me. Pam was a good natured woman with a heart of gold!",
    "She uses a point system that confused most of the students. We had quizzes everyday over the chapters. Tests weren't too hard but she did provide one extra credit assignment.",
    "Very goofy. Very mind challenging but very interesting and fun.",
    "Professor Fox is extraordinarily knowledgeable. However, his lectures are invariably delivered at a snail's pace, in a very dry monotone.",
    "I really like Prof Fey. He is helpful and I think really looks out for his students best interests. The tests are hard but he always gave free points and his lectures are somewhat boring but he does his best to make them interesting. I recommend!",
    "She is definitely a feminist but an all around nice woman.",
    "very hard marker, but you will learn alot, excellent teacher!",
    "One of the best instructors I've had. Very helpful in all areas. Will do anything he can to help a student understand and pass the courses he teaches",
    "he is the best professor i have ever taken beware he is a tough grader and makes you work hard but he is easy to understand he cares for students as long as you care incorporates hip hop into his lessons sometimes which is cool we watched breaking bad in his class he teaches you everything he changed the way i think he changed my life",
    "Steve was not very helpful, the tests feel more like guessing games as they cover material we have not learnt in class. Worst teacher in the Business school.",
    "Has an accent, but doesn't make it any harder to understand. Open book test. Don't play around because of it though. Open book Math is not easy.",
    "Take another teacher. He'll do problems in class & make sarcastic comments about how much faster he can do them. Tests much harder with trick questions than other sections & u don't get to use formula sheet on final. You might learn more in his class but you are unlikely to get in A unless you've had AP chem and grading criteria not clear.",
    "Hard to make history of witchcraft uninteresting, but this prof does not seem to even know what he's talking about half the time. He does not respond to students questions effectively and does not prepare lectures well. He usually just ends up reading out of a book, or showing us useless movie clips. Easy to get extensions on papers though.",
    "Knows history and truly enjoys when students are engaged. This can be a really fun class. He talks about his stories and that annoyed some students, but I enjoyed listening to things I never knew about. If you want to learn, listen to what he says. Ask questions! He's very receptive to any questions",
    "The class really isn't that hard, though the books she chooses are boring. She's kind of ditzy though, and can be boring at times, but she is a fair grader.",
    "He gets bored with his own lectures and dismisses class early. You only need the access code really, no point in buying the book since you can get the code separately. He tries to tell jokes, I don't think he realizes we're laughing at him not with him, but whatever. Overall easy class to pass, worth putting up with Bosworth's strangeness.",
    "World Religions! Terrible Class so long and drawn out so many useless details but since we have to take it i guess this teacher was alright theres only 3 tests mostly from lectures",
    "She great! I love her. She tough yet hepfull!!!!",
    "hes pretty clear and patient with his students. Hes a very serious guy and you cant talk in class or that will deff sway your grade trust me... is it an easy A.. no but if you pay attention dont talk go to every class and show a lot of interest and get the moves the way he wants it then it will be..",
    "If you come to class you'll be fine. Spent a lot of time covering certain topics and then rushed through others. Very helpful if you go to his office hours, but beware, he may sit and talk to you for hours if nobody else is waiting. Knows a lot about his topic and overall is a very good professor.",
    "if you are aiminfg for an easy A she is perfect for that...",
    "His intelligence and personality is so sexy. Can't wait to take his Vietnam class next year. This guy rocks! By far the best prof I have ever had here at UVIC.",
    "Not very helpful to students at all. Questions in the study guide do not help and you spend so much time trying to memorize what you have read for the tests, that you don't have much time to learn other things.",
    "Vickie Lair is THE WORST teacher I have ever had. I would not be in her class if it wasn't the only opening left (wonder why?) She's confusing, forgetful, and very unreasonable when it comes to class. She doesn't post grades EVER. \"It's your responsibility.\" Her reviews for tests are barely that and she crams everything together. Don't take her!!!",
    "Very ill prepared and scattered professor. Very often goes off on tangents that don't relate to the class. She does not explain even basic concepts in a way that everyone can understand, and instead writes definitions followed by a poor example. If you don't understand after that you're sol. First test had various students with grades below a 10%",
    "Very Boring!!! She is elderly and soft spoken. Test are relatively hard; however, my suggestion is to take her as a hybrid class. You only have to meet 7 times and everything else is online. Also, study the slides over and over. On every test the time limit is really short.",
    "I took this class because it was suposed to be a fun class, and you would learn alot about international business. Dr. Carnes made it not fun. All you do in that class is read the text books, and talk about it. She will put you down if you get the answer wrong. Her tests are hard. I was very disapointed with the class.",
    "Prof. Delcastillo is one of the best if not \"The\" best online professor john jay has. No midterm or final everything comes from the reading. Pay careful attention to his instructions and you will do fine. Great class you learn lots wish he taught more classes at john jay.",
    "This professor gets your attention on what college is about. If you go into any med or science field, you need to take this guy. He will prepare you for MCATS, VCATS, PCATS. I would highly recommend this guy if you are going this route. Or even nursing. If you want a science for the hell of it, take someone else. I aced my bio part on my pcat",
    "I took an online class with this professor. He does not return emails or answer questions that student post on the discussion post. If you ask him a direct question, he will not answer it, instead he will get nasty with you. His instructions are not clear. He does not enjoy teaching or care for his students. will ruin your GPA, do NOT take him,RUN!",
    "Most likely the least helpful prof. I have ever had, gave tests which he openly admitted included subjects we had NOT covered in lecture....",
    "best prof in this univ",
    "He's literally the coach Carter of english....",
    "She often does the problems wrong in class which becomes very confusing. Also will not allow you to make up work even if you have legit reasons. Id suggest the MWF class rather than Tuesday and Thursday",
    "A good professor, helpful and smiling but the course are sometimes a little bit boring.",
    "Oh brother, I can see this guy being like Tony Montana at home. He explains everything clearly, but the tests are pretty difficult for someone who doesn't really \"get\" economics, but I rarely paid attention in class. Use the textbook, listen in class and take notes, and I bet this class wouldn't be too hard.",
    "His tests are difficult because of the short responses, but he is a great and passionate teacher",
    "HOT teacher, pretty easy. I'd rail it!!!!!",
    "Great teacher. Very clear and super intelligent. Kind and cute. I learned a lot.",
    "This class felt like my high school math classes. You have homework assigned every night, but not a lot. If you need help he LOVES to help. He's kind of a goofy guy so the class is a little bit more enjoyable for a math class. I would recommend him to anyone.",
    "Very tough grader! A very goof professor though! Explains everything very clear. You MUST study every night to pass his tests. His tests might not seem too hard but trust me they are very difficult! Would recommend him to anyone but you must be willing to dedicate A LOT of time to this class.",
    "Did not offer enough written assignments",
    "He is an incredibly caring professor and genuinely wants all of his students to pass. It's a credit/no credit class so it's really hard to fail unless you don't do any of the assignments. He believes in all of his students and is probably one of the sweetest professors at SJSU.",
    "freaky**** we had to study- it was too liberal regardless how open minded you are.",
    "Professor was had plenty of relevant professional experience to pull from, provided assignments that were effective \"advanced organizers\" and made good use of available technology. Also highly approachable and very helpful.",
    "Great guy, great class. Incredibly nice and willing to work with students. Show up for 121 and you're practically guaranteed to pass",
    "She is super awesome!!!!!",
    "Easy IF YOU PAY ATTENTION. She teaches based on application, not content. Expect things you don't know to be on the test. She grades easy but it is the tests that will get you. Make a study group - quizlet helps immensely with this class. Sweet lady but not the nicest of people, and will treat class as if it is an elementary school classroom.",
    "Women, Religion, and Spirituality was one of the best classes I took my freshman year. She is very sweet and insanely intelligent. The classes include almost exclussively women, but she really cultivated an interest in the subject for those not expecting to like it. This is a great gen ed to take to fulfill your CSI and Global Diversity flagsl.",
    "Well-spoken, highly intelligent professor. Not terribly outgoing, but really nice and helpful if you take the time to get to know him. Exam is tough...but, would still recommend.",
    "David is a really nice guy and does want you to do well. But, -He is late just about everyday. -During his lectures he jumps all over the place and it is hard to follow; boring. -The whole classes is writing papers; there are small papers every week and both the mid-term and final are big papers. -Very tough grader",
    "First, IT 101 is a joke so it really doesn't matter. Englander is a funny guy and you don't have to do much for his IT workshops. Just get an 80+ on the final and a guaranteed 4.0",
    "She knows what she is talking about. She is very clear. This is exactly how a history class is supposed to be. Her tests are very easy.",
    "Great professor! I took the class online and she was very clear on all assignments. She was quick to respond to e-mails and provided feedback on assignments. Easy 'A' if you do the work.",
    "Professor Stecker was very knowledagble about philosophy, however if you don't need to take the class don't take it. He gives you handouts with everything you need to know, but classes were very dry and boring. He had no clear scheduale and papers had no comments.",
    "If every professor was like Dr Allen, we all would be inspired. She is absolutely great.",
    "great teacher. you will learn more in his class in one semester. than any other history class available. i highly advise to take his class",
    "I knew very little about sound art before this class & this class was awesome. It's very hands on & the classes are jam packed with workshops, demos, visiting artists, performances, etc. Fun class!",
    "Well prety much the content of the was was not important and was not part of a real english class. We had to read poems and then have a quiz on the poems and not english content it self. I wish I had droped this class the first day I steped foot into it.",
    "Not quite sure how what he does is considered teaching. More like unencouraging. Terrible.",
    "Hysterical, very clear, will repeat fingerspelling as many times as needed for people to understand. just wish she enforced \"voice off\" a bit more.",
    "very cool guy, he made class interesting and really taught me alot. Good sense of humor and if you have a problem or need extra help, do not hesitate to ask he is totally there to help.",
    "Decent enough for undergrad courses but an absolute nightmare for graduate work. Will constantly blame you for stuff he demanded in his revisions. Very unorganized, doesn't have much knowledge on the graduate thesis process. I have sincerely regretted choosing him as my advisor. He will try to keep you there as long as possible for funding.",
    "The man is insultive and unable to conceed any point. He is an awful lecturer and his theories are ridiculous. What a waste of money.",
    "Fantastic professor. Loved his teaching. Took documentary survey from him. He opened my eyes to the art of docs, which I didn't understand before the class. He makes you write, so be prepared for probably 3-5 decent length papers. He will grade semi-tough but it's worth it. Some of the docs aren't the most interesting, but are valuable nonetheless.",
    "Tests were easy for someone with science background and study slides. Hard if you do not pay attention. Stickler on class etiquette. You will get a good grade on the papers if you include everything she requires (she gives you a rubic). Wants to be able to read the paper without trying to figure out what you are trying to say.",
    "Madden is a good lecturer, but not even he can keep me awake in class. This class basically depends on your TA. You can easily get screwed over on that. You'll be reading about 3 novels, and have a midterm and final. You'll have to study so watch out if you're lazy.",
    "one of the most exciting profs at U of T. and that's not just because she's so hot. which makes me wonder - where are all her chili peppers?! is anyone more deserving?",
    "Frank Foster is a great professor. He is very knowledgable. It's nice to be taught by someone who is in the business field!! Would recommend him!!",
    "Very nice guy and really cared about his students. He has some really great stories.",
    "soooooo niceeeee, take her during the summer she is a garenteed A",
    "His reviews are always the test!",
    "Dr. Polin is one of the remaining few professors of education I know who actually give real grades. She expects her students to work and think. She is an amazing mentor to those who show up to learn. She is a nightmare for those who show up to get by.",
    "Dr. Cos, what the heck happened to all the rest of you. It seems that all the good teachers have dissapeared and left us with brainless and boring professors! For goodness sake John,get on the horn and do something about it! Cheers -Franco",
    "he illuminated modern philosophy, taught me how to teach myself, makes school fun and challenging for all levels of intelligence and aptitude simultaneously, and soes all of this with a kind of stoner demeanor that makes him all the more approachable. Everyone can and should take from Paul.",
    "Great class, easy, but you do learn a lot both from the text and instructors experiences. Great guy and easy going but can put you to sleep sometimes......especially after a lunch at Speeds Deli....MMMMMmmmm Speeeeds...",
    "Absolutely the best I've ever had. Really cares about his students, will take the time to help you. Not an easy class, but he makes even the most boring stuff interesting and understandable. Excellent!",
    "very cool teacher!",
    "This is the worst teacher I have had in my 2 years as a full time student at L.C.C. She is undereducated and asks for class input but if you speak up and don't agree with her she will embarrass you in front of the class and make you feel stupid. She is completely ignorant and the other psych profs I have had at LCC have agreed that she is a bad pro",
    "This man went out of his way to help his class learn. He really made biology understandable and he even made it relative to every day life. He drew everything out on the board and I thought that his lectures and labs were very colorful. Wonderful teacher!",
    "Very organized and always prepared for each lecture. Gives crystal clear explanations of slides and definitions during lectures. Tough but fair grader. The semester isn't even half over, and I consider him one of my favorite profs I've had. Take Breiner!!",
    "Iftode is a good teacher as long as you have some sort of background in genetics. If you have a solid background, I would recommend taking this class. If not, go elsewhere. Her blackboard is confusing and due dates are never really clear. She is really nice and when you ask her for help she is very helpful.",
    "My worst grade for a course so far in university. I think it's the annoying overuse of textbook material that makes the class hard. It's very frustrating when all of your marks come from exams (based only on textbook material), and there are no assignments or lab work. His slideshow notes are terrible - they contain only words and no explanations.",
    "Unreasonable professor who's too meticulous. If you're looking to take a class where you're graded according to your performance, this isn't the class for you. She has a set grading criteria on paper but fails to follow it herself at times. I highly recommend not taking her class.",
    "Prof. Wagman is a very nice lady but sometimes you don't know what to expect. As long as you study the textbook content and attend class regularly, you'll be fine. She won't specify which areas to study but that's fair as everything covered in class is test material. The best part is that she will get you speaking Spanish.",
    "Everything is on WebAssign (homeworkquizzes) except for the midtermfinal so make sure to get it. The ebook comes with WebAssign so you don't really need the actual book. I fell a little behind in his class, but caught up and passed with an A. Good luck. He's really laid back and a great teacher! You won't regret taking him. :-D",
    "very helpful, I was not even supposed to be advised by him, just showed up for some help, and he was available. above and beyond. some wish to complain about hard work and too many classes, but they are pre-med??! If you cannot take 5 hard undergrad courses at once, you will not survive med school",
    "I had him for calc 1. I would definitely choose him as a prof. again. Homework isn't mandatory which means quizzes and exams are the only thing he grades. I didn't study as much as I should have and when final exams came, I struggled. He's easy to understand and helpful outside of class. If you show up to class, you shouldn't have any problems.",
    "He has favorites in his class and he is not afraid to show them. He does spend more time on their questions.",
    "Great teacher with interesting experience and a delightful sense of humor. You'll learn a lot in his classes!",
    "She doesn't really teach, it's mostly watching movies on the chapters, and the movies are boring. She grades really easily & the assignments are easy.",
    "Prof. Adams has the students best in mind when she teaches this class. She gives you ample chances to get your work done and is very fair. I would highly recommend you take her class.",
    "The class was fine. You are allowed to take notes into the exams. So long as you put in the hours to prepare there is no problem.",
    "Awsome teacher. And her class is a complete waste of time as far as learning is concerned. But she could tell you eveerything you need to build your schedule and complete your major. And is just very passionate about sports. I recommend her highly",
    "perfect",
    "I spent a year and a half getting to know math again and was just starting to learn it, love it, breathe it. After this class, I almost never want to see another math equation. All love for the subject was nearly obliterated. Great guy, but ruined my confidence in my math abilities completely.",
    "This class was ridiculous. I usually enjoy my PSYC classes and teachers but I cannot say the same for \"Peg\". She is odd, repititive, hard headed and very dull. Just avoid this teacher and you shouldn't have a problem. Spending $80 on a book was **** because we never used it and the semester project was annoying because she is so damn picky.",
    "I agree ,he is very hard ,most of the time is wasted on graphs and not lecture from the text .Very hard and complicated .",
    "Had him for Bus 1 and personal finance. Very easy class, my book was hardly used except for tests. Lectures aren't very helpful for tests, but he does relate RL situations, through experience, to things in the text. Often absent, but I forgive him from his age. One of my fav prof, mainly from personality. Esy clas, teach urself if u want to lrn any",
    "Great teacher. Kind of rude at points, but you will definitely know Chemistry by the end. He is hard but fair and makes you work for your grade. You don't get formula sheets for the test, but with enough practice they're fairly easy to remember. Take this guy if you can!",
    "By far the best professor I've had the privilege to have at Denison. He's so enthusiastic about Biochemistry, and he will do whatever it takes to help you learn/understand, even if that requires him losing sleep. His understanding and willingness to help really made me want to do well in this class. If you get the chance, take a class with him!",
    "Terrible class, absolutely boring and poor lectures. Taught myself chemistry from the book because I couldn't take sitting through the lecture. If you have to take the first year chem lab, bless your soul.",
    "If you come to class, take notes on the '*' items, and spend maybe 15 minutes looking over your notes and study guide before the test you WILL make a A. This class is a must take uni. studies course and a great GPA booster :)",
    "... oops, i meant \"She's an excellent teacher\" not \"She's an excellent course.\" lol",
    "Makes the subject matter more interesting than many other professors can. Down to earth and understanding professor. Loves to play devil's advocate during open discussions, so don't take his comments personally. Much better class than expected.",
    "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
    "You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade. The exams are easy to pass as long as you go to the study sessions by the TA's! I've only been to this class on exam days, most of the information you need is given to you during the study sessions. Just study and you'll do fine.",
    "Take note of EVERY WORD that comes out of his mouth. He WOULD test you on it. Also read the text because he would test you on that also. In all it's about 120 multiple choice questions in 2 hrs. He gives credit for good attendance also. Other than that - he is a nice professor, very fair and to the point, and the class is interesting.",
    "Follows the syllabus. You will have a quiz at the beginning of each class based on the current topic. All test and quizzes are open book. Test your knowledge on quizzes to see your proficiency on the topic through tricky questions.",
    "This professor is THE WORST PROFESSOR I EVER HAD. He gets off the subject and talks about other things for over an hour, he drops point on papers for the most stupidest reasons, his online quizzes are all screwed up, and he is definitely boring; you will fall asleep. PLEASE SAVE YOURSELF THE TROUBLE AND HEADACHE...DO NOT TAKE ANY OF HIS CLASSES",
    "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
    "Doesnt know how to communicate to her students. Degrades her students by telling them they'll never make it in the health profession. Has no professor student interaction at all and refers to the book when questions are ask. Teaches to 1 sec of class.",
    "This was a online class, you do all your work & tests at home(except final)If you ever needed help Ms Sowell would work problems for you or offer to meet you online. She seems real nice and I would take her class!",
    "the only thing for your grade is 3 in class essays. and the lectures sometimes dont nessisarily relate to the midterms. however you can get all of the information by either reading the book, or going to the TA/SI led sessions",
    "great lady, but class is hard",
    "Don't take his class! All he does is show youtube videos and gives out only 2 articles so the entire semester. There are two response papers and a final research paper with a presentation to go with it. He's completely irrational when it comes to grading. Don't take a chance. Attendance is sometimes called out or sign in sheet. This guy is a mess!",
    "the class was so boring. He is my worst teacher in my life.",
    "Professor Sierra's class could not be any easier. I definitely liked the fact that there was no homework compared to the other TA teacher. Go to class, stay for the movies, jot down the notes, and review before the test. THERE IS NO REASON YOU SHOULD NOT GET AN A IN THIS CLASS!",
    "Took him for Internship Seminar. You can tell he's a good professor but he gives way too much work for interns who are already slaving away, giving 20+ hours a week to a course where they are getting 4 credits. Too much busy-work and writing that means nothing for a class that is pass/fail.",
    "Prof. H. Afshari was extrermenly helpful. Vey interesting man to listen to,he has seen and been through alot. definetly learn alot in his class.",
    "Let me start by saying no science course is easy. Especially biology. Mr. Wernli gives weekly quizez and keeps only your 10 best grades. there are 3 lecture test and 3 lab test. The lab test are easy if you study the lecture tests are hard! you really have to study your notes! if you are up for the challenge take him. over all hes ok. :)",
    "The class material was interesting, and he was always available for help/questions. Extra credit was made available. He's a really nice person and probably one of my favorite professors.",
    "Just dont do it....most of his class failed his test...highest grade was a C just drop it or take another teacher!",
    "The accent is the worst part, he's very hard to understand. But the class overall is easy to pass with little effort. Attendance isn't mandatory but homework is due every class. He reviews the class before the test and it's a great indication of what to expect on the tests. His tests are multiple choice and easy to do well on. Textbook used for HW",
    "Great Teacher! Very clear on what he wants and will help you anytime on any of your assignments and answer any questions, even if its not related to the course. He's very passionate about what he teaches and concise and considerate about everyone in the class.",
    "Several small papers required and a final 5 page APA style research paper. Her exams cover a lot of material but she works with you to get a better grade.",
    "She is one of the best profs at SJU.",
    "great guy, great teacher, highly recommend him",
    "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)",
    "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
    "Mark does expect a lot out of his students but he just wants you to succeed. He's always there to help and you can learn a lot from him if you choose to. DO NOT take this class unless you are interested in painting and have done it before! Even though the class was hard and time-consuming, it was definitely the best class I've taken at SSU.",
    "Dr Slusher is passionate about her work and nursing as a profession. I have personally enjoyed learning a about h e r experiences. She provides examples pertinent to content she is teaching and encourages class participation enhancing optimal learning. She sets high expectations for student success and accountability which I admire and applaud.",
    "Professor Levine is one of the worst teachers I have ever had. He is a mean grader, a boring lecturer, and an ultra-lib. He gives very few comments on papers and is very hard to find outside of class.I wish I had never taken a class with him.",
    "he's a nice guy, very interesting class, tough but do-able",
    "Great teacher! I loved this class . . . there were a few topics she went through a little quickly, but other than that she was very easy to understand.",
    "She picks great material for you to read and her lectures make you love it more. I read a lot more these days thanks to her.",
    "For intro level course he was impossible to listen to. I don't know if it was his odd mannerisms or slow, drawn out style but I found it impossible to pay attention in a subject I love. The material in class was less than half of what was on the test, reading the dry text was mandatory.",
    "The Lectures were very interesting after we got out of assembly language. Tests were somewhat unfair. The class was actually kinda fun to go to.",
    "He's too by the book and makes very rare exceptions. He's arrogant too sometimes.",
    "VERY monotone however as others have said he is incredibly helpful and labs are really easy marks!",
    "He is a fun professor, but there is a lot of reading to keep up with.",
    "Extremely helpful and available. Highly intelligent, you will learn alot from any of his classes if you will let yourself!",
    "You would not waste your time on his class. I wanted to become a better writer. I learned a lot from his class.",
    "To everyone considering taking him, heres a warning.Hes totally changed his style. No more quizzes or matching on the tests. The tests are all fillin and he gives no specificity on who to concentrate on so u have to know who over 300 people are for a test on top of at least 3 essays, which he grades hard. Cool dude, but be cautious.",
    "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
    "This guy complains about everything. What a clown shoe.",
    "I had Dr. Cavaiola for 3 classes-psychopathology, marriage, and family. He is not easy, but the best professor to take if you want to learn a lot. His classes are fun and interesting, and he is very professional and fair. He is the epitome of what a professor should be.",
    "Take theory 3 with him!",
    "She is a very nice, easy teacher. She will help you and give you time to get projects done. However, there was no method to her madness as far as how projects were weighted. But didnt really natter because as long as you did it fairly well, you got an A.",
    "Professor Potter is a really good and caring professor. He goes through his lectures at a good pace to make sure you get what you need. The only downside is that your graded on few things, but as long as you study hard its a great class to take.",
    "Great professor, enjoyed every class.",
    "Do not take this class if you just want to learn regular guitar, not just nylon string. This class is classical style only. You need to take 83A instead, there you can play acoustic or nylon string and you'll cover several styles. In Jones class, you have to play exactly how he tells you, so if you can't change your playing way, you won't be happy.",
    "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all",
    "IGNORE the last 9 reviews they're BS. Bob doesn't do EC and no paper. There are 2 exams he writes (60%), online hmwk (10%) and 1 department-wide final (30%) he doesn't write. Bob is great and his exams aren't easy but he gives you great reviews. The Final SUCKS! Bob never sees it so he can only help so much. DO WELL on Bob's exams you'll need it.",
    "Class seems easy. Attendance and Edmodo count a lot. Does not allow, food, gum, cell phones, nor drinks in the classroom, not even if its a 3hr long period. Other than that class is not that bad. her tests can be hard, but if you look over the chapter and notes, test should not be too hard. She would send out a review for the test, pretty helpful",
    "i have had him for 2 classes now. He is great. Pay attention in his classes and show up since he gives points for attendence. I got a 4.0 both times ive taken him. Love him!",
    "She is an excellent teacher. I took her 6 week class in the summer. I had to work hard but I was never bored in her 3 hour classes. She teaches with power point, video, overhead, discussion and presentations all in the same class. If you want to learn and do not mind working for the grade, take her. You will retain the knowlege years from now.",
    "He was a great prof. Made the class very interesting and easy to follow. Able to really keep your attention, I really enjoyed the class.",
    "His class was cake. We were scheduled to meet MWF but we only ever met on MW. His class is easy and you don't really have to do anything to do well other than your wellness project which still isn't that hard.",
    "I don't like how this teacher grades, some student I did better got better grades than I did for some reason",
    "She's really nice and makes an effort to get to know you. Her class is definitely challenging, but the benefits are great. I had an okay time in her class, it wasn't the best time but it wasn't horrific either.",
    "He is good professor. His assignments are not easy, but these are very helpful for your future. if you need to take eng300, I recommend him.",
    "she is a great grader. if you hand in a paper shell correct it and hand it back then you fix it and give it to her youll pass. she only uses your top 4 paper and test grades, and gets rid of the other ones.",
    "Excellent teacher. He explains everything very clearly, and keeps the class going at a manageable pace. If you don't understand something, he will work with you until you get it. If you're really interested in something, he'll encourage you further in it."
  ],
  "description2taxonomy": {
    "mentions grading or exams; specifically, the text refers to the professor's grading policies, test difficulty, or assessment-related issues. For example, 'Her exams are challenging but fair, with a mix of multiple-choice and short-answer questions.'": {
      "node_name": "root_id=4_node=-1500143740904423233",
      "description": "mentions grading or exams; specifically, the text refers to the professor's grading policies, test difficulty, or assessment-related issues. For example, 'Her exams are challenging but fair, with a mix of multiple-choice and short-answer questions.'",
      "texts": [
        "Karpinski is definitely a real gem. He gives you extra time to turn in papers. He is a fair grader. He has amazing lectures. He is more interested about you knowing the material than passing, so you most definitely will pass if you just show little effort in the class. I LOVE this man. I'm graduating if not, I'll take him again. ONE OF THE BEST!!!",
        "This class was very difficult to me! She went over her notes and just read them...i felt like i didnt get enough explaination for the stuff she was teaching! Only grade she gave during that class was our test grades...so be prepared!",
        "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
        "Best and most helpful professor I've had at Millersville. Would not recommend skipping any lectures. But she is very useful at office hours and responds to emails quickly. I think the tests are fair and she prepares you for them in lectures. Plus homeworks are very easy and are good grade boosters",
        "She was very dry and boring. Kindof graded weird. I really don't think she liked that class a lot, she is more of a soc teacher so I never felt her dedication to crimj.",
        "the class is very easy he gives you the answers to the tests on a study guide.",
        "I had Prof. Sussman for Intro. to Media Criticism. Her classes are very interesting and she knows what she's talking about. It's really easy to get a good grade in the class as long as you listen to what she has to say. The tests are a lot of writing, but she prepares you really well.",
        "Hard grader, uninteresting lectures",
        "Often unfair and arbitrary in her grading.",
        "Very intelligent guy but has trouble teaching it to others. He got off topic easily. We used three books that seem to be above what students can comprehend. Students really have to think to connect what the books are saying to web design. Hated the Tufte book. Exams are pretty easy if you have the slightest idea what you're talking about.",
        "He refused to put any grades in the grade book. I had no other errors in my papers, except him writing \"confusing\" next to seemingly random sentences in my paper, somehow warranting me with a C grade on most papers. English has always been my strongest subject, and I usually ace papers. Not with this guy. Miss a peer editing day? 0 on that paper.",
        "She was a hard grader but she always explained what was deficient clearly. The homework was not extremely long, except on a few instances. She had trouble with a new book this quarter, but she graded us less harshly where she knew we would have troubles. Her lecture often differed from the book, but her lectures were in-depth and explanatory.",
        "This teacher always has something funny to say. He has an interesting bonus mark system. Only complaint I have is that his tests are VERY long.",
        "I loved his class! I think Prof Shangraw is amazing, very knowlegeable and concise. Tough grader, but what do you expect? Its a tough field. Very helpful. He knows his stuff, plus a VERY nice guy, with hot daughters.",
        "Boring lectures, easy grader.",
        "If you're a student who is horrible at taking exams or actually have a life and have to work in order to pay for college, do not take any course with Professor Kurylo. His class is 96% exams and 4% attendance. No extra credit, no project and no presentation. He does not care if you fail:(",
        "Weber is a freaking amazing teacher did his Layers of Rome Trip, thought it was going to be a party. You go over there to learn! I learned more in one month with him than any other professor. He's a tough grader, expects a lot from you and is truly one hell of a teacher. If you want to learn, take this class if you want an easy A keep walking.",
        "Interesting but the reading is very dry. Prof. is very particular about grammer and spelling on essay tests. He is a little dry but the material is interesting.",
        "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
        "The nicest guy in the world, not the most consice teacher. he curves the class big time.",
        "Overall this class is easy. Just need to practice for exams or you will not do well.",
        "Very boring professor, his exams are half essay, half multiple choice. His only classes seem to meet once a week, avoid missing classes. Very poor time management, with holidays, we got to the final week with 10 chapters of material left. Extremely difficult to get in touch with as well. Take Schupp.",
        "I can't believe this guy taught Intro! If you don't get a 'C' average on all 4 tests, you automatically get an 'E' regardless of your lab grade! I went to every lecture (except 2) and come exam time everything was foreign! Not recommended. Lab was great, but lecture destroyed many! Had to retake!",
        "Professor Cameron is a really enthusiastic guy, he is so well learned and his lectures are never boring. He really knows his stuff. He is a really tough grader though, I would get a B+ on his exam and he told me I did extremely well.I don't consider a B+ an extremely good grade, but he does. Focus on the topics he emphasized, they'll n on the exam",
        "Not the greatest presenter (kind of boring actually) but you do learn good basic computer application skills. He gives 3 exams and a final along with a computer assignment from each software as well as a web page. It was very easy to make an A!",
        "He was not that difficult of a professor. His tests were straight forward and offered extra credit.",
        "Paciocco presented the material in clean fashion. Sometimes he jumped around, especially during the winter term, but his lectures are inspiring and amazingly knowledgeable. If you want to learn criminal law the right way, Paciocco is your man. Just be prepared for rigorous fact pattern exams.",
        "She puts too much of a workload on her students, and she doesn't even teach! She has groups present and teach straight from the book. Hello, who is the professor? Not to mention her grading scale is very steep, you have to be a perfectionist to get an A. You have no idea how she grades exams and what she looks for, so good luck.",
        "Easy if you answer all his study guides. One paper required regarding writing about a national park. Open book/note test and if you answer all the questions on the study guide, you should get an \"A\" in the class",
        "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
        "50% of our grade participation was given by attending class 10% was awarded for doing in-class readings and small projects, in which he would rarely assign! Quizzes are easy, online, and 20% of our grade. Midterm and final are 20% of the grade & are also online tests you take at home. If you can't get an A in this class, you're sad. Lol",
        "I felt penalized for my opinions. The assignments required very little work but were graded harshly. The final exam was ambiguous. In the classroom I felt overworked and undervalued.",
        "This guy's crazy classroom antics and enthusiasm for the subject by themselves make any class with him worth taking. He knows his stuff about mechanisms. He absolutely loves teaching this subject and it shows. He's also really lenient on homework grading. He can throw some curveballs on tests.",
        "I felt I did learn, although like the others, I felt the grading was easy. I was glad I took a music class instead of art!",
        "Grading can be a little tough. He never shows you how to do the same thing the same way two times in a row which can lead to some confusion. Writes things on the board that aren't testable Looses you as you try to decipher what he's written down.",
        "She uses a point system that confused most of the students. We had quizzes everyday over the chapters. Tests weren't too hard but she did provide one extra credit assignment.",
        "Steve was not very helpful, the tests feel more like guessing games as they cover material we have not learnt in class. Worst teacher in the Business school.",
        "Take another teacher. He'll do problems in class & make sarcastic comments about how much faster he can do them. Tests much harder with trick questions than other sections & u don't get to use formula sheet on final. You might learn more in his class but you are unlikely to get in A unless you've had AP chem and grading criteria not clear.",
        "The class really isn't that hard, though the books she chooses are boring. She's kind of ditzy though, and can be boring at times, but she is a fair grader.",
        "Very Boring!!! She is elderly and soft spoken. Test are relatively hard; however, my suggestion is to take her as a hybrid class. You only have to meet 7 times and everything else is online. Also, study the slides over and over. On every test the time limit is really short.",
        "I took this class because it was suposed to be a fun class, and you would learn alot about international business. Dr. Carnes made it not fun. All you do in that class is read the text books, and talk about it. She will put you down if you get the answer wrong. Her tests are hard. I was very disapointed with the class.",
        "Most likely the least helpful prof. I have ever had, gave tests which he openly admitted included subjects we had NOT covered in lecture....",
        "His tests are difficult because of the short responses, but he is a great and passionate teacher",
        "Very tough grader! A very goof professor though! Explains everything very clear. You MUST study every night to pass his tests. His tests might not seem too hard but trust me they are very difficult! Would recommend him to anyone but you must be willing to dedicate A LOT of time to this class.",
        "Well-spoken, highly intelligent professor. Not terribly outgoing, but really nice and helpful if you take the time to get to know him. Exam is tough...but, would still recommend.",
        "David is a really nice guy and does want you to do well. But, -He is late just about everyday. -During his lectures he jumps all over the place and it is hard to follow; boring. -The whole classes is writing papers; there are small papers every week and both the mid-term and final are big papers. -Very tough grader",
        "First, IT 101 is a joke so it really doesn't matter. Englander is a funny guy and you don't have to do much for his IT workshops. Just get an 80+ on the final and a guaranteed 4.0",
        "She knows what she is talking about. She is very clear. This is exactly how a history class is supposed to be. Her tests are very easy.",
        "Fantastic professor. Loved his teaching. Took documentary survey from him. He opened my eyes to the art of docs, which I didn't understand before the class. He makes you write, so be prepared for probably 3-5 decent length papers. He will grade semi-tough but it's worth it. Some of the docs aren't the most interesting, but are valuable nonetheless.",
        "Tests were easy for someone with science background and study slides. Hard if you do not pay attention. Stickler on class etiquette. You will get a good grade on the papers if you include everything she requires (she gives you a rubic). Wants to be able to read the paper without trying to figure out what you are trying to say.",
        "soooooo niceeeee, take her during the summer she is a garenteed A",
        "Very organized and always prepared for each lecture. Gives crystal clear explanations of slides and definitions during lectures. Tough but fair grader. The semester isn't even half over, and I consider him one of my favorite profs I've had. Take Breiner!!",
        "I had him for calc 1. I would definitely choose him as a prof. again. Homework isn't mandatory which means quizzes and exams are the only thing he grades. I didn't study as much as I should have and when final exams came, I struggled. He's easy to understand and helpful outside of class. If you show up to class, you shouldn't have any problems.",
        "Great teacher. Kind of rude at points, but you will definitely know Chemistry by the end. He is hard but fair and makes you work for your grade. You don't get formula sheets for the test, but with enough practice they're fairly easy to remember. Take this guy if you can!",
        "You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade. The exams are easy to pass as long as you go to the study sessions by the TA's! I've only been to this class on exam days, most of the information you need is given to you during the study sessions. Just study and you'll do fine.",
        "the only thing for your grade is 3 in class essays. and the lectures sometimes dont nessisarily relate to the midterms. however you can get all of the information by either reading the book, or going to the TA/SI led sessions",
        "Don't take his class! All he does is show youtube videos and gives out only 2 articles so the entire semester. There are two response papers and a final research paper with a presentation to go with it. He's completely irrational when it comes to grading. Don't take a chance. Attendance is sometimes called out or sign in sheet. This guy is a mess!",
        "Let me start by saying no science course is easy. Especially biology. Mr. Wernli gives weekly quizez and keeps only your 10 best grades. there are 3 lecture test and 3 lab test. The lab test are easy if you study the lecture tests are hard! you really have to study your notes! if you are up for the challenge take him. over all hes ok. :)",
        "Just dont do it....most of his class failed his test...highest grade was a C just drop it or take another teacher!",
        "Several small papers required and a final 5 page APA style research paper. Her exams cover a lot of material but she works with you to get a better grade.",
        "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)",
        "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
        "The Lectures were very interesting after we got out of assembly language. Tests were somewhat unfair. The class was actually kinda fun to go to.",
        "To everyone considering taking him, heres a warning.Hes totally changed his style. No more quizzes or matching on the tests. The tests are all fillin and he gives no specificity on who to concentrate on so u have to know who over 300 people are for a test on top of at least 3 essays, which he grades hard. Cool dude, but be cautious.",
        "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
        "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all",
        "IGNORE the last 9 reviews they're BS. Bob doesn't do EC and no paper. There are 2 exams he writes (60%), online hmwk (10%) and 1 department-wide final (30%) he doesn't write. Bob is great and his exams aren't easy but he gives you great reviews. The Final SUCKS! Bob never sees it so he can only help so much. DO WELL on Bob's exams you'll need it.",
        "I don't like how this teacher grades, some student I did better got better grades than I did for some reason",
        "she is a great grader. if you hand in a paper shell correct it and hand it back then you fix it and give it to her youll pass. she only uses your top 4 paper and test grades, and gets rid of the other ones."
      ],
      "description2taxonomy": {
        "emphasizes attendance or participation; specifically, the text refers to the professor's policies on attendance or classroom participation affecting the grade. For example, '50% of our grade participation was given by attending class, so make sure to show up.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=6377772758507464853",
          "description": "emphasizes attendance or participation; specifically, the text refers to the professor's policies on attendance or classroom participation affecting the grade. For example, '50% of our grade participation was given by attending class, so make sure to show up.'",
          "texts": [
            "50% of our grade participation was given by attending class 10% was awarded for doing in-class readings and small projects, in which he would rarely assign! Quizzes are easy, online, and 20% of our grade. Midterm and final are 20% of the grade & are also online tests you take at home. If you can't get an A in this class, you're sad. Lol",
            "I had him for calc 1. I would definitely choose him as a prof. again. Homework isn't mandatory which means quizzes and exams are the only thing he grades. I didn't study as much as I should have and when final exams came, I struggled. He's easy to understand and helpful outside of class. If you show up to class, you shouldn't have any problems."
          ],
          "description2taxonomy": {}
        },
        "describes curve or adjustment to grades; specifically, the text mentions if the professor applies a curve or adjusts grades in any way. For example, 'He curves the class big time, so don't worry too much about the tests.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=-5654607813242342332",
          "description": "describes curve or adjustment to grades; specifically, the text mentions if the professor applies a curve or adjusts grades in any way. For example, 'He curves the class big time, so don't worry too much about the tests.'",
          "texts": [
            "The nicest guy in the world, not the most consice teacher. he curves the class big time.",
            "First, IT 101 is a joke so it really doesn't matter. Englander is a funny guy and you don't have to do much for his IT workshops. Just get an 80+ on the final and a guaranteed 4.0",
            "she is a great grader. if you hand in a paper shell correct it and hand it back then you fix it and give it to her youll pass. she only uses your top 4 paper and test grades, and gets rid of the other ones."
          ],
          "description2taxonomy": {}
        },
        "mentions grading fairness; specifically, the text talks about whether the professor's grading is fair or biased. For example, 'I don't like how this teacher grades, some students I did better than got higher grades for some reason.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=2471125360997906784",
          "description": "mentions grading fairness; specifically, the text talks about whether the professor's grading is fair or biased. For example, 'I don't like how this teacher grades, some students I did better than got higher grades for some reason.'",
          "texts": [
            "Often unfair and arbitrary in her grading.",
            "He refused to put any grades in the grade book. I had no other errors in my papers, except him writing \"confusing\" next to seemingly random sentences in my paper, somehow warranting me with a C grade on most papers. English has always been my strongest subject, and I usually ace papers. Not with this guy. Miss a peer editing day? 0 on that paper.",
            "She puts too much of a workload on her students, and she doesn't even teach! She has groups present and teach straight from the book. Hello, who is the professor? Not to mention her grading scale is very steep, you have to be a perfectionist to get an A. You have no idea how she grades exams and what she looks for, so good luck.",
            "The class really isn't that hard, though the books she chooses are boring. She's kind of ditzy though, and can be boring at times, but she is a fair grader.",
            "Don't take his class! All he does is show youtube videos and gives out only 2 articles so the entire semester. There are two response papers and a final research paper with a presentation to go with it. He's completely irrational when it comes to grading. Don't take a chance. Attendance is sometimes called out or sign in sheet. This guy is a mess!",
            "I don't like how this teacher grades, some student I did better got better grades than I did for some reason"
          ],
          "description2taxonomy": {}
        },
        "discusses exam preparation; specifically, the text addresses the effectiveness of study guides or review sessions provided by the professor. For example, 'His study guides cover everything you need to know for the exams, so make sure you review them thoroughly.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=3999217433572927051",
          "description": "discusses exam preparation; specifically, the text addresses the effectiveness of study guides or review sessions provided by the professor. For example, 'His study guides cover everything you need to know for the exams, so make sure you review them thoroughly.'",
          "texts": [
            "the class is very easy he gives you the answers to the tests on a study guide.",
            "Easy if you answer all his study guides. One paper required regarding writing about a national park. Open book/note test and if you answer all the questions on the study guide, you should get an \"A\" in the class",
            "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class."
          ],
          "description2taxonomy": {}
        },
        "discusses exam-related surprises or inconsistencies; specifically, the text addresses instances where the exam content did not match what was taught or expected. For example, 'The final exam had questions on topics we didn't cover in class, which was really frustrating.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=7655261029658507475",
          "description": "discusses exam-related surprises or inconsistencies; specifically, the text addresses instances where the exam content did not match what was taught or expected. For example, 'The final exam had questions on topics we didn't cover in class, which was really frustrating.'",
          "texts": [
            "Steve was not very helpful, the tests feel more like guessing games as they cover material we have not learnt in class. Worst teacher in the Business school.",
            "Most likely the least helpful prof. I have ever had, gave tests which he openly admitted included subjects we had NOT covered in lecture...."
          ],
          "description2taxonomy": {}
        },
        "mentions exam frequency; specifically, the text describes how often exams or quizzes are given throughout the course. For example, 'there were weekly quizzes and three midterms throughout the semester.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=-3164894619468596261",
          "description": "mentions exam frequency; specifically, the text describes how often exams or quizzes are given throughout the course. For example, 'there were weekly quizzes and three midterms throughout the semester.'",
          "texts": [
            "If you're a student who is horrible at taking exams or actually have a life and have to work in order to pay for college, do not take any course with Professor Kurylo. His class is 96% exams and 4% attendance. No extra credit, no project and no presentation. He does not care if you fail:(",
            "Not the greatest presenter (kind of boring actually) but you do learn good basic computer application skills. He gives 3 exams and a final along with a computer assignment from each software as well as a web page. It was very easy to make an A!",
            "She uses a point system that confused most of the students. We had quizzes everyday over the chapters. Tests weren't too hard but she did provide one extra credit assignment.",
            "Let me start by saying no science course is easy. Especially biology. Mr. Wernli gives weekly quizez and keeps only your 10 best grades. there are 3 lecture test and 3 lab test. The lab test are easy if you study the lecture tests are hard! you really have to study your notes! if you are up for the challenge take him. over all hes ok. :)",
            "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine."
          ],
          "description2taxonomy": {}
        },
        "comments on exam difficulty; specifically, the text assesses whether the exams are easy, difficult, or average in terms of challenge. For example, 'Her tests are really tough; you need to study hard to pass them.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=-1683152457354866775",
          "description": "comments on exam difficulty; specifically, the text assesses whether the exams are easy, difficult, or average in terms of challenge. For example, 'Her tests are really tough; you need to study hard to pass them.'",
          "texts": [
            "This class was very difficult to me! She went over her notes and just read them...i felt like i didnt get enough explaination for the stuff she was teaching! Only grade she gave during that class was our test grades...so be prepared!",
            "I had Prof. Sussman for Intro. to Media Criticism. Her classes are very interesting and she knows what she's talking about. It's really easy to get a good grade in the class as long as you listen to what she has to say. The tests are a lot of writing, but she prepares you really well.",
            "Very intelligent guy but has trouble teaching it to others. He got off topic easily. We used three books that seem to be above what students can comprehend. Students really have to think to connect what the books are saying to web design. Hated the Tufte book. Exams are pretty easy if you have the slightest idea what you're talking about.",
            "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
            "I can't believe this guy taught Intro! If you don't get a 'C' average on all 4 tests, you automatically get an 'E' regardless of your lab grade! I went to every lecture (except 2) and come exam time everything was foreign! Not recommended. Lab was great, but lecture destroyed many! Had to retake!",
            "Professor Cameron is a really enthusiastic guy, he is so well learned and his lectures are never boring. He really knows his stuff. He is a really tough grader though, I would get a B+ on his exam and he told me I did extremely well.I don't consider a B+ an extremely good grade, but he does. Focus on the topics he emphasized, they'll n on the exam",
            "He was not that difficult of a professor. His tests were straight forward and offered extra credit.",
            "Paciocco presented the material in clean fashion. Sometimes he jumped around, especially during the winter term, but his lectures are inspiring and amazingly knowledgeable. If you want to learn criminal law the right way, Paciocco is your man. Just be prepared for rigorous fact pattern exams.",
            "She puts too much of a workload on her students, and she doesn't even teach! She has groups present and teach straight from the book. Hello, who is the professor? Not to mention her grading scale is very steep, you have to be a perfectionist to get an A. You have no idea how she grades exams and what she looks for, so good luck.",
            "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
            "Take another teacher. He'll do problems in class & make sarcastic comments about how much faster he can do them. Tests much harder with trick questions than other sections & u don't get to use formula sheet on final. You might learn more in his class but you are unlikely to get in A unless you've had AP chem and grading criteria not clear.",
            "Very Boring!!! She is elderly and soft spoken. Test are relatively hard; however, my suggestion is to take her as a hybrid class. You only have to meet 7 times and everything else is online. Also, study the slides over and over. On every test the time limit is really short.",
            "I took this class because it was suposed to be a fun class, and you would learn alot about international business. Dr. Carnes made it not fun. All you do in that class is read the text books, and talk about it. She will put you down if you get the answer wrong. Her tests are hard. I was very disapointed with the class.",
            "His tests are difficult because of the short responses, but he is a great and passionate teacher",
            "Very tough grader! A very goof professor though! Explains everything very clear. You MUST study every night to pass his tests. His tests might not seem too hard but trust me they are very difficult! Would recommend him to anyone but you must be willing to dedicate A LOT of time to this class.",
            "She knows what she is talking about. She is very clear. This is exactly how a history class is supposed to be. Her tests are very easy.",
            "You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade. The exams are easy to pass as long as you go to the study sessions by the TA's! I've only been to this class on exam days, most of the information you need is given to you during the study sessions. Just study and you'll do fine.",
            "Let me start by saying no science course is easy. Especially biology. Mr. Wernli gives weekly quizez and keeps only your 10 best grades. there are 3 lecture test and 3 lab test. The lab test are easy if you study the lecture tests are hard! you really have to study your notes! if you are up for the challenge take him. over all hes ok. :)",
            "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)",
            "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
            "To everyone considering taking him, heres a warning.Hes totally changed his style. No more quizzes or matching on the tests. The tests are all fillin and he gives no specificity on who to concentrate on so u have to know who over 300 people are for a test on top of at least 3 essays, which he grades hard. Cool dude, but be cautious.",
            "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
            "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all",
            "IGNORE the last 9 reviews they're BS. Bob doesn't do EC and no paper. There are 2 exams he writes (60%), online hmwk (10%) and 1 department-wide final (30%) he doesn't write. Bob is great and his exams aren't easy but he gives you great reviews. The Final SUCKS! Bob never sees it so he can only help so much. DO WELL on Bob's exams you'll need it."
          ],
          "description2taxonomy": {}
        },
        "comments on grading fairness; specifically, the text addresses whether the professor's grading is seen as fair or unfair to the students. For example, 'she is a tough grader, but her grading criteria are clear and reasonable.'": {
          "node_name": "root_id=4_node=-1500143740904423233_node=-1889281094588241304",
          "description": "comments on grading fairness; specifically, the text addresses whether the professor's grading is seen as fair or unfair to the students. For example, 'she is a tough grader, but her grading criteria are clear and reasonable.'",
          "texts": [
            "Karpinski is definitely a real gem. He gives you extra time to turn in papers. He is a fair grader. He has amazing lectures. He is more interested about you knowing the material than passing, so you most definitely will pass if you just show little effort in the class. I LOVE this man. I'm graduating if not, I'll take him again. ONE OF THE BEST!!!",
            "Best and most helpful professor I've had at Millersville. Would not recommend skipping any lectures. But she is very useful at office hours and responds to emails quickly. I think the tests are fair and she prepares you for them in lectures. Plus homeworks are very easy and are good grade boosters",
            "She was a hard grader but she always explained what was deficient clearly. The homework was not extremely long, except on a few instances. She had trouble with a new book this quarter, but she graded us less harshly where she knew we would have troubles. Her lecture often differed from the book, but her lectures were in-depth and explanatory.",
            "The class really isn't that hard, though the books she chooses are boring. She's kind of ditzy though, and can be boring at times, but she is a fair grader.",
            "Tests were easy for someone with science background and study slides. Hard if you do not pay attention. Stickler on class etiquette. You will get a good grade on the papers if you include everything she requires (she gives you a rubic). Wants to be able to read the paper without trying to figure out what you are trying to say.",
            "Very organized and always prepared for each lecture. Gives crystal clear explanations of slides and definitions during lectures. Tough but fair grader. The semester isn't even half over, and I consider him one of my favorite profs I've had. Take Breiner!!",
            "Great teacher. Kind of rude at points, but you will definitely know Chemistry by the end. He is hard but fair and makes you work for your grade. You don't get formula sheets for the test, but with enough practice they're fairly easy to remember. Take this guy if you can!"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "refers to course organization; specifically, the text comments on the structure or planning of the course or lectures. For example, 'Her reviews for tests are barely that and she crams everything together.'": {
      "node_name": "root_id=4_node=-2616864405772615291",
      "description": "refers to course organization; specifically, the text comments on the structure or planning of the course or lectures. For example, 'Her reviews for tests are barely that and she crams everything together.'",
      "texts": [
        "I would not recommend her. She rambles incoherently, is unprofessional, disorganized, and condescending on top of all that. She is not motivating or inspiring..she is depressing. Definitely not worth the time or money.",
        "Although she is very nice and approachable, she mumbles, not talks, VERY fast, and gets off topic easily ... no overhead notes or powerpoint presentations, which make lectures unclear and difficult to follow/understand",
        "One of the best psych professors at Smith. He is organized and engaged and always willing to meet with students. His lectures and assignments are clear and organized so it is easy to study for his exams. I never wanted to miss a class!",
        "You have to be organized to take this class! Not structured by week but by major assignment. Difficult if you don't already know how to write essays. Doesn't give feedback on rough drafts (peers do)only on your essay after its graded. Doesn't lecture - you learn by doing workbook sheets. 4 essays w/ rough draft, various exercises, online research",
        "Vickie Lair is THE WORST teacher I have ever had. I would not be in her class if it wasn't the only opening left (wonder why?) She's confusing, forgetful, and very unreasonable when it comes to class. She doesn't post grades EVER. \"It's your responsibility.\" Her reviews for tests are barely that and she crams everything together. Don't take her!!!",
        "Follows the syllabus. You will have a quiz at the beginning of each class based on the current topic. All test and quizzes are open book. Test your knowledge on quizzes to see your proficiency on the topic through tricky questions.",
        "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard."
      ],
      "description2taxonomy": {}
    },
    "discusses attendance policies; specifically, the text comments on the professor's views on class attendance or punctuality. For example, 'Make sure you are on time for class. Once the door is closed, you will not be allowed in the class.'": {
      "node_name": "root_id=4_node=1197335655054736789",
      "description": "discusses attendance policies; specifically, the text comments on the professor's views on class attendance or punctuality. For example, 'Make sure you are on time for class. Once the door is closed, you will not be allowed in the class.'",
      "texts": [
        "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
        "Show up for class do all your assignments and any extra credit that is offered. Make sure you study the power point presentation and the word definitions that are listed in the chapters. If you do those steps you will pass the class with no problem. Make sure you are on time for class. Once the door is close we will not be allowed in the class"
      ],
      "description2taxonomy": {}
    },
    "comments on workload and time commitment; specifically, the text discusses the amount of work, readings, or assignments required for the course as well as students' time investment. For example, 'This class requires a lot of reading and studying, but it's worth the effort.'": {
      "node_name": "root_id=4_node=-2714466259288223834",
      "description": "comments on workload and time commitment; specifically, the text discusses the amount of work, readings, or assignments required for the course as well as students' time investment. For example, 'This class requires a lot of reading and studying, but it's worth the effort.'",
      "texts": [
        "Fred is nice as a person, but a terrible teacher. His lectures are confusing and top of that he will give you his own notes (looks like he used a typewriter) and expects you to understand them. He is old school, and very forgetful. I don't know anyone who is having it easy in this class. Very stressful and you need to make EXTRA time for this class",
        "A course surveying 1000 years is not going to be easy but she knows her stuff. Take lecture notes, that's what tests are based on and read. Going to classes everyday is not unheard of, this class does require effort but you will be rewarded.",
        "By far the best teacher, and course that I have ever taken in my life. This class is a lto fo hard work but you enjoy it. There is a lot of reading but most of the class time is spent on discussions. Every educaiton major should take this course with Dee.",
        "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
        "Prepare to do a lot of outside study to learn anything in this class. All lectures are just PowerPoint slides and frequently have mistakes in them. He takes off points on HW & tests for things like not showing work on basic math and not using the exact format he uses on formulas. He also has a hard time understanding any questions people ask.",
        "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
        "4 week online ACC 202. Hmwrk is very time consuming, can use \"check my work.\" Suggest getting a perfect score on HW since the tests are hard. There IS NOT enough time for the tests. Answer questions you know and then figure out what you don't since you WILL run out of time. Available for questions via email. Clear layout of HW and points. No EC",
        "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
        "Amazing teacher overall, there's 6 required assignments throughout the semester. Three in class essays and three home research papers. Overall he was an outstanding teacher, would definitely recommend.",
        "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
        "Incredibly awesome guy, very helpful, but his expectations for a non-science major are unfair. Not one person in class was a business major and he expected 6 hours per week at least for studying outside the classroom and that we study it everyday. I would not take this class again given the chance. Plus it had a lab... and lab project!",
        "Very intense history class. A lot of reading, and a huge amount of material on each exam. Only take if you love history; if your filling an elective, you're probably better off in a different class",
        "She puts too much of a workload on her students, and she doesn't even teach! She has groups present and teach straight from the book. Hello, who is the professor? Not to mention her grading scale is very steep, you have to be a perfectionist to get an A. You have no idea how she grades exams and what she looks for, so good luck.",
        "You have to be organized to take this class! Not structured by week but by major assignment. Difficult if you don't already know how to write essays. Doesn't give feedback on rough drafts (peers do)only on your essay after its graded. Doesn't lecture - you learn by doing workbook sheets. 4 essays w/ rough draft, various exercises, online research",
        "Lots of assignments. Very thourough when reviewing for test.",
        "Class grade is mostly the projects which require a lot of time but are very useful to the real classroom and for the most part are interesting to do!! Dr. Wall is very helpful and one of the nicest teachers I've had!",
        "Not very helpful to students at all. Questions in the study guide do not help and you spend so much time trying to memorize what you have read for the tests, that you don't have much time to learn other things.",
        "Very tough grader! A very goof professor though! Explains everything very clear. You MUST study every night to pass his tests. His tests might not seem too hard but trust me they are very difficult! Would recommend him to anyone but you must be willing to dedicate A LOT of time to this class.",
        "Fantastic professor. Loved his teaching. Took documentary survey from him. He opened my eyes to the art of docs, which I didn't understand before the class. He makes you write, so be prepared for probably 3-5 decent length papers. He will grade semi-tough but it's worth it. Some of the docs aren't the most interesting, but are valuable nonetheless.",
        "Madden is a good lecturer, but not even he can keep me awake in class. This class basically depends on your TA. You can easily get screwed over on that. You'll be reading about 3 novels, and have a midterm and final. You'll have to study so watch out if you're lazy.",
        "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
        "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
        "Took him for Internship Seminar. You can tell he's a good professor but he gives way too much work for interns who are already slaving away, giving 20+ hours a week to a course where they are getting 4 credits. Too much busy-work and writing that means nothing for a class that is pass/fail.",
        "Several small papers required and a final 5 page APA style research paper. Her exams cover a lot of material but she works with you to get a better grade.",
        "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)",
        "Mark does expect a lot out of his students but he just wants you to succeed. He's always there to help and you can learn a lot from him if you choose to. DO NOT take this class unless you are interested in painting and have done it before! Even though the class was hard and time-consuming, it was definitely the best class I've taken at SSU.",
        "He is a fun professor, but there is a lot of reading to keep up with.",
        "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
        "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all"
      ],
      "description2taxonomy": {
        "refers to the course structure; specifically, the text provides information about how the course is organized, such as weekly topics, readings, or format. For example, 'class is not structured by week but by major assignment.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=4362260629866052758",
          "description": "refers to the course structure; specifically, the text provides information about how the course is organized, such as weekly topics, readings, or format. For example, 'class is not structured by week but by major assignment.'",
          "texts": [
            "You have to be organized to take this class! Not structured by week but by major assignment. Difficult if you don't already know how to write essays. Doesn't give feedback on rough drafts (peers do)only on your essay after its graded. Doesn't lecture - you learn by doing workbook sheets. 4 essays w/ rough draft, various exercises, online research"
          ],
          "description2taxonomy": {}
        },
        "mentions reading requirements; specifically, the text highlights the amount of reading material and the importance of keeping up with it. for example, 'there is a lot of reading to keep up with.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=-27745906625947726",
          "description": "mentions reading requirements; specifically, the text highlights the amount of reading material and the importance of keeping up with it. for example, 'there is a lot of reading to keep up with.'",
          "texts": [
            "By far the best teacher, and course that I have ever taken in my life. This class is a lto fo hard work but you enjoy it. There is a lot of reading but most of the class time is spent on discussions. Every educaiton major should take this course with Dee.",
            "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
            "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
            "Very intense history class. A lot of reading, and a huge amount of material on each exam. Only take if you love history; if your filling an elective, you're probably better off in a different class",
            "He is a fun professor, but there is a lot of reading to keep up with."
          ],
          "description2taxonomy": {}
        },
        "highlights research requirements; specifically, the text points out the need for independent research, such as in-home assignments or research papers. For example, 'Three home research papers were assigned throughout the semester.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=956569559938117491",
          "description": "highlights research requirements; specifically, the text points out the need for independent research, such as in-home assignments or research papers. For example, 'Three home research papers were assigned throughout the semester.'",
          "texts": [
            "Amazing teacher overall, there's 6 required assignments throughout the semester. Three in class essays and three home research papers. Overall he was an outstanding teacher, would definitely recommend."
          ],
          "description2taxonomy": {}
        },
        "discusses homework requirements; specifically, the text provides information about the presence or difficulty of homework, and how this may impact students' overall performance. For example, 'People who fail her class don't do the H.W. or ask clarifying questions.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=2283775513248979250",
          "description": "discusses homework requirements; specifically, the text provides information about the presence or difficulty of homework, and how this may impact students' overall performance. For example, 'People who fail her class don't do the H.W. or ask clarifying questions.'",
          "texts": [
            "Prepare to do a lot of outside study to learn anything in this class. All lectures are just PowerPoint slides and frequently have mistakes in them. He takes off points on HW & tests for things like not showing work on basic math and not using the exact format he uses on formulas. He also has a hard time understanding any questions people ask.",
            "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
            "4 week online ACC 202. Hmwrk is very time consuming, can use \"check my work.\" Suggest getting a perfect score on HW since the tests are hard. There IS NOT enough time for the tests. Answer questions you know and then figure out what you don't since you WILL run out of time. Available for questions via email. Clear layout of HW and points. No EC",
            "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that."
          ],
          "description2taxonomy": {}
        },
        "emphasizes exam preparation; specifically, the text refers to the importance of studying or reviewing for tests and how they impact the overall grade. For example, 'Just as long as you put some effort into studying for the exam, you'll do fine.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=-6694115045215019045",
          "description": "emphasizes exam preparation; specifically, the text refers to the importance of studying or reviewing for tests and how they impact the overall grade. For example, 'Just as long as you put some effort into studying for the exam, you'll do fine.'",
          "texts": [
            "Lots of assignments. Very thourough when reviewing for test.",
            "Very tough grader! A very goof professor though! Explains everything very clear. You MUST study every night to pass his tests. His tests might not seem too hard but trust me they are very difficult! Would recommend him to anyone but you must be willing to dedicate A LOT of time to this class.",
            "Madden is a good lecturer, but not even he can keep me awake in class. This class basically depends on your TA. You can easily get screwed over on that. You'll be reading about 3 novels, and have a midterm and final. You'll have to study so watch out if you're lazy.",
            "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
            "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
            "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all"
          ],
          "description2taxonomy": {}
        },
        "describes the impact of the workload on overall learning; specifically, the text explains how the amount of work, assignments, or readings affects the students' ability to absorb and retain the course material. For example, 'I spent so much time on the readings and assignments that I didn't have any energy left to actually learn and understand the concepts.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=-3079118421932424790",
          "description": "describes the impact of the workload on overall learning; specifically, the text explains how the amount of work, assignments, or readings affects the students' ability to absorb and retain the course material. For example, 'I spent so much time on the readings and assignments that I didn't have any energy left to actually learn and understand the concepts.'",
          "texts": [
            "Not very helpful to students at all. Questions in the study guide do not help and you spend so much time trying to memorize what you have read for the tests, that you don't have much time to learn other things."
          ],
          "description2taxonomy": {}
        },
        "highlights the professor's willingness to help students; specifically, the text comments on how supportive or non-supportive the professor is when it comes to assisting students with assignments, exams, or other course-related concerns. For example, 'The professor is very helpful and always available to answer questions or provide clarification.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=-1563575320604294032",
          "description": "highlights the professor's willingness to help students; specifically, the text comments on how supportive or non-supportive the professor is when it comes to assisting students with assignments, exams, or other course-related concerns. For example, 'The professor is very helpful and always available to answer questions or provide clarification.'",
          "texts": [
            "Class grade is mostly the projects which require a lot of time but are very useful to the real classroom and for the most part are interesting to do!! Dr. Wall is very helpful and one of the nicest teachers I've had!",
            "Fantastic professor. Loved his teaching. Took documentary survey from him. He opened my eyes to the art of docs, which I didn't understand before the class. He makes you write, so be prepared for probably 3-5 decent length papers. He will grade semi-tough but it's worth it. Some of the docs aren't the most interesting, but are valuable nonetheless.",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
            "Several small papers required and a final 5 page APA style research paper. Her exams cover a lot of material but she works with you to get a better grade.",
            "Mark does expect a lot out of his students but he just wants you to succeed. He's always there to help and you can learn a lot from him if you choose to. DO NOT take this class unless you are interested in painting and have done it before! Even though the class was hard and time-consuming, it was definitely the best class I've taken at SSU."
          ],
          "description2taxonomy": {}
        },
        "mentions excessive workload; specifically, the text indicates that the amount of work, assignments, or readings is overwhelming or unreasonable. For example, 'The amount of readings for this class is insane and impossible to keep up with.'": {
          "node_name": "root_id=4_node=-2714466259288223834_node=6691965368421589884",
          "description": "mentions excessive workload; specifically, the text indicates that the amount of work, assignments, or readings is overwhelming or unreasonable. For example, 'The amount of readings for this class is insane and impossible to keep up with.'",
          "texts": [
            "Fred is nice as a person, but a terrible teacher. His lectures are confusing and top of that he will give you his own notes (looks like he used a typewriter) and expects you to understand them. He is old school, and very forgetful. I don't know anyone who is having it easy in this class. Very stressful and you need to make EXTRA time for this class",
            "Incredibly awesome guy, very helpful, but his expectations for a non-science major are unfair. Not one person in class was a business major and he expected 6 hours per week at least for studying outside the classroom and that we study it everyday. I would not take this class again given the chance. Plus it had a lab... and lab project!",
            "Very intense history class. A lot of reading, and a huge amount of material on each exam. Only take if you love history; if your filling an elective, you're probably better off in a different class",
            "She puts too much of a workload on her students, and she doesn't even teach! She has groups present and teach straight from the book. Hello, who is the professor? Not to mention her grading scale is very steep, you have to be a perfectionist to get an A. You have no idea how she grades exams and what she looks for, so good luck.",
            "Took him for Internship Seminar. You can tell he's a good professor but he gives way too much work for interns who are already slaving away, giving 20+ hours a week to a course where they are getting 4 credits. Too much busy-work and writing that means nothing for a class that is pass/fail.",
            "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)"
          ],
          "description2taxonomy": {}
        }
      }
    },
    "addresses course material or resources; specifically, the text refers to textbooks, online resources, or other materials used in the course. For example, 'Read the textbook and don't bother going to class.'": {
      "node_name": "root_id=4_node=-6894237927050980183",
      "description": "addresses course material or resources; specifically, the text refers to textbooks, online resources, or other materials used in the course. For example, 'Read the textbook and don't bother going to class.'",
      "texts": [
        "Course textbook: Hitchhiker's Guide to the Galaxy. Variable names Ford, Arthur and HHGTG were common. Lots of intel references. On a whole, really liked his teaching style. Wierd, geeky humor.",
        "Use the workbook to get help on the exercises. Write down anything that he puts on the screen. You can get a B if you ask questions and stay awake.",
        "The guy is smart but can't teach for his life. The math is EASY and the book is very good. So if your even decent at math then definitly take this course. Subjects include compounding interest, probability, election theory, etc.",
        "He's certainly got little patience outside of class and isn't very accessible in general, but if you do the readings and come to class you can get by easily.",
        "Read the textbood and don't bother going to class",
        "View lessons online as needed to learn the material because as previously commented he simply goes through powerpoint, but it does appear that the powerpoint is designed by him to accomplish course objectives. Project is huge so make sure you get a responsible group. After this class I was definitely more interested in Databases.",
        "Oh brother, I can see this guy being like Tony Montana at home. He explains everything clearly, but the tests are pretty difficult for someone who doesn't really \"get\" economics, but I rarely paid attention in class. Use the textbook, listen in class and take notes, and I bet this class wouldn't be too hard.",
        "My worst grade for a course so far in university. I think it's the annoying overuse of textbook material that makes the class hard. It's very frustrating when all of your marks come from exams (based only on textbook material), and there are no assignments or lab work. His slideshow notes are terrible - they contain only words and no explanations.",
        "Prof. Wagman is a very nice lady but sometimes you don't know what to expect. As long as you study the textbook content and attend class regularly, you'll be fine. She won't specify which areas to study but that's fair as everything covered in class is test material. The best part is that she will get you speaking Spanish.",
        "Everything is on WebAssign (homeworkquizzes) except for the midtermfinal so make sure to get it. The ebook comes with WebAssign so you don't really need the actual book. I fell a little behind in his class, but caught up and passed with an A. Good luck. He's really laid back and a great teacher! You won't regret taking him. :-D",
        "Take note of EVERY WORD that comes out of his mouth. He WOULD test you on it. Also read the text because he would test you on that also. In all it's about 120 multiple choice questions in 2 hrs. He gives credit for good attendance also. Other than that - he is a nice professor, very fair and to the point, and the class is interesting.",
        "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
        "the only thing for your grade is 3 in class essays. and the lectures sometimes dont nessisarily relate to the midterms. however you can get all of the information by either reading the book, or going to the TA/SI led sessions",
        "The accent is the worst part, he's very hard to understand. But the class overall is easy to pass with little effort. Attendance isn't mandatory but homework is due every class. He reviews the class before the test and it's a great indication of what to expect on the tests. His tests are multiple choice and easy to do well on. Textbook used for HW",
        "For intro level course he was impossible to listen to. I don't know if it was his odd mannerisms or slow, drawn out style but I found it impossible to pay attention in a subject I love. The material in class was less than half of what was on the test, reading the dry text was mandatory.",
        "He is a fun professor, but there is a lot of reading to keep up with."
      ],
      "description2taxonomy": {}
    },
    "mentions professor's appearance; specifically, the text refers to the professor's physical appearance, clothing, or attractiveness. For example, 'Gendron is the Best! He is SO hot!'": {
      "node_name": "root_id=4_node=-8160623806366599243",
      "description": "mentions professor's appearance; specifically, the text refers to the professor's physical appearance, clothing, or attractiveness. For example, 'Gendron is the Best! He is SO hot!'",
      "texts": [
        "Hott....very hott...caries a picnic basket a LOT...i dont know why...but not a good teacher...fun to look at, but not a fun teacher.",
        "Gendron is the Best! He is SO hot! He is an awesome teacher. His method of teaching is really helpful, in and outside of the classroom.",
        "Very pretty.. hard to concentrate.. good teacher",
        "He's an excellent teacher, always willing to help. Lecture is very interesting. Be prepared to work hard. He is hottt!!!",
        "HOT teacher, pretty easy. I'd rail it!!!!!",
        "one of the most exciting profs at U of T. and that's not just because she's so hot. which makes me wonder - where are all her chili peppers?! is anyone more deserving?"
      ],
      "description2taxonomy": {}
    },
    "comments on course difficulty; specifically, the text provides an opinion on the ease or difficulty of the course or its content. For example, 'The math is EASY and the book is very good.'": {
      "node_name": "root_id=4_node=8280793448833787096",
      "description": "comments on course difficulty; specifically, the text provides an opinion on the ease or difficulty of the course or its content. For example, 'The math is EASY and the book is very good.'",
      "texts": [
        "A course surveying 1000 years is not going to be easy but she knows her stuff. Take lecture notes, that's what tests are based on and read. Going to classes everyday is not unheard of, this class does require effort but you will be rewarded.",
        "she is probably the easist teacher you can get. She doesnt take attendance and gives study guides that make the test extremely easy, and homework is counted as extra credit. Super nice woman holds study sessions if you are having trouble. Take it",
        "Great and fun guy. Not very hard to get an A in his class. And you still learn!",
        "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
        "The guy is smart but can't teach for his life. The math is EASY and the book is very good. So if your even decent at math then definitly take this course. Subjects include compounding interest, probability, election theory, etc.",
        "This class was very difficult to me! She went over her notes and just read them...i felt like i didnt get enough explaination for the stuff she was teaching! Only grade she gave during that class was our test grades...so be prepared!",
        "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
        "Prepare to do a lot of outside study to learn anything in this class. All lectures are just PowerPoint slides and frequently have mistakes in them. He takes off points on HW & tests for things like not showing work on basic math and not using the exact format he uses on formulas. He also has a hard time understanding any questions people ask.",
        "very easy A. hes not to good of a teacher, but if youre looking for an easy A, that is the teacher for you.",
        "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
        "the class is very easy he gives you the answers to the tests on a study guide.",
        "I had Prof. Sussman for Intro. to Media Criticism. Her classes are very interesting and she knows what she's talking about. It's really easy to get a good grade in the class as long as you listen to what she has to say. The tests are a lot of writing, but she prepares you really well.",
        "SUPER LAID BACK. pretty simple class; read - take quiz - some papers - a group presentation at the end - the the final paper. Very nice man. I would definately recomend him and this class. Easy GE!",
        "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
        "I absolutely love Dr. Woolard; she's a kind soul, and she genuinely cares about her students and wants to help them succeed. The class is not difficult, though I did experience some technical difficulties with my computer which she was always willing to work through with me. She doesn't believe in making a subject harder than it needs to be.",
        "He is an awesome prof! I loveee his class. Very interesting stuff and he makes them so easy to understand! Thanks prof. Bartel!",
        "Great lady but puts a lot of your grade on attendance, the class is super easy and fun",
        "Boring lectures, easy grader.",
        "This teacher is the bomb, She is easy, you will just have to do a couple papers, and her tests are also easy. If you try really hard, then u wasted ur time, u can barely try and get a B, or try a little bit and get an A. Shes is so easy to understand, and she isnt boring.. TAKE THIS TEACHER",
        "The hardest easy A you will ever get. Sitting through this class is absolute torture. I do not understand how someone who does so little can still be a professor. Do NOT take his class. The A is not worth it.2",
        "He's certainly got little patience outside of class and isn't very accessible in general, but if you do the readings and come to class you can get by easily.",
        "AMAZING. Very clear, easy work. 10/10 would recommend. Very nice, give A LOT of extra credit, take advantage! I would definitely choose her as my professor again. Tests are super easy and you have so much extra credit you'll always pass.",
        "I took this class for an 8 week semester. I'm pretty good with Microsoft Office in general, so this class was pretty easy. Plus, Herbert is very nice and everything is very clear. I even emailed her and asked if she would open a couple tests up early so I wouldn't have to take it finals week, and she totally understood and opened them up!",
        "his econ 104 class was easy as pie. i never went and got an A. his economics of sports class is pretty easy. i never went and got an A-.",
        "easy A, in fact its so easy I got one even though I thought the class was math 108 ROFL im so smart!",
        "I've just finished his class. It was difficult but very interesting. His personality is fantastic. He seems to love what he is doing.",
        "Overall this class is easy. Just need to practice for exams or you will not do well.",
        "So many problems: 1)doesnt know how to \"teach\". 2) Cant hear the student asking questions. 3) Takes whole class to do 1 problem. 4) FORCES us to solve the LONG and HARD way. If not done like how he done it, minus 10. I took Phys soph High school and i have 3.6 GPA, so no im not stupid. His class is just horrible. ACC needs to fire him, IMMEDIATELY.",
        "I can't believe this guy taught Intro! If you don't get a 'C' average on all 4 tests, you automatically get an 'E' regardless of your lab grade! I went to every lecture (except 2) and come exam time everything was foreign! Not recommended. Lab was great, but lecture destroyed many! Had to retake!",
        "I had him for business calc and he made everything easy to understand. If you go to class and pay attention there is no way you can fail. He is very nice, cares about his students, and approachable.",
        "Not the greatest presenter (kind of boring actually) but you do learn good basic computer application skills. He gives 3 exams and a final along with a computer assignment from each software as well as a web page. It was very easy to make an A!",
        "He was not that difficult of a professor. His tests were straight forward and offered extra credit.",
        "Easy A but you have to suffer through Schneider's boring lectures. Recommended only for a GPA boost.",
        "This class is pretty difficult and he does a LOT of intense mathematical derivation, sometimes without the basics or non-technical explanation of what's going on. He's very helpful outside of class though - and is a really, really nice guy.",
        "Study his examples and you won't go wrong with his tests very straightforward. The essays on the tests are not hard. Go to his office if you need him for help. Nice professor take him if you can.",
        "Nice guy, however the online course for history is hard to follow.",
        "I took his class for an easy A. I have a background in Finance as my family has been in different financial and investment fields for decades. It was an easy class.. if you agree with him. As a licsenced broker with 3 years of experience, I disagreed with some of the things he said. It wasn't a boring class, though.",
        "Easy if you answer all his study guides. One paper required regarding writing about a national park. Open book/note test and if you answer all the questions on the study guide, you should get an \"A\" in the class",
        "That is a easy class",
        "She talks a lot, and most of the time after classes you will wonder why you even went. Her class is very easy and laid back and I never got anything less than a B. Attendance is not mandatory and she cancels class a lot of the time.",
        "really really easy. she's nice",
        "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
        "50% of our grade participation was given by attending class 10% was awarded for doing in-class readings and small projects, in which he would rarely assign! Quizzes are easy, online, and 20% of our grade. Midterm and final are 20% of the grade & are also online tests you take at home. If you can't get an A in this class, you're sad. Lol",
        "She was awsome and by far the easiest and best professor ive had at uab!",
        "The class really isn't that hard, though the books she chooses are boring. She's kind of ditzy though, and can be boring at times, but she is a fair grader.",
        "He gets bored with his own lectures and dismisses class early. You only need the access code really, no point in buying the book since you can get the code separately. He tries to tell jokes, I don't think he realizes we're laughing at him not with him, but whatever. Overall easy class to pass, worth putting up with Bosworth's strangeness.",
        "HOT teacher, pretty easy. I'd rail it!!!!!",
        "This class felt like my high school math classes. You have homework assigned every night, but not a lot. If you need help he LOVES to help. He's kind of a goofy guy so the class is a little bit more enjoyable for a math class. I would recommend him to anyone.",
        "Easy IF YOU PAY ATTENTION. She teaches based on application, not content. Expect things you don't know to be on the test. She grades easy but it is the tests that will get you. Make a study group - quizlet helps immensely with this class. Sweet lady but not the nicest of people, and will treat class as if it is an elementary school classroom.",
        "First, IT 101 is a joke so it really doesn't matter. Englander is a funny guy and you don't have to do much for his IT workshops. Just get an 80+ on the final and a guaranteed 4.0",
        "She knows what she is talking about. She is very clear. This is exactly how a history class is supposed to be. Her tests are very easy.",
        "Tests were easy for someone with science background and study slides. Hard if you do not pay attention. Stickler on class etiquette. You will get a good grade on the papers if you include everything she requires (she gives you a rubic). Wants to be able to read the paper without trying to figure out what you are trying to say.",
        "soooooo niceeeee, take her during the summer she is a garenteed A",
        "Great class, easy, but you do learn a lot both from the text and instructors experiences. Great guy and easy going but can put you to sleep sometimes......especially after a lunch at Speeds Deli....MMMMMmmmm Speeeeds...",
        "She doesn't really teach, it's mostly watching movies on the chapters, and the movies are boring. She grades really easily & the assignments are easy.",
        "I agree ,he is very hard ,most of the time is wasted on graphs and not lecture from the text .Very hard and complicated .",
        "Had him for Bus 1 and personal finance. Very easy class, my book was hardly used except for tests. Lectures aren't very helpful for tests, but he does relate RL situations, through experience, to things in the text. Often absent, but I forgive him from his age. One of my fav prof, mainly from personality. Esy clas, teach urself if u want to lrn any",
        "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
        "You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade. The exams are easy to pass as long as you go to the study sessions by the TA's! I've only been to this class on exam days, most of the information you need is given to you during the study sessions. Just study and you'll do fine.",
        "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
        "Professor Sierra's class could not be any easier. I definitely liked the fact that there was no homework compared to the other TA teacher. Go to class, stay for the movies, jot down the notes, and review before the test. THERE IS NO REASON YOU SHOULD NOT GET AN A IN THIS CLASS!",
        "Let me start by saying no science course is easy. Especially biology. Mr. Wernli gives weekly quizez and keeps only your 10 best grades. there are 3 lecture test and 3 lab test. The lab test are easy if you study the lecture tests are hard! you really have to study your notes! if you are up for the challenge take him. over all hes ok. :)",
        "The accent is the worst part, he's very hard to understand. But the class overall is easy to pass with little effort. Attendance isn't mandatory but homework is due every class. He reviews the class before the test and it's a great indication of what to expect on the tests. His tests are multiple choice and easy to do well on. Textbook used for HW",
        "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)",
        "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
        "VERY monotone however as others have said he is incredibly helpful and labs are really easy marks!",
        "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
        "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all",
        "IGNORE the last 9 reviews they're BS. Bob doesn't do EC and no paper. There are 2 exams he writes (60%), online hmwk (10%) and 1 department-wide final (30%) he doesn't write. Bob is great and his exams aren't easy but he gives you great reviews. The Final SUCKS! Bob never sees it so he can only help so much. DO WELL on Bob's exams you'll need it.",
        "Class seems easy. Attendance and Edmodo count a lot. Does not allow, food, gum, cell phones, nor drinks in the classroom, not even if its a 3hr long period. Other than that class is not that bad. her tests can be hard, but if you look over the chapter and notes, test should not be too hard. She would send out a review for the test, pretty helpful",
        "He was a great prof. Made the class very interesting and easy to follow. Able to really keep your attention, I really enjoyed the class.",
        "His class was cake. We were scheduled to meet MWF but we only ever met on MW. His class is easy and you don't really have to do anything to do well other than your wellness project which still isn't that hard."
      ],
      "description2taxonomy": {
        "addresses extra credit opportunities; specifically, the text mentions the availability and impact of extra credit assignments on the course difficulty. For example, 'Very nice, give A LOT of extra credit, take advantage! I would definitely choose her as my professor again.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=-69617456623075772",
          "description": "addresses extra credit opportunities; specifically, the text mentions the availability and impact of extra credit assignments on the course difficulty. For example, 'Very nice, give A LOT of extra credit, take advantage! I would definitely choose her as my professor again.'",
          "texts": [
            "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
            "AMAZING. Very clear, easy work. 10/10 would recommend. Very nice, give A LOT of extra credit, take advantage! I would definitely choose her as my professor again. Tests are super easy and you have so much extra credit you'll always pass.",
            "He was not that difficult of a professor. His tests were straight forward and offered extra credit.",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that."
          ],
          "description2taxonomy": {}
        },
        "comments on attendance policies; specifically, the text offers information about the professor's attendance requirements or expectations. For example, 'Great lady but puts a lot of your grade on attendance, the class is super easy and fun.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=3584428283885317221",
          "description": "comments on attendance policies; specifically, the text offers information about the professor's attendance requirements or expectations. For example, 'Great lady but puts a lot of your grade on attendance, the class is super easy and fun.'",
          "texts": [
            "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
            "Great lady but puts a lot of your grade on attendance, the class is super easy and fun",
            "She talks a lot, and most of the time after classes you will wonder why you even went. Her class is very easy and laid back and I never got anything less than a B. Attendance is not mandatory and she cancels class a lot of the time.",
            "Class seems easy. Attendance and Edmodo count a lot. Does not allow, food, gum, cell phones, nor drinks in the classroom, not even if its a 3hr long period. Other than that class is not that bad. her tests can be hard, but if you look over the chapter and notes, test should not be too hard. She would send out a review for the test, pretty helpful"
          ],
          "description2taxonomy": {}
        },
        "refers to course content; specifically, the text identifies specific topics or subjects covered in the course and their perceived difficulty. For example, 'Subjects include compounding interest, probability, election theory, etc.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=5865352056830139758",
          "description": "refers to course content; specifically, the text identifies specific topics or subjects covered in the course and their perceived difficulty. For example, 'Subjects include compounding interest, probability, election theory, etc.'",
          "texts": [
            "The guy is smart but can't teach for his life. The math is EASY and the book is very good. So if your even decent at math then definitly take this course. Subjects include compounding interest, probability, election theory, etc."
          ],
          "description2taxonomy": {}
        },
        "refers to the professor's teaching style; specifically, the text discusses how the professor delivers the content and how it affects learning. For example, 'she just reads from the slides and doesn't explain the concepts well.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=1331908376542134599",
          "description": "refers to the professor's teaching style; specifically, the text discusses how the professor delivers the content and how it affects learning. For example, 'she just reads from the slides and doesn't explain the concepts well.'",
          "texts": [
            "This class was very difficult to me! She went over her notes and just read them...i felt like i didnt get enough explaination for the stuff she was teaching! Only grade she gave during that class was our test grades...so be prepared!",
            "So many problems: 1)doesnt know how to \"teach\". 2) Cant hear the student asking questions. 3) Takes whole class to do 1 problem. 4) FORCES us to solve the LONG and HARD way. If not done like how he done it, minus 10. I took Phys soph High school and i have 3.6 GPA, so no im not stupid. His class is just horrible. ACC needs to fire him, IMMEDIATELY."
          ],
          "description2taxonomy": {}
        },
        "discusses exam difficulty; specifically, the text assesses the complexity, format, or content of exams given in the course. For example, 'You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=-728093766948567034",
          "description": "discusses exam difficulty; specifically, the text assesses the complexity, format, or content of exams given in the course. For example, 'You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade.'",
          "texts": [
            "You have 3 exams, two worth 400 points and one worth 200 points, and this is the only thing on your grade. The exams are easy to pass as long as you go to the study sessions by the TA's! I've only been to this class on exam days, most of the information you need is given to you during the study sessions. Just study and you'll do fine.",
            "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
            "I took Mythology with Shelia, and it was a difficult class. she gives 2 tests and a paper. the tests cover a TON of material and are difficult to do well on. We didn't really discuss the reading, only the background/info, but the tests were mostly on the reading. very frustrating, plan on studying weeks in advance to get it all",
            "IGNORE the last 9 reviews they're BS. Bob doesn't do EC and no paper. There are 2 exams he writes (60%), online hmwk (10%) and 1 department-wide final (30%) he doesn't write. Bob is great and his exams aren't easy but he gives you great reviews. The Final SUCKS! Bob never sees it so he can only help so much. DO WELL on Bob's exams you'll need it."
          ],
          "description2taxonomy": {}
        },
        "mentions professor's lecturing style; specifically, the text comments on the professor's ability to deliver engaging or boring lectures. For example, 'boring lectures, easy grader.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=1913525929661277254",
          "description": "mentions professor's lecturing style; specifically, the text comments on the professor's ability to deliver engaging or boring lectures. For example, 'boring lectures, easy grader.'",
          "texts": [
            "Boring lectures, easy grader.",
            "Not the greatest presenter (kind of boring actually) but you do learn good basic computer application skills. He gives 3 exams and a final along with a computer assignment from each software as well as a web page. It was very easy to make an A!",
            "Easy A but you have to suffer through Schneider's boring lectures. Recommended only for a GPA boost.",
            "The class really isn't that hard, though the books she chooses are boring. She's kind of ditzy though, and can be boring at times, but she is a fair grader.",
            "He gets bored with his own lectures and dismisses class early. You only need the access code really, no point in buying the book since you can get the code separately. He tries to tell jokes, I don't think he realizes we're laughing at him not with him, but whatever. Overall easy class to pass, worth putting up with Bosworth's strangeness.",
            "She doesn't really teach, it's mostly watching movies on the chapters, and the movies are boring. She grades really easily & the assignments are easy."
          ],
          "description2taxonomy": {}
        },
        "describes professor's personality; specifically, the text conveys the likability, demeanor, or behavior of the professor. For example, 'His personality is fantastic. He seems to love what he is doing.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=-4756345119296465062",
          "description": "describes professor's personality; specifically, the text conveys the likability, demeanor, or behavior of the professor. For example, 'His personality is fantastic. He seems to love what he is doing.'",
          "texts": [
            "she is probably the easist teacher you can get. She doesnt take attendance and gives study guides that make the test extremely easy, and homework is counted as extra credit. Super nice woman holds study sessions if you are having trouble. Take it",
            "Great and fun guy. Not very hard to get an A in his class. And you still learn!",
            "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
            "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
            "SUPER LAID BACK. pretty simple class; read - take quiz - some papers - a group presentation at the end - the the final paper. Very nice man. I would definately recomend him and this class. Easy GE!",
            "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
            "I absolutely love Dr. Woolard; she's a kind soul, and she genuinely cares about her students and wants to help them succeed. The class is not difficult, though I did experience some technical difficulties with my computer which she was always willing to work through with me. She doesn't believe in making a subject harder than it needs to be.",
            "He is an awesome prof! I loveee his class. Very interesting stuff and he makes them so easy to understand! Thanks prof. Bartel!",
            "This teacher is the bomb, She is easy, you will just have to do a couple papers, and her tests are also easy. If you try really hard, then u wasted ur time, u can barely try and get a B, or try a little bit and get an A. Shes is so easy to understand, and she isnt boring.. TAKE THIS TEACHER",
            "I took this class for an 8 week semester. I'm pretty good with Microsoft Office in general, so this class was pretty easy. Plus, Herbert is very nice and everything is very clear. I even emailed her and asked if she would open a couple tests up early so I wouldn't have to take it finals week, and she totally understood and opened them up!",
            "I've just finished his class. It was difficult but very interesting. His personality is fantastic. He seems to love what he is doing.",
            "I had him for business calc and he made everything easy to understand. If you go to class and pay attention there is no way you can fail. He is very nice, cares about his students, and approachable.",
            "This class is pretty difficult and he does a LOT of intense mathematical derivation, sometimes without the basics or non-technical explanation of what's going on. He's very helpful outside of class though - and is a really, really nice guy.",
            "really really easy. she's nice",
            "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
            "She was awsome and by far the easiest and best professor ive had at uab!",
            "This class felt like my high school math classes. You have homework assigned every night, but not a lot. If you need help he LOVES to help. He's kind of a goofy guy so the class is a little bit more enjoyable for a math class. I would recommend him to anyone.",
            "Had him for Bus 1 and personal finance. Very easy class, my book was hardly used except for tests. Lectures aren't very helpful for tests, but he does relate RL situations, through experience, to things in the text. Often absent, but I forgive him from his age. One of my fav prof, mainly from personality. Esy clas, teach urself if u want to lrn any",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
            "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
            "He was a great prof. Made the class very interesting and easy to follow. Able to really keep your attention, I really enjoyed the class."
          ],
          "description2taxonomy": {}
        },
        "evaluates required effort; specifically, the text expresses the amount of work or time needed to achieve a good grade or understand the course content. For example, 'Easy IF YOU PAY ATTENTION.'": {
          "node_name": "root_id=4_node=8280793448833787096_node=-1435801846245131924",
          "description": "evaluates required effort; specifically, the text expresses the amount of work or time needed to achieve a good grade or understand the course content. For example, 'Easy IF YOU PAY ATTENTION.'",
          "texts": [
            "A course surveying 1000 years is not going to be easy but she knows her stuff. Take lecture notes, that's what tests are based on and read. Going to classes everyday is not unheard of, this class does require effort but you will be rewarded.",
            "she is probably the easist teacher you can get. She doesnt take attendance and gives study guides that make the test extremely easy, and homework is counted as extra credit. Super nice woman holds study sessions if you are having trouble. Take it",
            "Great and fun guy. Not very hard to get an A in his class. And you still learn!",
            "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
            "Prepare to do a lot of outside study to learn anything in this class. All lectures are just PowerPoint slides and frequently have mistakes in them. He takes off points on HW & tests for things like not showing work on basic math and not using the exact format he uses on formulas. He also has a hard time understanding any questions people ask.",
            "very easy A. hes not to good of a teacher, but if youre looking for an easy A, that is the teacher for you.",
            "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
            "I had Prof. Sussman for Intro. to Media Criticism. Her classes are very interesting and she knows what she's talking about. It's really easy to get a good grade in the class as long as you listen to what she has to say. The tests are a lot of writing, but she prepares you really well.",
            "This teacher is the bomb, She is easy, you will just have to do a couple papers, and her tests are also easy. If you try really hard, then u wasted ur time, u can barely try and get a B, or try a little bit and get an A. Shes is so easy to understand, and she isnt boring.. TAKE THIS TEACHER",
            "He's certainly got little patience outside of class and isn't very accessible in general, but if you do the readings and come to class you can get by easily.",
            "Overall this class is easy. Just need to practice for exams or you will not do well.",
            "I had him for business calc and he made everything easy to understand. If you go to class and pay attention there is no way you can fail. He is very nice, cares about his students, and approachable.",
            "Easy if you answer all his study guides. One paper required regarding writing about a national park. Open book/note test and if you answer all the questions on the study guide, you should get an \"A\" in the class",
            "Easy IF YOU PAY ATTENTION. She teaches based on application, not content. Expect things you don't know to be on the test. She grades easy but it is the tests that will get you. Make a study group - quizlet helps immensely with this class. Sweet lady but not the nicest of people, and will treat class as if it is an elementary school classroom.",
            "First, IT 101 is a joke so it really doesn't matter. Englander is a funny guy and you don't have to do much for his IT workshops. Just get an 80+ on the final and a guaranteed 4.0",
            "Tests were easy for someone with science background and study slides. Hard if you do not pay attention. Stickler on class etiquette. You will get a good grade on the papers if you include everything she requires (she gives you a rubic). Wants to be able to read the paper without trying to figure out what you are trying to say.",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
            "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
            "Professor Sierra's class could not be any easier. I definitely liked the fact that there was no homework compared to the other TA teacher. Go to class, stay for the movies, jot down the notes, and review before the test. THERE IS NO REASON YOU SHOULD NOT GET AN A IN THIS CLASS!",
            "The accent is the worst part, he's very hard to understand. But the class overall is easy to pass with little effort. Attendance isn't mandatory but homework is due every class. He reviews the class before the test and it's a great indication of what to expect on the tests. His tests are multiple choice and easy to do well on. Textbook used for HW",
            "Way 2 much work for a 5 week summer course. Lecture Tests were way 2 hard & the reviews for them were massive. By the time U answer everything on the review you don't have to much time 2 study. Plus, your only tested on a third of the actual review! Tests look nothing like the review. DO NOT take unless you REALLY have to. (Blended course)",
            "I enjoyed the way he lectured, but you really have to work for your grade in this class. I recommend you to print the notes out and just fill in the blanks. There was a weekly online hw and quiz, but they were usually pretty easy. Just as long as you put some effort into studying for the exam, you'll do fine.",
            "IGNORE the last 9 reviews they're BS. Bob doesn't do EC and no paper. There are 2 exams he writes (60%), online hmwk (10%) and 1 department-wide final (30%) he doesn't write. Bob is great and his exams aren't easy but he gives you great reviews. The Final SUCKS! Bob never sees it so he can only help so much. DO WELL on Bob's exams you'll need it."
          ],
          "description2taxonomy": {}
        }
      }
    },
    "talks about professor's personality; specifically, the text highlights the professor's demeanor, attitude, or personal qualities. For example, 'Very helpful. A terrific instructor!'": {
      "node_name": "root_id=4_node=-2734382383994868644",
      "description": "talks about professor's personality; specifically, the text highlights the professor's demeanor, attitude, or personal qualities. For example, 'Very helpful. A terrific instructor!'",
      "texts": [
        "Karpinski is definitely a real gem. He gives you extra time to turn in papers. He is a fair grader. He has amazing lectures. He is more interested about you knowing the material than passing, so you most definitely will pass if you just show little effort in the class. I LOVE this man. I'm graduating if not, I'll take him again. ONE OF THE BEST!!!",
        "Wonderful prof. I didn't plan to continue on with spanish after I fulfilled my requirements, but she inspired me to do that. She's very helpful and is always helping plan very cool activities.",
        "Awesome teacher... makes class fun... easy to talk to and very carring!!! Come Back!!!!",
        "She's been teaching for years & she's excellent at it. She cares about her students. You will have to do 3 speeches. If you pick topics that are compelling that no one else in the class would even think about doing then you will pass her class with a good grade. It's not easy A though, you will have to work for it!",
        "Great and fun guy. Not very hard to get an A in his class. And you still learn!",
        "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
        "He treats his students with respect and likes to push them to think about their beliefs from all angles.",
        "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
        "Great Professor,very knowledgeable and he is always there for his students.",
        "He is \"quite literally\" the best professor at CCC. You will learn so much from him because he isn't afraid to tell the truth. Lectures are long, but he is absolutely hilarious. Great class",
        "A very good and passionate teacher. He really cares about the material and is very helpful and compassionate toward students. Nicest guy in the world!",
        "Ms. Maguire was great. I took Intro and she explained the material well. She is obviously passionate about the subject and her enthusiasm made it interesting. It is possible to do well if you do all assignments PLUS practice problems.",
        "Professor Gendron is probably the best professor at Assumption College. He gives you the honest truth and actually talks about stuff that is relevant to today's society. His lectures are extremely interesting and he is more than helpful during his office hours. But don't be on your cellphone during class.",
        "very nice man, although the lecture is some what boring however he explains very well; easy to understand his lectures and he's been very helpful; best prof i've seen @ UW",
        "Intelligent. Ahead of the Game. Expects Professionalism. Learning will occur. Take His classes at any cost!",
        "Mr. Howard was a great teacher. Laid back and easy-going. He's the type of guy that you could go to a bar and get a beer with. Learned a lot from him.",
        "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
        "She was an absolutely amazing professor. I really loved her. She just had so much positive energy and such a great attitude. She made me appreciate Theatre. If you have any chance to have her, do it! You won't regret it. Very easy and fun too, I miss her as a professor.",
        "Very sweet, a little absent minded sometimes but to a minimal degree without too much interference to her teaching. Her critiques were nice because she could usually point out a projects merits but balance it with constructive criticism. You'll enjoy her class if you enjoy a lot creative freedom.",
        "SUPER LAID BACK. pretty simple class; read - take quiz - some papers - a group presentation at the end - the the final paper. Very nice man. I would definately recomend him and this class. Easy GE!",
        "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
        "Incredible woman with such a large heart and lots of stories. I loved talking to her and miss presence here a lot. She really helps you understand the texts with all of her background information and makes lectures interesting. Hopefully she'll be back in Spring 06.",
        "I absolutely love Dr. Woolard; she's a kind soul, and she genuinely cares about her students and wants to help them succeed. The class is not difficult, though I did experience some technical difficulties with my computer which she was always willing to work through with me. She doesn't believe in making a subject harder than it needs to be.",
        "One of the best Profs here. Outstanding teacher!",
        "He teaches like a kid that is excited for a present on Christmas but it makes a usually dull subject engaging. I had him in the morning and he was almost better than coffee for waking me up.",
        "Arlan is probably the greates prof ever. Super funny, super enthusiastic, you learn alot while having fun. Super smart guy who wants you to do well. Take his class over anyone!",
        "Keeps the classes interesting. Even plays games with the class. Very friendly and likes being a teacher. Too bad most professors at Loyola aren't anywhere near as good.",
        "Sometimes unorganized and boring but seems to be passionate about education.",
        "Amazing teacher! Had her for my online College Alg class, and she is so helpful with any questions you have. I would take one of her classes anytime!",
        "Very helpful. A terrific instructor!",
        "I loved his class! I think Prof Shangraw is amazing, very knowlegeable and concise. Tough grader, but what do you expect? Its a tough field. Very helpful. He knows his stuff, plus a VERY nice guy, with hot daughters.",
        "I have never been so simultaneously entertained and intellectually stimulated by a professor until I took Media Crit taught by Sue Collins. Sure, the class was challenging but never painful; everything we learned was of critical importance to understanding the backbone our society. SUE COLLINS= learning, enlightenment, and great comedy.",
        "He is an awesome prof! I loveee his class. Very interesting stuff and he makes them so easy to understand! Thanks prof. Bartel!",
        "thoroughly enjoyed him as a teacher and as a person...very helpful.",
        "Best professor I've ever had. I want to be her when I grow up.",
        "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
        "Weber is a freaking amazing teacher did his Layers of Rome Trip, thought it was going to be a party. You go over there to learn! I learned more in one month with him than any other professor. He's a tough grader, expects a lot from you and is truly one hell of a teacher. If you want to learn, take this class if you want an easy A keep walking.",
        "I took this class for an 8 week semester. I'm pretty good with Microsoft Office in general, so this class was pretty easy. Plus, Herbert is very nice and everything is very clear. I even emailed her and asked if she would open a couple tests up early so I wouldn't have to take it finals week, and she totally understood and opened them up!",
        "This Professor is awesome! He's so helpful and he's really interested in helping students learn. He encourages discussion inside and outside the classroom and he teahes you how to look at subjects from a new angle",
        "LOVE! She is definitely the best professor I've had at Denison. She is super interested in the material and gets you interested even when the material can be very tedious. Great class I'd suggest her to any and all students. Side note I liked her so much I made her my advisor and she teaches the farthest thing from my major.",
        "Good teacher. Helpful, if you are here to learn about stats he can help you understand it by simplifying it. I get his class and it's easy to understand though I worry about his health. Don't listen to people's complain about him because they have no interest in math and does not know any bad teacher. I would recommend him to my friends",
        "I enjoyed his first year class (HIST1010) so much that I just had to take his third year one, and it was honestly well worth it! He is one of the best lecturer's around and funny as hell.",
        "At first she's intimidating, but once you actually began class she's awesome. Never had a better instructor. She brings in alot of outside content that relates to the work.",
        "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
        "AMAZING PROFESSOR! I wish i can take him again for another class..",
        "I've just finished his class. It was difficult but very interesting. His personality is fantastic. He seems to love what he is doing.",
        "Although I wasn't really interested in the subject matter itself, Arlan is an amazing prof. He's funny, energetic and really made an otherwise boring night-class bearable. If you're ever interested in anything that has to do with music and technology, Arlan is your man. Highly recommended. (oh, and his assignments are easy as well :P )",
        "Muckell is the absolute best. Nyack should be lucky to have him. He is honestly the only reason i ever even stayed at Nyack. The school has so many problems and is so messed up it needs more people like Muckell.",
        "So far he seems like a good guy. Very animated",
        "LOVED this class! I recommend it to EVERYONE with this prof! He teaches things beyond the textbook and has helped me with life skills.",
        "Not sure how he got the negative ratings, but the Prof was the exact opposite of what was stated on here. Prof was very clear, very good, and the class was really interesting.",
        "I had him for business calc and he made everything easy to understand. If you go to class and pay attention there is no way you can fail. He is very nice, cares about his students, and approachable.",
        "Professor Cameron is a really enthusiastic guy, he is so well learned and his lectures are never boring. He really knows his stuff. He is a really tough grader though, I would get a B+ on his exam and he told me I did extremely well.I don't consider a B+ an extremely good grade, but he does. Focus on the topics he emphasized, they'll n on the exam",
        "She is one of the best teachers so far. She is very helpful. When she is grading, she comments what is wrong about the paper so it will become better. Very helpful!!I wish I had taken her for 102 but sadly I didn't :(",
        "LOVED HER. she was my favorite professor EVER",
        "Expects great things from her students. If you give your all, you will succeed--if not, you will not be respected by her. Weird sense of humor, took me awhile to \"get\" her. I bet she's fun when she lets her hair down!",
        "One of the best psych professors at Smith. He is organized and engaged and always willing to meet with students. His lectures and assignments are clear and organized so it is easy to study for his exams. I never wanted to miss a class!",
        "The lectures were hard to follow but he is a great guy and knows his stuff. Don' have to worry about getting the paper in on the due date, just get it in. He understands the meaning of GRACE. Thank you Jon!",
        "patient and concise",
        "Buy a digital recorder!!! YOU WILL NEED IT!!!! Take good notes, re-listen to lecture, re-write your notes, trade notes with someone else and you'll do great! Prof. Rose is straight up, honest and helpful! He's more chill if you get into the PM lab! Easy to talk to. Seems harder than he is! Do the work and you'll get a good grade! You have to earn i",
        "Jay is a great teacher and is very clear in his description of Calculus II concepts. He is extremely funny and always engaging during class. He's the perfect balance of a teacher who actually does an effective job of explaining material and making class enjoyable.",
        "This class is pretty difficult and he does a LOT of intense mathematical derivation, sometimes without the basics or non-technical explanation of what's going on. He's very helpful outside of class though - and is a really, really nice guy.",
        "He's great!",
        "Very helpful! He really understands students and is willing to work with you. One of the best professors I've ever had! Really funny as well!",
        "i love this man. he is the best chemistry professor. if u hate and dont understand jack sht then take him. he explains really well, gives alot of examples, and doesnt move on until hes sure everybody gets it. the book isnt needed, but it helps cos u do problems off of it and it helps for the exams. hes funny too. great overall!",
        "Great teacher, I would definitely take him again. He keeps you interested and actually cares about the students not just his job.",
        "If you strive to do more than just learn the material you will average out. She is a professor who is passionate, and therefore has high expectations. Prepares you for the real world.",
        "I loved him. He cares about his students. Go to class, do the work, and you'll get a good grade. I went back to school after many years and he helped me more than any other professor. He's fun and interesting. I wish I had more classes with him. A great professor. Easy A if you try.",
        "I am a garbage programmer but this guy is a very good instructor if you have the ability to learn programming. Easy going, helpful, will do half the code for you if you are struggling. Probably the best introductory programming instructor you could get. Show some effort and he will always help you.",
        "Even though we are slightly past midterms, I have thoroughly enjoyed his class. When I decided to take his class many people told me not to take it, but he is very personable. The best way to pass his class is to write down what's on the board and then refer back to the book to take more in depth notes. I will definitely be taking his class again.",
        "Bob.. Is fabulous! He helps people when they need help. If you are worried he will reassure you that everything will all work out in the end! He teaches you not to give up on yourself and to remember that you can do this work-- all you have got to do is try and take BOB!",
        "SO HELPFUL. oh my goodness! He finds ways to help me in between lessons! i was struggling with my tremolos for months and he said like 1 sentence and that fixed the problem. Great teacher!",
        "Hate science, he made me love it. Very interesting class.",
        "I have had Dr. Bosworth for 3 classes now. This professor has a great personality and really enjoys interacting with the students. His website is full of useful material to help ace test. overall, assignments are easy, but do require effort.",
        "Excellent teacher!! Always willing to answers your questions. I would recommend her to any students interested in Graphic Design. She is able to relate real world experience to us.",
        "Very passionaite and understanding teacher! Extemely fair!",
        "I Love Mrs Haynie! She is probably the funniest teacher I have had yet! She is so quirky! Her world lit class was one of my favorite classes.No textbook, just a study packet she has put together herself.Her test expectations are clear and she makes literature very interesting! Take this class!!",
        "He is very helpful and is willing to give his time to you. He also lets class decide if they want to be there or not at times",
        "I took her for an online class. She is a great teacher always helpful! The book work gets alittle hard but its not her making it up!",
        "Very up to date with current events. Very current content. Great sense of humour. Highly recommend, (you da' man now dawg!)",
        "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
        "From what should be the most boring class (SAD), doing flow charts and drawings Dwayne actually manages to keep things interesting. He likes to joke around and pick on people but it's all in good fun. Although he can be tough on you in class at times his class is definitely my favorite.",
        "Class grade is mostly the projects which require a lot of time but are very useful to the real classroom and for the most part are interesting to do!! Dr. Wall is very helpful and one of the nicest teachers I've had!",
        "This guy's crazy classroom antics and enthusiasm for the subject by themselves make any class with him worth taking. He knows his stuff about mechanisms. He absolutely loves teaching this subject and it shows. He's also really lenient on homework grading. He can throw some curveballs on tests.",
        "I feel like Dr. Andy is a love him or hate him kind of professor. Because he talks about things he likes poetry, film, music and gives lots of factoids in class, it could mean amazing or bust depending on what type of student you are. I personally liked him because I learned a lot during class and office hours. He nurtures creativity. A family man.",
        "Fisher seems like an articulate, personable guy and his lectures are interesting and simple to grasp. That being said, he's condescending in office hours and his tests never reflected the concepts he stressed in class. It's definitely not the easy elective people make it out to be, but it's probably the most interesting higher level biology class.",
        "What can I say, loved her and the class!",
        "Fun class, easy teacher and he's always smiling. Just show up do the assignment for the day and get an A! Joke of the day is the best",
        "Wonderful teacher. You will learn so much about life and yourself in his courses.",
        "Her passion, extensive knowledge and understanding of children definately shines through each lecture",
        "AMAZING I LOVED MY INTRO TO SOCIAL WELFARE. SHE IS AN AMAZING PROFESSOR!!! : )",
        "Energetic, passionate instructor. He is great to have discussions with, especially if you disagree with his viewpoint. He loves the discussions which is why we always ran behind. Didnt give grades on homework - just credit/no credit which was a nice change.",
        "She was awsome and by far the easiest and best professor ive had at uab!",
        "She was such a sweet instructor! I loved her classes! She was always so happy to see you in class! She brought out better writing skills from me. Pam was a good natured woman with a heart of gold!",
        "Very goofy. Very mind challenging but very interesting and fun.",
        "I really like Prof Fey. He is helpful and I think really looks out for his students best interests. The tests are hard but he always gave free points and his lectures are somewhat boring but he does his best to make them interesting. I recommend!",
        "She is definitely a feminist but an all around nice woman.",
        "One of the best instructors I've had. Very helpful in all areas. Will do anything he can to help a student understand and pass the courses he teaches",
        "he is the best professor i have ever taken beware he is a tough grader and makes you work hard but he is easy to understand he cares for students as long as you care incorporates hip hop into his lessons sometimes which is cool we watched breaking bad in his class he teaches you everything he changed the way i think he changed my life",
        "Knows history and truly enjoys when students are engaged. This can be a really fun class. He talks about his stories and that annoyed some students, but I enjoyed listening to things I never knew about. If you want to learn, listen to what he says. Ask questions! He's very receptive to any questions",
        "hes pretty clear and patient with his students. Hes a very serious guy and you cant talk in class or that will deff sway your grade trust me... is it an easy A.. no but if you pay attention dont talk go to every class and show a lot of interest and get the moves the way he wants it then it will be..",
        "If you come to class you'll be fine. Spent a lot of time covering certain topics and then rushed through others. Very helpful if you go to his office hours, but beware, he may sit and talk to you for hours if nobody else is waiting. Knows a lot about his topic and overall is a very good professor.",
        "His intelligence and personality is so sexy. Can't wait to take his Vietnam class next year. This guy rocks! By far the best prof I have ever had here at UVIC.",
        "Prof. Delcastillo is one of the best if not \"The\" best online professor john jay has. No midterm or final everything comes from the reading. Pay careful attention to his instructions and you will do fine. Great class you learn lots wish he taught more classes at john jay.",
        "His tests are difficult because of the short responses, but he is a great and passionate teacher",
        "Great teacher. Very clear and super intelligent. Kind and cute. I learned a lot.",
        "This class felt like my high school math classes. You have homework assigned every night, but not a lot. If you need help he LOVES to help. He's kind of a goofy guy so the class is a little bit more enjoyable for a math class. I would recommend him to anyone.",
        "He is an incredibly caring professor and genuinely wants all of his students to pass. It's a credit/no credit class so it's really hard to fail unless you don't do any of the assignments. He believes in all of his students and is probably one of the sweetest professors at SJSU.",
        "Professor was had plenty of relevant professional experience to pull from, provided assignments that were effective \"advanced organizers\" and made good use of available technology. Also highly approachable and very helpful.",
        "Great guy, great class. Incredibly nice and willing to work with students. Show up for 121 and you're practically guaranteed to pass",
        "She is super awesome!!!!!",
        "Well-spoken, highly intelligent professor. Not terribly outgoing, but really nice and helpful if you take the time to get to know him. Exam is tough...but, would still recommend.",
        "If every professor was like Dr Allen, we all would be inspired. She is absolutely great.",
        "Hysterical, very clear, will repeat fingerspelling as many times as needed for people to understand. just wish she enforced \"voice off\" a bit more.",
        "very cool guy, he made class interesting and really taught me alot. Good sense of humor and if you have a problem or need extra help, do not hesitate to ask he is totally there to help.",
        "Fantastic professor. Loved his teaching. Took documentary survey from him. He opened my eyes to the art of docs, which I didn't understand before the class. He makes you write, so be prepared for probably 3-5 decent length papers. He will grade semi-tough but it's worth it. Some of the docs aren't the most interesting, but are valuable nonetheless.",
        "one of the most exciting profs at U of T. and that's not just because she's so hot. which makes me wonder - where are all her chili peppers?! is anyone more deserving?",
        "Very nice guy and really cared about his students. He has some really great stories.",
        "Dr. Polin is one of the remaining few professors of education I know who actually give real grades. She expects her students to work and think. She is an amazing mentor to those who show up to learn. She is a nightmare for those who show up to get by.",
        "he illuminated modern philosophy, taught me how to teach myself, makes school fun and challenging for all levels of intelligence and aptitude simultaneously, and soes all of this with a kind of stoner demeanor that makes him all the more approachable. Everyone can and should take from Paul.",
        "Absolutely the best I've ever had. Really cares about his students, will take the time to help you. Not an easy class, but he makes even the most boring stuff interesting and understandable. Excellent!",
        "This man went out of his way to help his class learn. He really made biology understandable and he even made it relative to every day life. He drew everything out on the board and I thought that his lectures and labs were very colorful. Wonderful teacher!",
        "Very organized and always prepared for each lecture. Gives crystal clear explanations of slides and definitions during lectures. Tough but fair grader. The semester isn't even half over, and I consider him one of my favorite profs I've had. Take Breiner!!",
        "Everything is on WebAssign (homeworkquizzes) except for the midtermfinal so make sure to get it. The ebook comes with WebAssign so you don't really need the actual book. I fell a little behind in his class, but caught up and passed with an A. Good luck. He's really laid back and a great teacher! You won't regret taking him. :-D",
        "very helpful, I was not even supposed to be advised by him, just showed up for some help, and he was available. above and beyond. some wish to complain about hard work and too many classes, but they are pre-med??! If you cannot take 5 hard undergrad courses at once, you will not survive med school",
        "I had him for calc 1. I would definitely choose him as a prof. again. Homework isn't mandatory which means quizzes and exams are the only thing he grades. I didn't study as much as I should have and when final exams came, I struggled. He's easy to understand and helpful outside of class. If you show up to class, you shouldn't have any problems.",
        "Great teacher with interesting experience and a delightful sense of humor. You'll learn a lot in his classes!",
        "Prof. Adams has the students best in mind when she teaches this class. She gives you ample chances to get your work done and is very fair. I would highly recommend you take her class.",
        "Great teacher. Kind of rude at points, but you will definitely know Chemistry by the end. He is hard but fair and makes you work for your grade. You don't get formula sheets for the test, but with enough practice they're fairly easy to remember. Take this guy if you can!",
        "By far the best professor I've had the privilege to have at Denison. He's so enthusiastic about Biochemistry, and he will do whatever it takes to help you learn/understand, even if that requires him losing sleep. His understanding and willingness to help really made me want to do well in this class. If you get the chance, take a class with him!",
        "Makes the subject matter more interesting than many other professors can. Down to earth and understanding professor. Loves to play devil's advocate during open discussions, so don't take his comments personally. Much better class than expected.",
        "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
        "Take note of EVERY WORD that comes out of his mouth. He WOULD test you on it. Also read the text because he would test you on that also. In all it's about 120 multiple choice questions in 2 hrs. He gives credit for good attendance also. Other than that - he is a nice professor, very fair and to the point, and the class is interesting.",
        "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
        "This was a online class, you do all your work & tests at home(except final)If you ever needed help Ms Sowell would work problems for you or offer to meet you online. She seems real nice and I would take her class!",
        "Prof. H. Afshari was extrermenly helpful. Vey interesting man to listen to,he has seen and been through alot. definetly learn alot in his class.",
        "The class material was interesting, and he was always available for help/questions. Extra credit was made available. He's a really nice person and probably one of my favorite professors.",
        "Great Teacher! Very clear on what he wants and will help you anytime on any of your assignments and answer any questions, even if its not related to the course. He's very passionate about what he teaches and concise and considerate about everyone in the class.",
        "great guy, great teacher, highly recommend him",
        "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
        "Mark does expect a lot out of his students but he just wants you to succeed. He's always there to help and you can learn a lot from him if you choose to. DO NOT take this class unless you are interested in painting and have done it before! Even though the class was hard and time-consuming, it was definitely the best class I've taken at SSU.",
        "Dr Slusher is passionate about her work and nursing as a profession. I have personally enjoyed learning a about h e r experiences. She provides examples pertinent to content she is teaching and encourages class participation enhancing optimal learning. She sets high expectations for student success and accountability which I admire and applaud.",
        "Extremely helpful and available. Highly intelligent, you will learn alot from any of his classes if you will let yourself!",
        "I had Dr. Cavaiola for 3 classes-psychopathology, marriage, and family. He is not easy, but the best professor to take if you want to learn a lot. His classes are fun and interesting, and he is very professional and fair. He is the epitome of what a professor should be.",
        "She is a very nice, easy teacher. She will help you and give you time to get projects done. However, there was no method to her madness as far as how projects were weighted. But didnt really natter because as long as you did it fairly well, you got an A.",
        "Professor Potter is a really good and caring professor. He goes through his lectures at a good pace to make sure you get what you need. The only downside is that your graded on few things, but as long as you study hard its a great class to take.",
        "i have had him for 2 classes now. He is great. Pay attention in his classes and show up since he gives points for attendence. I got a 4.0 both times ive taken him. Love him!",
        "She is an excellent teacher. I took her 6 week class in the summer. I had to work hard but I was never bored in her 3 hour classes. She teaches with power point, video, overhead, discussion and presentations all in the same class. If you want to learn and do not mind working for the grade, take her. You will retain the knowlege years from now.",
        "He was a great prof. Made the class very interesting and easy to follow. Able to really keep your attention, I really enjoyed the class.",
        "She's really nice and makes an effort to get to know you. Her class is definitely challenging, but the benefits are great. I had an okay time in her class, it wasn't the best time but it wasn't horrific either.",
        "Excellent teacher. He explains everything very clearly, and keeps the class going at a manageable pace. If you don't understand something, he will work with you until you get it. If you're really interested in something, he'll encourage you further in it."
      ],
      "description2taxonomy": {
        "addresses the professor's enthusiasm and energy; specifically, the text describes the instructor's passion for teaching and the subject matter, as well as their ability to engage students. For example, 'She was so energetic and made every class exciting!'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=2745724581508776995",
          "description": "addresses the professor's enthusiasm and energy; specifically, the text describes the instructor's passion for teaching and the subject matter, as well as their ability to engage students. For example, 'She was so energetic and made every class exciting!'",
          "texts": [
            "Wonderful prof. I didn't plan to continue on with spanish after I fulfilled my requirements, but she inspired me to do that. She's very helpful and is always helping plan very cool activities.",
            "Awesome teacher... makes class fun... easy to talk to and very carring!!! Come Back!!!!",
            "I took her social problems class a couple about a year ago... awesome class. Very hard, lots and lots of reading (stacks of articles handed out each week). Well worth it. One of the best professors at HCC. Prepares you for the four year schools!!",
            "A very good and passionate teacher. He really cares about the material and is very helpful and compassionate toward students. Nicest guy in the world!",
            "Ms. Maguire was great. I took Intro and she explained the material well. She is obviously passionate about the subject and her enthusiasm made it interesting. It is possible to do well if you do all assignments PLUS practice problems.",
            "She was an absolutely amazing professor. I really loved her. She just had so much positive energy and such a great attitude. She made me appreciate Theatre. If you have any chance to have her, do it! You won't regret it. Very easy and fun too, I miss her as a professor.",
            "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
            "He teaches like a kid that is excited for a present on Christmas but it makes a usually dull subject engaging. I had him in the morning and he was almost better than coffee for waking me up.",
            "Arlan is probably the greates prof ever. Super funny, super enthusiastic, you learn alot while having fun. Super smart guy who wants you to do well. Take his class over anyone!",
            "Keeps the classes interesting. Even plays games with the class. Very friendly and likes being a teacher. Too bad most professors at Loyola aren't anywhere near as good.",
            "Amazing teacher! Had her for my online College Alg class, and she is so helpful with any questions you have. I would take one of her classes anytime!",
            "I have never been so simultaneously entertained and intellectually stimulated by a professor until I took Media Crit taught by Sue Collins. Sure, the class was challenging but never painful; everything we learned was of critical importance to understanding the backbone our society. SUE COLLINS= learning, enlightenment, and great comedy.",
            "Best professor I've ever had. I want to be her when I grow up.",
            "Weber is a freaking amazing teacher did his Layers of Rome Trip, thought it was going to be a party. You go over there to learn! I learned more in one month with him than any other professor. He's a tough grader, expects a lot from you and is truly one hell of a teacher. If you want to learn, take this class if you want an easy A keep walking.",
            "LOVE! She is definitely the best professor I've had at Denison. She is super interested in the material and gets you interested even when the material can be very tedious. Great class I'd suggest her to any and all students. Side note I liked her so much I made her my advisor and she teaches the farthest thing from my major.",
            "I enjoyed his first year class (HIST1010) so much that I just had to take his third year one, and it was honestly well worth it! He is one of the best lecturer's around and funny as hell.",
            "At first she's intimidating, but once you actually began class she's awesome. Never had a better instructor. She brings in alot of outside content that relates to the work.",
            "AMAZING PROFESSOR! I wish i can take him again for another class..",
            "I've just finished his class. It was difficult but very interesting. His personality is fantastic. He seems to love what he is doing.",
            "Although I wasn't really interested in the subject matter itself, Arlan is an amazing prof. He's funny, energetic and really made an otherwise boring night-class bearable. If you're ever interested in anything that has to do with music and technology, Arlan is your man. Highly recommended. (oh, and his assignments are easy as well :P )",
            "LOVED this class! I recommend it to EVERYONE with this prof! He teaches things beyond the textbook and has helped me with life skills.",
            "LOVED HER. she was my favorite professor EVER",
            "One of the best psych professors at Smith. He is organized and engaged and always willing to meet with students. His lectures and assignments are clear and organized so it is easy to study for his exams. I never wanted to miss a class!",
            "Jay is a great teacher and is very clear in his description of Calculus II concepts. He is extremely funny and always engaging during class. He's the perfect balance of a teacher who actually does an effective job of explaining material and making class enjoyable.",
            "i love this man. he is the best chemistry professor. if u hate and dont understand jack sht then take him. he explains really well, gives alot of examples, and doesnt move on until hes sure everybody gets it. the book isnt needed, but it helps cos u do problems off of it and it helps for the exams. hes funny too. great overall!",
            "If you strive to do more than just learn the material you will average out. She is a professor who is passionate, and therefore has high expectations. Prepares you for the real world.",
            "Hate science, he made me love it. Very interesting class.",
            "I Love Mrs Haynie! She is probably the funniest teacher I have had yet! She is so quirky! Her world lit class was one of my favorite classes.No textbook, just a study packet she has put together herself.Her test expectations are clear and she makes literature very interesting! Take this class!!",
            "This guy's crazy classroom antics and enthusiasm for the subject by themselves make any class with him worth taking. He knows his stuff about mechanisms. He absolutely loves teaching this subject and it shows. He's also really lenient on homework grading. He can throw some curveballs on tests.",
            "What can I say, loved her and the class!",
            "Her passion, extensive knowledge and understanding of children definately shines through each lecture",
            "AMAZING I LOVED MY INTRO TO SOCIAL WELFARE. SHE IS AN AMAZING PROFESSOR!!! : )",
            "Energetic, passionate instructor. He is great to have discussions with, especially if you disagree with his viewpoint. He loves the discussions which is why we always ran behind. Didnt give grades on homework - just credit/no credit which was a nice change.",
            "His tests are difficult because of the short responses, but he is a great and passionate teacher",
            "If every professor was like Dr Allen, we all would be inspired. She is absolutely great.",
            "very cool guy, he made class interesting and really taught me alot. Good sense of humor and if you have a problem or need extra help, do not hesitate to ask he is totally there to help.",
            "he illuminated modern philosophy, taught me how to teach myself, makes school fun and challenging for all levels of intelligence and aptitude simultaneously, and soes all of this with a kind of stoner demeanor that makes him all the more approachable. Everyone can and should take from Paul.",
            "Absolutely the best I've ever had. Really cares about his students, will take the time to help you. Not an easy class, but he makes even the most boring stuff interesting and understandable. Excellent!",
            "This man went out of his way to help his class learn. He really made biology understandable and he even made it relative to every day life. He drew everything out on the board and I thought that his lectures and labs were very colorful. Wonderful teacher!",
            "By far the best professor I've had the privilege to have at Denison. He's so enthusiastic about Biochemistry, and he will do whatever it takes to help you learn/understand, even if that requires him losing sleep. His understanding and willingness to help really made me want to do well in this class. If you get the chance, take a class with him!",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
            "Great Teacher! Very clear on what he wants and will help you anytime on any of your assignments and answer any questions, even if its not related to the course. He's very passionate about what he teaches and concise and considerate about everyone in the class.",
            "Dr Slusher is passionate about her work and nursing as a profession. I have personally enjoyed learning a about h e r experiences. She provides examples pertinent to content she is teaching and encourages class participation enhancing optimal learning. She sets high expectations for student success and accountability which I admire and applaud.",
            "I had Dr. Cavaiola for 3 classes-psychopathology, marriage, and family. He is not easy, but the best professor to take if you want to learn a lot. His classes are fun and interesting, and he is very professional and fair. He is the epitome of what a professor should be.",
            "She is an excellent teacher. I took her 6 week class in the summer. I had to work hard but I was never bored in her 3 hour classes. She teaches with power point, video, overhead, discussion and presentations all in the same class. If you want to learn and do not mind working for the grade, take her. You will retain the knowlege years from now.",
            "He was a great prof. Made the class very interesting and easy to follow. Able to really keep your attention, I really enjoyed the class."
          ],
          "description2taxonomy": {}
        },
        "emphasizes professor's helpfulness; specifically, the text describes the extent to which the instructor offers support, assistance, or guidance to students. For example, 'he always goes out of his way to help us understand the material.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=-5749368481132503728",
          "description": "emphasizes professor's helpfulness; specifically, the text describes the extent to which the instructor offers support, assistance, or guidance to students. For example, 'he always goes out of his way to help us understand the material.'",
          "texts": [
            "Karpinski is definitely a real gem. He gives you extra time to turn in papers. He is a fair grader. He has amazing lectures. He is more interested about you knowing the material than passing, so you most definitely will pass if you just show little effort in the class. I LOVE this man. I'm graduating if not, I'll take him again. ONE OF THE BEST!!!",
            "Wonderful prof. I didn't plan to continue on with spanish after I fulfilled my requirements, but she inspired me to do that. She's very helpful and is always helping plan very cool activities.",
            "An awesome teacher that really cares about you and your grade. He is very clear with what is on the exam, he even lets you drop an exam. Gives out fair amount of extra credit so getting a good grade in his class isn't too difficult",
            "Great Professor,very knowledgeable and he is always there for his students.",
            "A very good and passionate teacher. He really cares about the material and is very helpful and compassionate toward students. Nicest guy in the world!",
            "Professor Gendron is probably the best professor at Assumption College. He gives you the honest truth and actually talks about stuff that is relevant to today's society. His lectures are extremely interesting and he is more than helpful during his office hours. But don't be on your cellphone during class.",
            "very nice man, although the lecture is some what boring however he explains very well; easy to understand his lectures and he's been very helpful; best prof i've seen @ UW",
            "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
            "Incredible woman with such a large heart and lots of stories. I loved talking to her and miss presence here a lot. She really helps you understand the texts with all of her background information and makes lectures interesting. Hopefully she'll be back in Spring 06.",
            "I absolutely love Dr. Woolard; she's a kind soul, and she genuinely cares about her students and wants to help them succeed. The class is not difficult, though I did experience some technical difficulties with my computer which she was always willing to work through with me. She doesn't believe in making a subject harder than it needs to be.",
            "Amazing teacher! Had her for my online College Alg class, and she is so helpful with any questions you have. I would take one of her classes anytime!",
            "Very helpful. A terrific instructor!",
            "He is an awesome prof! I loveee his class. Very interesting stuff and he makes them so easy to understand! Thanks prof. Bartel!",
            "thoroughly enjoyed him as a teacher and as a person...very helpful.",
            "I took this class for an 8 week semester. I'm pretty good with Microsoft Office in general, so this class was pretty easy. Plus, Herbert is very nice and everything is very clear. I even emailed her and asked if she would open a couple tests up early so I wouldn't have to take it finals week, and she totally understood and opened them up!",
            "This Professor is awesome! He's so helpful and he's really interested in helping students learn. He encourages discussion inside and outside the classroom and he teahes you how to look at subjects from a new angle",
            "Good teacher. Helpful, if you are here to learn about stats he can help you understand it by simplifying it. I get his class and it's easy to understand though I worry about his health. Don't listen to people's complain about him because they have no interest in math and does not know any bad teacher. I would recommend him to my friends",
            "Muckell is the absolute best. Nyack should be lucky to have him. He is honestly the only reason i ever even stayed at Nyack. The school has so many problems and is so messed up it needs more people like Muckell.",
            "LOVED this class! I recommend it to EVERYONE with this prof! He teaches things beyond the textbook and has helped me with life skills.",
            "I had him for business calc and he made everything easy to understand. If you go to class and pay attention there is no way you can fail. He is very nice, cares about his students, and approachable.",
            "She is one of the best teachers so far. She is very helpful. When she is grading, she comments what is wrong about the paper so it will become better. Very helpful!!I wish I had taken her for 102 but sadly I didn't :(",
            "One of the best psych professors at Smith. He is organized and engaged and always willing to meet with students. His lectures and assignments are clear and organized so it is easy to study for his exams. I never wanted to miss a class!",
            "This class is pretty difficult and he does a LOT of intense mathematical derivation, sometimes without the basics or non-technical explanation of what's going on. He's very helpful outside of class though - and is a really, really nice guy.",
            "Very helpful! He really understands students and is willing to work with you. One of the best professors I've ever had! Really funny as well!",
            "i love this man. he is the best chemistry professor. if u hate and dont understand jack sht then take him. he explains really well, gives alot of examples, and doesnt move on until hes sure everybody gets it. the book isnt needed, but it helps cos u do problems off of it and it helps for the exams. hes funny too. great overall!",
            "Great teacher, I would definitely take him again. He keeps you interested and actually cares about the students not just his job.",
            "I loved him. He cares about his students. Go to class, do the work, and you'll get a good grade. I went back to school after many years and he helped me more than any other professor. He's fun and interesting. I wish I had more classes with him. A great professor. Easy A if you try.",
            "I am a garbage programmer but this guy is a very good instructor if you have the ability to learn programming. Easy going, helpful, will do half the code for you if you are struggling. Probably the best introductory programming instructor you could get. Show some effort and he will always help you.",
            "Bob.. Is fabulous! He helps people when they need help. If you are worried he will reassure you that everything will all work out in the end! He teaches you not to give up on yourself and to remember that you can do this work-- all you have got to do is try and take BOB!",
            "SO HELPFUL. oh my goodness! He finds ways to help me in between lessons! i was struggling with my tremolos for months and he said like 1 sentence and that fixed the problem. Great teacher!",
            "Excellent teacher!! Always willing to answers your questions. I would recommend her to any students interested in Graphic Design. She is able to relate real world experience to us.",
            "He is very helpful and is willing to give his time to you. He also lets class decide if they want to be there or not at times",
            "I took her for an online class. She is a great teacher always helpful! The book work gets alittle hard but its not her making it up!",
            "I loved Brother Zenger. He was so nice and willing to help and made class interesting. Just do the homework and come to class and study for the tests which were difficult, but as long as you study, its pretty easy. Loved the study guides and reviews in class.",
            "Class grade is mostly the projects which require a lot of time but are very useful to the real classroom and for the most part are interesting to do!! Dr. Wall is very helpful and one of the nicest teachers I've had!",
            "I really like Prof Fey. He is helpful and I think really looks out for his students best interests. The tests are hard but he always gave free points and his lectures are somewhat boring but he does his best to make them interesting. I recommend!",
            "One of the best instructors I've had. Very helpful in all areas. Will do anything he can to help a student understand and pass the courses he teaches",
            "he is the best professor i have ever taken beware he is a tough grader and makes you work hard but he is easy to understand he cares for students as long as you care incorporates hip hop into his lessons sometimes which is cool we watched breaking bad in his class he teaches you everything he changed the way i think he changed my life",
            "This class felt like my high school math classes. You have homework assigned every night, but not a lot. If you need help he LOVES to help. He's kind of a goofy guy so the class is a little bit more enjoyable for a math class. I would recommend him to anyone.",
            "He is an incredibly caring professor and genuinely wants all of his students to pass. It's a credit/no credit class so it's really hard to fail unless you don't do any of the assignments. He believes in all of his students and is probably one of the sweetest professors at SJSU.",
            "Professor was had plenty of relevant professional experience to pull from, provided assignments that were effective \"advanced organizers\" and made good use of available technology. Also highly approachable and very helpful.",
            "Well-spoken, highly intelligent professor. Not terribly outgoing, but really nice and helpful if you take the time to get to know him. Exam is tough...but, would still recommend.",
            "very cool guy, he made class interesting and really taught me alot. Good sense of humor and if you have a problem or need extra help, do not hesitate to ask he is totally there to help.",
            "Fantastic professor. Loved his teaching. Took documentary survey from him. He opened my eyes to the art of docs, which I didn't understand before the class. He makes you write, so be prepared for probably 3-5 decent length papers. He will grade semi-tough but it's worth it. Some of the docs aren't the most interesting, but are valuable nonetheless.",
            "he illuminated modern philosophy, taught me how to teach myself, makes school fun and challenging for all levels of intelligence and aptitude simultaneously, and soes all of this with a kind of stoner demeanor that makes him all the more approachable. Everyone can and should take from Paul.",
            "Absolutely the best I've ever had. Really cares about his students, will take the time to help you. Not an easy class, but he makes even the most boring stuff interesting and understandable. Excellent!",
            "This man went out of his way to help his class learn. He really made biology understandable and he even made it relative to every day life. He drew everything out on the board and I thought that his lectures and labs were very colorful. Wonderful teacher!",
            "I had him for calc 1. I would definitely choose him as a prof. again. Homework isn't mandatory which means quizzes and exams are the only thing he grades. I didn't study as much as I should have and when final exams came, I struggled. He's easy to understand and helpful outside of class. If you show up to class, you shouldn't have any problems.",
            "By far the best professor I've had the privilege to have at Denison. He's so enthusiastic about Biochemistry, and he will do whatever it takes to help you learn/understand, even if that requires him losing sleep. His understanding and willingness to help really made me want to do well in this class. If you get the chance, take a class with him!",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
            "This was a online class, you do all your work & tests at home(except final)If you ever needed help Ms Sowell would work problems for you or offer to meet you online. She seems real nice and I would take her class!",
            "Prof. H. Afshari was extrermenly helpful. Vey interesting man to listen to,he has seen and been through alot. definetly learn alot in his class.",
            "The class material was interesting, and he was always available for help/questions. Extra credit was made available. He's a really nice person and probably one of my favorite professors.",
            "Great Teacher! Very clear on what he wants and will help you anytime on any of your assignments and answer any questions, even if its not related to the course. He's very passionate about what he teaches and concise and considerate about everyone in the class.",
            "Caporale is a good teacher, and he is very clear on what he wants from you. He makes sure he explains things thoroughly and is very helpful. His tests are HARD. If you aren't a good studier, don't take this class.",
            "Mark does expect a lot out of his students but he just wants you to succeed. He's always there to help and you can learn a lot from him if you choose to. DO NOT take this class unless you are interested in painting and have done it before! Even though the class was hard and time-consuming, it was definitely the best class I've taken at SSU.",
            "Extremely helpful and available. Highly intelligent, you will learn alot from any of his classes if you will let yourself!",
            "I had Dr. Cavaiola for 3 classes-psychopathology, marriage, and family. He is not easy, but the best professor to take if you want to learn a lot. His classes are fun and interesting, and he is very professional and fair. He is the epitome of what a professor should be.",
            "Excellent teacher. He explains everything very clearly, and keeps the class going at a manageable pace. If you don't understand something, he will work with you until you get it. If you're really interested in something, he'll encourage you further in it."
          ],
          "description2taxonomy": {}
        },
        "addresses the professor's ability to facilitate discussions or debates; specifically, the text focuses on the instructor's skill in guiding students' thought processes and encouraging them to consider multiple perspectives. For example, 'He's great at fostering open classroom discussions and respects all opinions.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=564046628931403241",
          "description": "addresses the professor's ability to facilitate discussions or debates; specifically, the text focuses on the instructor's skill in guiding students' thought processes and encouraging them to consider multiple perspectives. For example, 'He's great at fostering open classroom discussions and respects all opinions.'",
          "texts": [
            "He treats his students with respect and likes to push them to think about their beliefs from all angles.",
            "I have never been so simultaneously entertained and intellectually stimulated by a professor until I took Media Crit taught by Sue Collins. Sure, the class was challenging but never painful; everything we learned was of critical importance to understanding the backbone our society. SUE COLLINS= learning, enlightenment, and great comedy.",
            "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
            "This Professor is awesome! He's so helpful and he's really interested in helping students learn. He encourages discussion inside and outside the classroom and he teahes you how to look at subjects from a new angle",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that."
          ],
          "description2taxonomy": {}
        },
        "describes the professor's clarity and communication style; specifically, the text focuses on the instructor's ability to explain complex topics in a clear and concise manner. For example, 'She breaks down difficult concepts into simple terms, making it easy to understand.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=6735432551816574446",
          "description": "describes the professor's clarity and communication style; specifically, the text focuses on the instructor's ability to explain complex topics in a clear and concise manner. For example, 'She breaks down difficult concepts into simple terms, making it easy to understand.'",
          "texts": [
            "very nice man, although the lecture is some what boring however he explains very well; easy to understand his lectures and he's been very helpful; best prof i've seen @ UW",
            "I have never been so simultaneously entertained and intellectually stimulated by a professor until I took Media Crit taught by Sue Collins. Sure, the class was challenging but never painful; everything we learned was of critical importance to understanding the backbone our society. SUE COLLINS= learning, enlightenment, and great comedy.",
            "Not sure how he got the negative ratings, but the Prof was the exact opposite of what was stated on here. Prof was very clear, very good, and the class was really interesting.",
            "patient and concise",
            "Jay is a great teacher and is very clear in his description of Calculus II concepts. He is extremely funny and always engaging during class. He's the perfect balance of a teacher who actually does an effective job of explaining material and making class enjoyable.",
            "Hysterical, very clear, will repeat fingerspelling as many times as needed for people to understand. just wish she enforced \"voice off\" a bit more.",
            "By far the best professor I have had. YES-there is a lot of work and YES the class is hard. But he goes above and beyond trying to do what he can to help his students understand. He gives lots of extra credit and help. He has a great way of relating to his students. He is passionate about what he does and his work reflects that.",
            "Great Teacher! Very clear on what he wants and will help you anytime on any of your assignments and answer any questions, even if its not related to the course. He's very passionate about what he teaches and concise and considerate about everyone in the class.",
            "She is an excellent teacher. I took her 6 week class in the summer. I had to work hard but I was never bored in her 3 hour classes. She teaches with power point, video, overhead, discussion and presentations all in the same class. If you want to learn and do not mind working for the grade, take her. You will retain the knowlege years from now.",
            "Excellent teacher. He explains everything very clearly, and keeps the class going at a manageable pace. If you don't understand something, he will work with you until you get it. If you're really interested in something, he'll encourage you further in it."
          ],
          "description2taxonomy": {}
        },
        "mentions professor's strictness or firmness; specifically, the text discusses the professor's adherence to rules, consistency, or high expectations. For example, 'She is a tough but fair grader, and you have to work hard.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=8496975491677419168",
          "description": "mentions professor's strictness or firmness; specifically, the text discusses the professor's adherence to rules, consistency, or high expectations. For example, 'She is a tough but fair grader, and you have to work hard.'",
          "texts": [
            "Intelligent. Ahead of the Game. Expects Professionalism. Learning will occur. Take His classes at any cost!",
            "Her class is hard, you must do homework, & show-up for class. But she is very helpful & knows what she's talking about. I would say her class is for self-starters who need little guidance. Tests are good if you did H.W. & asked questions when needed. People who fail her class don't do the H.W. or ask clarifying questions.",
            "Weber is a freaking amazing teacher did his Layers of Rome Trip, thought it was going to be a party. You go over there to learn! I learned more in one month with him than any other professor. He's a tough grader, expects a lot from you and is truly one hell of a teacher. If you want to learn, take this class if you want an easy A keep walking.",
            "She's nice, but a tough grader. You have to do all the work and keep up or you will fail.",
            "Professor Cameron is a really enthusiastic guy, he is so well learned and his lectures are never boring. He really knows his stuff. He is a really tough grader though, I would get a B+ on his exam and he told me I did extremely well.I don't consider a B+ an extremely good grade, but he does. Focus on the topics he emphasized, they'll n on the exam",
            "Expects great things from her students. If you give your all, you will succeed--if not, you will not be respected by her. Weird sense of humor, took me awhile to \"get\" her. I bet she's fun when she lets her hair down!",
            "If you strive to do more than just learn the material you will average out. She is a professor who is passionate, and therefore has high expectations. Prepares you for the real world.",
            "he is the best professor i have ever taken beware he is a tough grader and makes you work hard but he is easy to understand he cares for students as long as you care incorporates hip hop into his lessons sometimes which is cool we watched breaking bad in his class he teaches you everything he changed the way i think he changed my life",
            "Dr. Polin is one of the remaining few professors of education I know who actually give real grades. She expects her students to work and think. She is an amazing mentor to those who show up to learn. She is a nightmare for those who show up to get by.",
            "Very organized and always prepared for each lecture. Gives crystal clear explanations of slides and definitions during lectures. Tough but fair grader. The semester isn't even half over, and I consider him one of my favorite profs I've had. Take Breiner!!",
            "Great teacher. Kind of rude at points, but you will definitely know Chemistry by the end. He is hard but fair and makes you work for your grade. You don't get formula sheets for the test, but with enough practice they're fairly easy to remember. Take this guy if you can!",
            "His way of teaching forces the students to become an expert in the topic. Yes you are the one who gives the presentations, so you have to actually go and learn the stuff to be informative to others. Also, unless you are prepared to really learn do not take his class, and come back and whine about his class being hard.",
            "Dr Slusher is passionate about her work and nursing as a profession. I have personally enjoyed learning a about h e r experiences. She provides examples pertinent to content she is teaching and encourages class participation enhancing optimal learning. She sets high expectations for student success and accountability which I admire and applaud."
          ],
          "description2taxonomy": {}
        },
        "discusses professor's organization; specifically, the text comments on the professor's ability to structure their course, lectures, or lesson plans. For example, 'However, there was no method to her madness as far as how projects were weighted.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=6238096924122074913",
          "description": "discusses professor's organization; specifically, the text comments on the professor's ability to structure their course, lectures, or lesson plans. For example, 'However, there was no method to her madness as far as how projects were weighted.'",
          "texts": [
            "One of the best psych professors at Smith. He is organized and engaged and always willing to meet with students. His lectures and assignments are clear and organized so it is easy to study for his exams. I never wanted to miss a class!",
            "She is a very nice, easy teacher. She will help you and give you time to get projects done. However, there was no method to her madness as far as how projects were weighted. But didnt really natter because as long as you did it fairly well, you got an A."
          ],
          "description2taxonomy": {}
        },
        "addresses professor's looks or appearance; specifically, the text alludes to the professor's physical attractiveness or personal style. For example, 'Kind and cute. I loved her classes.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=8665997728011624757",
          "description": "addresses professor's looks or appearance; specifically, the text alludes to the professor's physical attractiveness or personal style. For example, 'Kind and cute. I loved her classes.'",
          "texts": [
            "one of the most exciting profs at U of T. and that's not just because she's so hot. which makes me wonder - where are all her chili peppers?! is anyone more deserving?"
          ],
          "description2taxonomy": {}
        },
        "focuses on professor's sense of humor; specifically, the text indicates that the professor is funny, entertaining, or makes students laugh. For example, 'He's the type of guy that you could go to a bar and get a beer with.'": {
          "node_name": "root_id=4_node=-2734382383994868644_node=2672967223710754297",
          "description": "focuses on professor's sense of humor; specifically, the text indicates that the professor is funny, entertaining, or makes students laugh. For example, 'He's the type of guy that you could go to a bar and get a beer with.'",
          "texts": [
            "He is \"quite literally\" the best professor at CCC. You will learn so much from him because he isn't afraid to tell the truth. Lectures are long, but he is absolutely hilarious. Great class",
            "Mr. Howard was a great teacher. Laid back and easy-going. He's the type of guy that you could go to a bar and get a beer with. Learned a lot from him.",
            "Class was kinda tough (higher level engineering math), but he did pretty well teaching it...uses a lot of his own problems for homework, does some things that aren't in the book. Great guy, makes jokes all class; he really gets into what he's teaching, which helps with learning (even if you don't really understand it)",
            "Arlan is probably the greates prof ever. Super funny, super enthusiastic, you learn alot while having fun. Super smart guy who wants you to do well. Take his class over anyone!",
            "Keeps the classes interesting. Even plays games with the class. Very friendly and likes being a teacher. Too bad most professors at Loyola aren't anywhere near as good.",
            "I have never been so simultaneously entertained and intellectually stimulated by a professor until I took Media Crit taught by Sue Collins. Sure, the class was challenging but never painful; everything we learned was of critical importance to understanding the backbone our society. SUE COLLINS= learning, enlightenment, and great comedy.",
            "The class isn't the most interesting but D is great! He's really funny and nice and loves what he's doing. Expect a lot of reading. Participation in class and attendance is key. He just wants you to have an opinion and think/talk about what we're discussing.",
            "I enjoyed his first year class (HIST1010) so much that I just had to take his third year one, and it was honestly well worth it! He is one of the best lecturer's around and funny as hell.",
            "Although I wasn't really interested in the subject matter itself, Arlan is an amazing prof. He's funny, energetic and really made an otherwise boring night-class bearable. If you're ever interested in anything that has to do with music and technology, Arlan is your man. Highly recommended. (oh, and his assignments are easy as well :P )",
            "Jay is a great teacher and is very clear in his description of Calculus II concepts. He is extremely funny and always engaging during class. He's the perfect balance of a teacher who actually does an effective job of explaining material and making class enjoyable.",
            "Very helpful! He really understands students and is willing to work with you. One of the best professors I've ever had! Really funny as well!",
            "i love this man. he is the best chemistry professor. if u hate and dont understand jack sht then take him. he explains really well, gives alot of examples, and doesnt move on until hes sure everybody gets it. the book isnt needed, but it helps cos u do problems off of it and it helps for the exams. hes funny too. great overall!",
            "I loved him. He cares about his students. Go to class, do the work, and you'll get a good grade. I went back to school after many years and he helped me more than any other professor. He's fun and interesting. I wish I had more classes with him. A great professor. Easy A if you try.",
            "I Love Mrs Haynie! She is probably the funniest teacher I have had yet! She is so quirky! Her world lit class was one of my favorite classes.No textbook, just a study packet she has put together herself.Her test expectations are clear and she makes literature very interesting! Take this class!!",
            "Very up to date with current events. Very current content. Great sense of humour. Highly recommend, (you da' man now dawg!)",
            "From what should be the most boring class (SAD), doing flow charts and drawings Dwayne actually manages to keep things interesting. He likes to joke around and pick on people but it's all in good fun. Although he can be tough on you in class at times his class is definitely my favorite.",
            "Fun class, easy teacher and he's always smiling. Just show up do the assignment for the day and get an A! Joke of the day is the best",
            "Very goofy. Very mind challenging but very interesting and fun.",
            "This class felt like my high school math classes. You have homework assigned every night, but not a lot. If you need help he LOVES to help. He's kind of a goofy guy so the class is a little bit more enjoyable for a math class. I would recommend him to anyone.",
            "Great teacher with interesting experience and a delightful sense of humor. You'll learn a lot in his classes!"
          ],
          "description2taxonomy": {}
        }
      }
    }
  }
}